Repository: KDE/rkward
Catalog: po/*/rkward__import_export.po
Languages: eo

source: Print details as the file is processed. This may be helpful in troubleshooting.
eo: Presu detalojn dum la dosiero estas prilaborita. Ĉi tio povas esti helpema por solvi problemojn.

source: Number of rows to skip at the top
eo: Nombro da vicoj por salti supre

source: Maximum number of rows to import
eo: Maksimuma nombro da vicoj por importi

source: Whether the first row of the file should be interpreted as column names
eo: Ĉu la unua vico de la dosiero estu interpretita kiel kolonnomoj

source: Name or number of sheet
eo: Nomo aŭ nombro de folio

source: Range
eo: Gamo/Intervalo

source: Max number of rows to read (-1 for no limit)
eo: Maksimuma nombro da vicoj por legi (-1 por neniu limo)

source: Number of rows to skip
eo: Nombro de vicoj por salti

source: Character for missing values
eo: Signo por mankantaj valoroj

source: Error handling
eo: Pritraktado de eraroj

source: Print details as the file is processed
eo: Presu detalojn dum la dosiero estas prilaborita

source: Preview not available, because package XLConnect is not installed or cannot be loaded.
eo: Antaŭrigardo ne havebla, ĉar pako XLConnect ne estas instalita aŭ ne estas ŝargita.

source: Choose the Microsoft Excel file to import a sheet from. An R object containing the data will be created. This method of importing Excel sheets is based on R package "XLconnect", and requires a working Java-setup. In case this does not work on your system, you may want to try the Perl-based alternative <link href="rkward://component/import_xls"/>.
eo: Elektu la Microsoft Excel-dosieron por importi folion. R-objekto enhavanta la datumojn estos kreita. Ĉi tiu metodo por importi Excel-foliojn baziĝas sur R-pakaĵo "XLconnect", kaj postulas funkciantan Java-agordon. Se tio ne funkcias en via sistemo, vi eble volas provi la Perl-bazitan alternativon <link href="rkward://component/import_xls"/>.

source: Numeric index or name/label of the sheet to import from the file. If you specify a name, here, make sure to quote it.
eo: Nombra indekso aŭ nomo/etikedo de la folio por importi el la dosiero. Se vi specifas nomon, ĉi tie, nepre citi ĝin.

source: Whether the first row of data should be used as column headers. Alternatively, columns are named, automatically (by index).
eo: Ĉu la unua vico de datumoj estu uzata kiel kolumnkapoj. Alternative, kolumnoj estas nomitaj, aŭtomate (laŭ indekso).

source: Numeric index or name/label of the column containing row names. If you specify a name, here, make sure to quote it. If you leave this field empty, row-names will be assigned automatically (row numbers)
eo: Nombra indekso aŭ nomo/etikedo de la kolumno enhavanta vicnomojn. Se vi specifas nomon, ĉi tie, nepre citi ĝin. Se vi lasas ĉi tiun kampon malplena, vico-nomoj estos asignitaj aŭtomate (vicaj numeroj)

source: First row of data to import within the sheet. If left to 0 (the default), the start row will be determined, automatically. Alternatively, you can specify a range in spreadsheet notation, below.
eo: Unua vico de datumoj importendaj ene de la folio. Se lasita al 0 (la defaŭlta), la komenca vico estos determinita, aŭtomate. Alternative, vi povas specifi gamon en kalkultabela notacio, sube.

source: First column of data to import within the sheet. See <label id="startrow"/>, above.
eo: Unua kolumno de datumoj por importi en la folio. Vidu <label id="startrow"/>, supre.

source: Last row of data to import within the sheet. See <label id="startrow"/>, above.
eo: Lasta vico de datumoj importendaj ene de la folio. Vidu <label id="startrow"/>, supre.

source: Last column of data to import within the sheet. See <label id="startrow"/>, above.
eo: Lasta kolumno de datumoj por importi en la folio. Vidu <label id="startrow"/>, supre.

source: Specify the range to import within the sheet in spreadsheet notation (e.g. "A10:B20").
eo: Indiku la intervalon por importi ene de la folio en kalkultabelo (ekz. "A10:B20").

source: If checked, empty leading and trailing rows will be omitted from the imported data.
eo: Se markite, malplenaj antaŭaj kaj postaj vicoj estos preterlasitaj de la importitaj datumoj.

source: If checked, empty leading and trailing columns will be omitted from the imported data.
eo: Se markite, malplenaj gvidaj kaj postaj kolumnoj estos preterlasitaj de la importitaj datumoj.

source: Allows you to override the automatic data type detection. Specify R data types such as "character" or "numeric", here. Any specification you make here will be applied to <b>all</b> imported columns (the specification will be "recycled", if necessary). To use automatic data type detection, leave this control empty, entirely. Also note that most common type conversions can also be done <i>after</i> the data has been imported.
eo: Ebligas al vi superregi la aŭtomatan datumtipdetekton. Specifu R-datumtipojn kiel "signo" aŭ "numera", ĉi tie. Ajna specifo, kiun vi faras ĉi tie, estos aplikata al <b>ĉiuj</b> importitaj kolumnoj (la specifo estos "reciklita", se necese). Por uzi aŭtomatan datumtipdetekton, lasu ĉi tiun regilon tute malplena. Notu ankaŭ, ke plej oftaj tipkonvertoj ankaŭ povas esti faritaj <i>post</i> la datumoj importitaj.

source: Index or "name" of sheet
eo: Indekso aŭ "nomo" de folio

source: Index or "name" of column with row names (if any)
eo: Indekso aŭ "nomo" de kolono kun vicnomoj (se ekzistas)

source: Rows and columns
eo: Vicoj kaj kolumnoj

source: Start row / column ("0" for automatic)
eo: Komencu vicon/kolumnon ("0" por aŭtomata)

source: Row
eo: Vico

source: Column
eo: Kolumno

source: End row / column ("0" for automatic)
eo: Fina vico/kolumno ("0" por aŭtomata)

source: - <b>or</b> Excel Range (e.g. "A10:B20") -
eo: - <b>aŭ</b> Excel Range (ekz. "A10:B20") -

source: Skip empty leading or trailing rows
eo: Saltu malplenajn antaŭajn aŭ postajn vicojn

source: Skip empty leading or trailing columns
eo: Saltu malplenajn antaŭajn aŭ postajn kolumnojn

source: Column classes (empty for automatic)
eo: Kolumnaj klasoj (malplenaj por aŭtomata)

source: Load data
eo: Ŝargi datumojn

source: Import to environment
eo: Importi al medio

source: Load an R data file.
eo: Ŝargu R-datumdosieron.

source: Choose the R file to import. This would be a file created e.g. by saving the workspace from RKWard, using the R <link href="rkward://rhelp/save">save()</link> command, or the <link href="rkward://component/save_r"/> plugin. The main difference to loading a workspace via Workspace-&gt;Open Workspace, is that the workspace is not cleaned, first, but rather merged with your existing workspace. If in doubt, use Workspace-&gt;Open Workspace, instead of this plugin.
eo: Elektu la R-dosieron por importi. Ĉi tio estus dosiero kreita ekz. konservante la laborspacon de RKWard, uzante la komandon R <link href="rkward://rhelp/save">save()</link>, aŭ la <link href="rkward://component/save_r "/> kromaĵo. La ĉefa diferenco al ŝargo de laborspaco per Workspace->Open Workspace, estas ke la laborspaco unue ne estas purigita, sed prefere kunfandita kun via ekzistanta laborspaco. Se vi dubas, uzu Laborspacon->Malfermu Laborspacon, anstataŭ ĉi tiun kromprogramon.

source: Be sure to save your workspace before using this plugin, as your variables will be overwritten, if the loaded workspace contains objects of the same names.
eo: Nepre konservu vian laborspacon antaŭ ol uzi ĉi tiun kromprogramon, ĉar viaj variabloj estos anstataŭitaj, se la ŝargita laborspaco enhavas objektojn de la samaj nomoj.

source: The filename of the file to load
eo: La dosiernomo de la dosiero por ŝargi

source: Check this option (and specify an environment), in order to load the data into an environment other than .GlobalEnv. If the specified environment does not yet exist, it will be created. If it already exists, it will be overwritten completely, i.e. deleting all objects inside it!
eo: Marku ĉi tiun elekteblon (kaj specifu medion), por ŝargi la datumojn en medion krom .GlobalEnv. Se la specifita medio ankoraŭ ne ekzistas, ĝi estos kreita. Se ĝi jam ekzistas, ĝi estos tute anstataŭita, t.e. forigante ĉiujn objektojn en ĝi!

source: Load an R data file
eo: Ŝargu R-datumdosieron

source: R data file to load
eo: R-datumdosiero por ŝargi

source: WARNING: This may overwrite existing objects in .GlobalEnv. Be sure to save your workspace, first.
eo: AVERTO: Ĉi tio povas anstataŭigi ekzistantajn objektojn en .GlobalEnv. Nepre konservu vian laborspacon unue.

source: Save to environment
eo: Konservu al medio

source: WARNING: If the environment already exists, all objects inside it will be lost.
eo: AVERTO: Se la medio jam ekzistas, ĉiuj objektoj en ĝi estos perditaj.

source: Source R file
eo: Fonta R-dosiero

source: Run an R source file.
eo: Rulu R-fontodosieron.

source: Select a file to load. This file will be loaded and interpreted as a script of R statements, which are then evaluated (see <link href="rkward://rhelp/source"/>).
eo: Elektu dosieron por ŝargi. Ĉi tiu dosiero estos ŝargita kaj interpretita kiel skripto de R-deklaroj, kiuj poste estas taksitaj (vidu <link href="rkward://rhelp/source"/>).

source: The filename of the source file to run
eo: La dosiernomo de la fontdosiero rulota

source: If checked, the working directory will be changed of the directory of the source file. This may be needed, if the source file refers to further files using relative paths.
eo: Se markite, la labordosierujo estos ŝanĝita de la dosierujo de la fontdosiero. Ĉi tio povas esti bezonata, se la fontdosiero rilatas al pliaj dosieroj uzante relativajn vojojn.

source: If checked, the source file is interpreted in a local environment, instead of the global environment. This is much safer, as no existing objects will be overwritten. On the other hand, if the purpose of the source file is to create new objects (in contrast to just producing printed output), it will have to be run in the global environment.
eo: Se markite, la fontdosiero estas interpretita en loka medio, anstataŭe de la ĉiea medio. Ĉi tio estas multe pli sekura, ĉar neniuj ekzistantaj objektoj estos anstataŭitaj. Aliflanke, se la celo de la fontdosiero estas krei novajn objektojn (kontraste al nur produktado de presita eligo), ĝi devos esti rulita en la ĉiea medio.

source: Should each source statement be echoed after parsing, and before evaluation?
eo: Ĉu ĉiu fonta deklaro devus esti eĥita post analizo, kaj antaŭ taksado?

source: What should be printed at the start of each echoed source line (to differentiate it from the output)? Leave empty for the default.
eo: Kio devus esti presita ĉe la komenco de ĉiu eĥita fontlinio (por diferencigi ĝin de la eligo)? Lasu malplena por la defaŭlta.

source: Maximum length of an echoed source line.
eo: Maksimuma longo de eĥita fontlinio.

source: Print additional diagnostics.
eo: Presu pliajn diagnozojn.

source: Print the result of each single evaluation (instead of just the final result).
eo: Presu la rezulton de ĉiu unuopa taksado (anstataŭ nur la fina rezulto).

source: Source an R file
eo: Fonto de R-dosiero

source: Main options
eo: Ĉefaj opcioj

source: Use directory of source file as working directory
eo: Uzu dosierujon de fontdosiero kiel labordosierujon

source: Run in a local environment
eo: Kuru en loka medio

source: WARNING: This may overwrite existing objects without prompting!
eo: AVERTO: Ĉi tio povas anstataŭigi ekzistantajn objektojn sen instigi!

source: Output options
eo: Eligo opcioj

source: Echo source statements
eo: Eĥaj fontaj deklaroj

source: Prompt for echoed lines (empty for default)
eo: Peti por eĥitaj linioj (malplena defaŭlte)

source: Maximal length of echoed statements
eo: Maksimuma longeco de eĥaj deklaroj

source: Verbose
eo: Vorta

source: Print eval
eo: Presi evalon

source: Export RMarkdown file
eo: Eksportu RMarkdown-dosieron

source: Choose the file to be exported.
eo: Elektu la dosieron eksportitan.

source: Set the target format for exported files. If you choose either "All formats defined in document" or "First format defined in document", the formats defined via output_format will be used, see the documentation on rmarkdown::render().
eo: Agordu la celformaton por eksportitaj dosieroj. Se vi elektas aŭ "Ĉiuj formatoj difinitaj en dokumento" aŭ "Unua formato difinita en dokumento", la formatoj difinitaj per output_format estos uzataj, vidu la dokumentadon pri rmarkdown::render().

source: Choose the target file name to export to.
eo: Elektu la cel-dosiernomon por eksporti.

source: Choose the target directory to export to, file names are automatically generated according to the formats defined in the document.
eo: Elektu la celan dosierujon por eksporti, dosiernomoj aŭtomate generiĝas laŭ la formatoj difinitaj en la dokumento.

source: Set the markdown version to use. Older v1 documents are rendered into HTML format only, using the markdown package. If in doubt, leave it to the newer v2; those documents are rendered using pandoc, which allows you to choose between various output formats. But be aware that some formats may require special configuration or templates to produce proper results.
eo: Agordu la version de markdown por uzi. Pli malnovaj v1 dokumentoj estas prezentitaj nur en HTML-formaton, uzante la markdown-pakaĵon. Se vi dubas, lasu ĝin al la pli nova v2; tiuj dokumentoj estas prezentitaj per pandoc, kiu ebligas al vi elekti inter diversaj eligformatoj. Sed konsciu, ke iuj formatoj povas postuli specialan agordon aŭ ŝablonojn por produkti taŭgajn rezultojn.

source: Export RMarkdown
eo: Eksportu RMarkdown

source: RKWard GUI to export RMarkdown documents in various formats
eo: RKWard GUI por eksporti RMarkdown-dokumentojn en diversaj formatoj

# Author name
source: Michalke
eo: Miĥalke

source: Source and target
eo: Fonto kaj celo

source: RMarkdown file
eo: RMarkdown dosiero

source: Target format
eo: Celformato

source: All formats defined in document
eo: Ĉiuj formatoj difinitaj en dokumento

source: First format defined in document
eo: Unua formato difinita en dokumento

source: Beamer presentation
eo: Beamer-prezento

source: Markdown (GitHub, old)
eo: Markdown (GitHub, malnova)

source: Vignette (HTML)
eo: Vigneto (HTML)

source: Word
eo: Vorto

source: Save as
eo: Konservi kiel

source: Save to
eo: Konservi al

source: Advanced options
eo: Altnivelaj opcioj

source: Markdown version
eo: Markdown-versio

source: Save R objects
eo: Konservu R-objektojn

source: Save one or more selected R objects to a file. <b>Note:</b> Use <i>Workspace->Save Workspace</i> for saving the complete workspace.
eo: Konservu unu aŭ plurajn elektitajn R-objektojn al dosiero. <b>Noto:</b> Uzu <i>Laborspaco->Konservi Laborspacon</i> por konservi la kompletan laborspacon.

source: Select the objects to save, and a filename to save to. Created data files can be loaded using <link href="rkward://component/load_r_object"/>.
eo: Elektu la objektojn por konservi, kaj dosiernomon por konservi. Kreitaj datumdosieroj povas esti ŝargitaj per <link href="rkward://component/load_r_object"/>.

source: One or more objects to save.
eo: Unu aŭ pluraj objektoj por konservi.

source: Location to save to.
eo: Loko por konservi.

source: Write an ascii, rather than binary representation of the object(s).
eo: Skribu ascii, prefere ol binaran prezenton de la objekto(j).

source: The file can be compressed to achieve a smaller file size. This control allows to select the method of compression. Some methods are not available for versions of R before 2.10.0.
eo: La dosiero povas esti kunpremita por atingi pli malgrandan dosiergrandecon. Ĉi tiu regilo permesas elekti la metodon de kunpremo. Iuj metodoj ne disponeblas por versioj de R antaŭ 2.10.0.

source: Compression level. Higher values indicate better compression.
eo: Kunprema nivelo. Pli altaj valoroj indikas pli bonan kunpremadon.

source: For <i>xz</i> compression, only: Enable xz "extreme" compression.
eo: Por <i>xz</i> kunpremado, nur: Ebligu xz "ekstrema" kunpremado.

source: Select variables
eo: Elektu variablojn

source: Object
eo: Objekto

source: Compression
eo: Kunpremo

source: None
eo: Neniu

source: Compression level
eo: Kunprema nivelo

source: Enable xz extreme compression
eo: Ebligu xz ekstreman kunpremadon

source: Create package skeleton
eo: Krei pakaĵskeleton

source: Select a variable
eo: Elektu variablon

source: Objects
eo: Objektoj

source: Package name
eo: Nomo de pakaĵo

source: Directory
eo: Dosierujo

source: Overwrite
eo: Anstataŭigi

source: Write Variables
eo: Skribu Variablojn

source: Write vector / matrix
eo: Skribu vektoro/matrico

source: Select a vector or matrix
eo: Elektu vektoron aŭ matricon

source: Data
eo: Datumoj

source: Space
eo: Spaco

source: Number of columns to write
eo: Nombro da kolumnoj por skribi

source: Append to existing file
eo: Aldoni al ekzistanta dosiero

source: Export Table / CSV files
eo: Eksporti Tabelon / CSV-dosierojn

source: File
eo: Dosiero

source: Export data to CSV or similar file formats.
eo: Eksportu datumojn al CSV aŭ similaj dosierformatoj.

source: Select a tabular data object (like a data frame or matrix) and choose a file to save to. All other options allow you to define the file format, handling of column and row names as well as special character handling.
eo: Elektu tabelan datuman objekton (kiel datumkadro aŭ matrico) kaj elektu dosieron por konservi. Ĉiuj aliaj elektebloj permesas al vi difini la dosierformaton, uzadon de kolumno- kaj vico-nomoj kaj ankaŭ speciala signo-traktado.

source: Select a data object to export. Valid data types are array, data.frame, matrix, character, numeric, and integer.
eo: Elektu datumon por eksporti. Validaj datumtipoj estas tabelo, data.frame, matrico, signo, nombra kaj entjero.

source: The file to save to. Existing files will be overwritten, unless the append option is checked.
eo: La dosiero por konservi. Ekzistantaj dosieroj estos anstataŭitaj, krom se la aldona elekteblo estas markita.

source: Should existing files be overwritten or the data appended? If this is greyed out, the selected preset sets this for you.
eo: Ĉu ekzistantaj dosieroj devus esti anstataŭitaj aŭ la datumoj aldonitaj? Se ĉi tio estas grizigita, la elektita antaŭmeto fiksas ĉi tion por vi.

source: Select one of the default file formats here. They will set some of the options (like field separator and decimal point) with reasonable defaults. Use the custom format if you need more control.
eo: Elektu unu el la defaŭltaj dosierformatoj ĉi tie. Ili starigos kelkajn el la elektebloj (kiel kampa apartigilo kaj dekuma punkto) kun akcepteblaj defaŭltoj. Uzu la propran formaton se vi bezonas pli da rego.

source: Specify the desired decimal point character. If this is greyed out, the selected preset sets this for you.
eo: Indiku la deziratan decimalpunktan signon. Se ĉi tio estas grizigita, la elektita antaŭmeto fiksas ĉi tion por vi.

source: Use this value as the custom decimal point character.
eo: Uzu ĉi tiun valoron kiel la propran decimalpunktan signon.

source: Specify the desired field separator character. If this is greyed out, the selected preset sets this for you.
eo: Indiku la deziratan kampan apartigilon. Se ĉi tio estas grizigita, la elektita antaŭmeto fiksas ĉi tion por vi.

source: Use this value as the custom field separator character.
eo: Uzu ĉi tiun valoron kiel la propran kampan apartigilon.

source: Decide how to deal with row names.
eo: Decidu kiel trakti vicnomojn.

source: Select a character vector to use for custom row names.
eo: Elektu signan vektoron por uzi por propraj vicnomoj.

source: Decide how to deal with column names. If this is greyed out, the selected preset sets this for you.
eo: Decidu kiel trakti kolonnomojn. Se ĉi tio estas grizigita, la elektita antaŭmeto fiksas ĉi tion por vi.

source: Select a character vector to use for custom column names.
eo: Elektu signan vektoron por uzi por propraj kolonnomoj.

source: If the default character encoding doesn't work for you, you can set a specific one here.
eo: Se la defaŭlta signokodigo ne funkcias por vi, vi povas agordi specifan ĉi tie.

source: Use this field to set a custom encoding, in case the dropdown menu doesn't list the one you need.
eo: Uzu ĉi tiun kampon por agordi propran kodigon, se la falmenuo ne listigas tiun, kiun vi bezonas.

source: Check this to have all string values quoted.
eo: Marku ĉi tion por havi ĉiujn ĉenvalorojn cititajn.

source: Controls how existing quotes in values are handled -- they can either be escaped or double quoted. If this is greyed out, the selected preset sets this for you.
eo: Regas kiel ekzistantaj citaĵoj en valoroj estas pritraktitaj -- ili povas esti aŭ ellasitaj aŭ duoble cititaj. Se ĉi tio estas grizigita, la elektita antaŭmeto fiksas ĉi tion por vi.

source: Set the character to indicate missing data.
eo: Agordu la signon por indiki mankantajn datumojn.

source: Set the character used to indicate a line break (EOL). This varies between operating systems, changing this option might help in case you run into problems when exchanging files with other people.
eo: Agordu la signon uzatan por indiki liniorompon (EOL). Ĉi tio varias inter operaciumoj, ŝanĝi ĉi tiun elekteblon povus helpi se vi renkontos problemojn dum interŝanĝado de dosieroj kun aliaj homoj.

source: <link href="rkward://rhelp/write.table"> R manual page for write.table(), which is called by this plugin. </link>
eo: <link href="rkward://rhelp/write.table"> R-manlibropaĝo por write.table(), kiu estas vokita de ĉi tiu kromaĵo. </link>

source: Data and File Format
eo: Datumoj kaj Dosiera Formato

source: Select a variable or table
eo: Elektu variablon aŭ tabelon

source: Append to file (if it exists)
eo: Aldonu al dosiero (se ĝi ekzistas)

source: File format
eo: Dosierformato

source: Custom (specify below)
eo: Propra (specifu sube)

source: Select row or column names
eo: Elektu nomojn de vicoj aŭ kolumnoj

source: Row specifications
eo: Vicospecifoj

source: Use current row names
eo: Uzu aktualajn vicnomojn

source: No names
eo: Neniuj nomoj

source: Row names (character vector)
eo: Vicnomoj (signa vektoro)

source: Column specifications
eo: Kolumnaj specifoj

source: Use current column names
eo: Uzu aktualajn kolonnomojn

source: Column names (character vector)
eo: Kolonnomoj (signa vektoro)

source: Encoding and Character Options
eo: Kodigado kaj Signaj Opcioj

source: File encoding
eo: Dosiera kodado

source: (default)
eo: (defaŭlte)

source: Custom encoding
eo: Propra kodado

source: Quote all strings
eo: Citu ĉiujn kordojn

source: Handling double quote characters
eo: Pritrakti duoblajn citilojn

source: Escape
eo: Eskapo

source: Double
eo: duobla

source: Newline character
eo: Novlinia signo

source: \n (LF: GNU/Linux, BSD, OS X)
eo: \n (LF: GNU/Linukso, BSD, OS X)

source: \r\n (CR+LF: Windows, DOS)
eo: \r\n (CR+LF: Vindozo, DOS)

source: Set or change the current working directory.
eo: Agordu aŭ ŝanĝu la nunan labordosierujon.

source: Choose a directory to set/change the working directory for R. The R function <b>setwd</b> is used to do the job.
eo: Elektu dosierujon por agordi/ŝanĝi la labordosierujon por R. La R-funkcio <b>setwd</b> estas uzata por fari la laboron.

source: Set the working directory
eo: Agordu la labordosierujon

source: Choose the Working Directory
eo: Elektu la Laboran Dosierujon

source: Data Import and Export
eo: Importo kaj Eksporto de Datumoj

source: Plugins for reading and writing data in various formats. Part of the official RKWard distribution
eo: Kromaĵoj por legi kaj skribi datumojn en diversaj formatoj. Parto de la oficiala RKWard-distribuo

source: Load R data file
eo: Ŝargu R-datumdosieron

source: Save objects as R data
eo: Konservu objektojn kiel R-datumojn

source: Export vector or matrix data
eo: Eksportu vektorajn aŭ matricajn datumojn

source: Import SPSS
eo: Importu SPSS

source: SPSS data files
eo: SPSS-datumdosieroj
