Repository: KDE/rkward
Catalog: po/*/rkward__analysis.po
Languages: eo

source: Second sample. The vectors need to be numeric.
eo: Dua specimeno. La vektoroj devas esti nombraj.

source: Alternative hypothesis to use for the test.
eo: Alternativa hipotezo por uzi por la testo.

source: Length
eo: Longo

source: Truncation lag parameter
eo: Detranĉa malfrua parametro

source: This test computes the Phillips-Perron test for the null hypothesis that x has a unit root against a stationary alternative.
eo: Tiu ĉi testo kalkulas la Phillips-Perron-teston por la nula hipotezo ke x havas unuradpiktogram kontraŭ senmova alternativo.

source: Select the data sets for which you want to perform the Phillips-Perron test. For this test the samples need to be numeric vectors (see below for details).
eo: Elektu la datumajn arojn por kiuj vi volas fari la Phillips-Perron-teston. Por ĉi tiu testo la provaĵoj devas esti nombraj vektoroj (vidu malsupre por detaloj).

source: Which version of the truncation lag parameter should be used?
eo: Kiu versio de la detranĉa malfrua parametro estu uzata?

source: Exclude missing values from calculation?
eo: Ĉu ekskludi mankantajn valorojn el kalkulo?

source: Phillips-Perron Test for Unit Roots
eo: Phillips-Perron Testo por Unuaj Radikoj

source: version of truncation lag parameter
eo: versio de detranĉa malfrua parametro

source: short
eo: mallonga

source: long
eo: longa

source: Box-Pierce and Ljung-Box Tests
eo: Box-Pierce kaj Ljung-Box Testoj

source: This test computes Box-Pierce or Ljung-Box test statistic for examining the null hypothesis of independence in a given time series.
eo: Tiu ĉi testo komputas Box-Pierce aŭ Ljung-Box teststatistpiktogram por ekzamenado de la nula hipotezo de sendependeco en antaŭfiksita temposerio.

source: Select the data sets for which you want to perform the Box-Pierce or Ljung-Box test. For this test the samples need to be numeric vectors (see below for details).
eo: Elektu la datumajn arojn por kiuj vi volas fari la Box-Pierce aŭ Ljung-Box-teston. Por ĉi tiu testo la provaĵoj devas esti nombraj vektoroj (vidu malsupre por detaloj).

source: Number of autocorrelation coefficients to base the test on.
eo: Nombro de aŭtokorelaciaj koeficientoj por bazi la teston.

source: Define type of test. Either Ljung-Box or Box-Pierce can be used.
eo: Difinu specon de testo. Aŭ Ljung-Box aŭ Box-Pierce povas esti uzataj.

source: lag
eo: malfruo

source: Type of test
eo: Tipo de testo

source: test to be performed
eo: provo farota

source: Ljung-Box
eo: Ljung-Kesto

source: Missing values cannot be handled in Hodrick-Prescott Filter
eo: Mankantaj valoroj ne povas esti pritraktitaj en Hodrick-Prescott Filtrilo

# R code comment
source: The HP Filter itself. Thanks to Grant V. Farnsworth
eo: La HP Filtrilo mem. Dankon al Grant V. Farnsworth

source: This plugin extracts and plots the long term trend of a series and (optionally) its cyclical component.
eo: Ĉi tiu kromaĵo ĉerpas kaj prezentas la longtempan tendencon de serio kaj (laŭvole) ĝian ciklan komponanton.

source: The Hodrick-Prescott filter is used to separate the long term trend of a time series from its cyclical (short term) component.
eo: La Hodrick-Prescott-filtrilo estas uzata por apartigi la longperspektivan tendencon de temposerio de ĝia cikla (mallongperspektiva) komponento.

source: In addition to the resulting series object(s), this plugin can plot them in relation with the original series provided so as to give a graphic view of the filtering operation.
eo: Aldone al la rezulta(j) serio(j) objekto(j), ĉi tiu kromaĵo povas bildigi ilin rilate al la originala serio provizita por doni grafikan vidon de la filtra operacio.

source: Select the data to be computed. It must be a single Time Series object or a Numeric Vector. NA values are not admitted.
eo: Elektu la datumojn por esti komputitaj. Ĝi devas esti ununura Tempo-Serio-objekto aŭ Numera Vektoro. NA valoroj ne estas akceptitaj.

source: This is the smoothing parameter. You have a dropdown menu with the three most common values depending on the frequency of the data (<i>Annual</i>, <i>Quarterly</i> and <i>Monthly</i>). (Default: 1600)
eo: Ĉi tiu estas la glatiga parametro. Vi havas falmenuon kun la tri plej oftaj valoroj depende de la ofteco de la datumoj (<i>Jara</i>, <i>Kvarona</i> kaj <i>Monata</i>). (Defaŭlte: 1600)

source: Select if you want to specify a lambda value yourself in the spinbox below.
eo: Elektu, se vi volas mem specifi lambdan valoron en la suban skatolon.

source: Select which resulting series should be created in the workspace. The trend of the original series is created by default. Write any name you want to use as identifier for the series. By default, it's <i>hp</i> followed by <i>trend</i> and/or <i>cycle</i>. <i>Tip: you can add the name of the original series to avoid overwriting other variables' trend/cycle (i.e. "myseries.hptrend").</i>
eo: Elektu kiun rezultan serion kreu en la laborspaco. La tendenco de la origina serio estas kreita defaŭlte. Skribu ajnan nomon, kiun vi volas uzi kiel identigilon por la serio. Defaŭlte, ĝi estas <i>hp</i> sekvata de <i>tendenco</i> kaj/aŭ <i>ciklo</i>. <i>Konsileto: vi povas aldoni la nomon de la origina serio por eviti anstataŭi la tendencon/ciklon de aliaj variabloj (t.e. "myseries.hptrend").</i>

source: Plot the cyclical component below the trend graph. (Default: YES)
eo: Grafiku la ciklan komponanton sub la tendenca grafiko. (Defaŭlte: JES)

source: Here you can adjust the line width, type and colour of each series on the plot. (Default: blue series, red trend and dark green cycle)
eo: Ĉi tie vi povas ĝustigi la linilarĝon, tipon kaj koloron de ĉiu serio sur la grafiko. (Defaŭlte: blua serio, ruĝa tendenco kaj malhelverda ciklo)

source: Here you can specify the text on the Y axis label of the trend plot (upper). If empty, the default label is the name of the original series plus <i>, Trend</i>.
eo: Ĉi tie vi povas specifi la tekston sur la Y-akso-etikedo de la tendenca grafiko (supra). Se malplena, la defaŭlta etikedo estas la nomo de la origina serio plus <i>, Tendenco</i>.

source: Here you can specify the text on the Y axis label of the cycle plot (lower - if applicable). If empty, the default label is <i>Cycle</i>.
eo: Ĉi tie vi povas specifi la tekston sur la Y-akso-etikedo de la cikla grafiko (malsupra - se aplikeble). Se malplena, la defaŭlta etikedo estas <i>Ciklo</i>.

source: Enable or disable the labels being evaluated as literal (quoted) strings. To achieve a line-break (in a quoted string), enter '\n'. (Default: YES)
eo: Ebligu aŭ malebligu la etikedojn taksitajn kiel laŭvortajn (citajn) ĉenojn. Por atingi linio-rompon (en citita ĉeno), enigu '\n'. (Defaŭlte: JES)

source: Select Variable
eo: Elektu Variablo

source: Variable:
eo: Variablo:

source: 100 (Annual)
eo: 100 (Jaraj)

source: 1600 (Quarterly)
eo: 1600 (Kvaronjare)

source: 14400 (Monthly)
eo: 14400 (Ĉimonate)

source: Custom value
eo: Propra valoro

source: Output series
eo: Eligo serio

source: Save trend
eo: Konservu tendencon

source: Save cycle
eo: Konservu ciklon

source: Plot options
eo: Grafiko-opcioj

source: Plot Cycle
eo: Grafiko-Ciklo

source: Lines
eo: Linioj

source: Original series
eo: Origina serio

source: Line width
eo: Liniolarĝo

source: Line type
eo: Liniotipo

source: default
eo: norma

source: Solid
eo: Solida

source: Dashed
eo: Paŭzita

source: Dotted
eo: Punktita

source: Long-dash
eo: Long-streko

source: Two-dash
eo: Du-streko

source: Trend
eo: Tendenco

source: Cycle
eo: Ciklo

source: Labels (leave empty for default)
eo: Etikedoj (lasu malplenaj defaŭlte)

source: Original series and trend Y axis label
eo: Origina serio kaj tendenca Y-akso-etikedo

source: Cycle Y axis label
eo: Cikla Y-akso etikedo

source: Interpret these labels as literal (quoted) strings?
eo: Ĉu interpreti ĉi tiujn etikedojn kiel laŭvortajn (cititajn) ĉenojn?

source: interpret as string
eo: interpreti kiel ĉeno

# R code comment
source: remove NAs
eo: forigi NAojn

source: KPSS Level
eo: KPSS-nivelo

source: KPSS Trend
eo: KPSS Tendenco

source: KPSS Test for Level Stationarity
eo: KPSS Testo por Nivela Senmoveco

source: This test computes the Kwiatkowski-Phillips-Schmidt-Shin (KPSS) test for the null hypothesis that x is level or trend stationary.
eo: Ĉi tiu testo kalkulas la Kwiatkowski-Phillips-Schmidt-Shin (KPSS) teston por la nula hipotezo ke x estas nivela aŭ tendenco senmova.

source: Select the data sets for which you want to perform the Kwiatkowski-Phillips-Schmidt-Shin (KPSS) test. For this test the samples need to be numeric vectors (see below for details).
eo: Elektu la datumajn arojn por kiuj vi volas fari la provon Kwiatkowski-Phillips-Schmidt-Shin (KPSS). Por ĉi tiu testo la provaĵoj devas esti nombraj vektoroj (vidu malsupre por detaloj).

source: Indicates the null hypothesis and must be one of "Level" (default) or "Trend".
eo: Indikas la nulan hipotezon kaj devas esti unu el "Nivelo" (defaŭlte) aŭ "Tendenco".

source: Defines whether the short or long version of the truncation lag parameter is used.
eo: Difinas ĉu la mallonga aŭ longa versio de la detranĉa malfruo parametro estas uzata.

source: null hypothesis
eo: nula hipotezo

source: Level
eo: Nivelo

source: Bartlett's K-squared
eo: K-kvadrato de Bartlett

source: This test performs the Bartlett Test of Homogeneity of Variances.
eo: Ĉi tiu testo elfaras la Bartlett-Teston de Homogeneco de Variancoj.

source: Select several numeric vectors to perform Bartlett's test of the null that the variances in each of the samples are the same.
eo: Elektu plurajn nombrajn vektorojn por plenumi la teston de Bartlett pri la nulo, ke la variancoj en ĉiu el la specimenoj estas la samaj.

source: The samples to be checked for equal variance. The vectors need to be numeric, but don't need to have the same length.
eo: La specimenoj por esti kontrolitaj por egala varianco. La vektoroj devas esti nombraj, sed ne bezonas havi la saman longon.

source: Bartlett Test of Homogeneity of Variances
eo: Bartlett Testo de Homogeneco de Variancoj

source: samples
eo: specimenoj

source: Numerator DF
eo: Numeristo DF

source: Denominator DF
eo: Noministo DF

source: Lower CI
eo: Malsupra CI

source: Upper CI
eo: Supra CI

source: ratio of variances
eo: rilatumo de variancoj

source: This test performs the F Test to compare two variances.
eo: Ĉi tiu testo elfaras la F-Teston por kompari du variancojn.

source: Select two samples from normal populations to compare the variances by the F test. For this test the samples need to be numeric vectors (see below for details).
eo: Elektu du specimenojn el normalaj populacioj por kompari la variancojn per la F-testo. Por ĉi tiu testo la provaĵoj devas esti nombraj vektoroj (vidu malsupre por detaloj).

source: First sample (numeric vector).
eo: Unua specimeno (nombra vektoro).

source: Second sample (numeric vector).
eo: Dua specimeno (nombra vektoro).

source: Alternative hypothesis of the test.
eo: Alternativa hipotezo de la testo.

source: Defines the hypothesized ratio of the population variances.
eo: Difinas la hipotezitan rilatumon de la populaciovariancoj.

source: Defines the confidence level of the interval (95% is typical).
eo: Difinas la konfidan nivelon de la intervalo (95% estas tipa).

source: F test
eo: F-testo

source: Hypothesized ratio
eo: Hipotezita rilatumo

source: Confidence level
eo: Konfida nivelo

source: Fligner-Killeen:med X^2 test statistic
eo: Fligner-Killeen:med X^2-teststatistiko

source: This test performs the Fligner-Killeen Test of Homogeneity of Variances.
eo: Ĉi tiu testo elfaras la Fligner-Killeen-Teston de Homogeneco de Variancoj.

source: Select several numeric vectors to perform the Fligner-Killeen (median) test of the null that the variances in each of the samples are the same.
eo: Elektu plurajn nombrajn vektorojn por fari la Fligner-Killeen (mediano) teston de la nulo ke la variancoj en ĉiu el la specimenoj estas la samaj.

source: Fligner-Killeen Test of Homogeneity of Variances
eo: Fligner-Killeen Testo de Homogeneco de Variancoj

source: This test performs the Levene's test for homogeneity of variance across groups.
eo: Tiu testo elfaras la teston de la Levene por homogeneco de varianco trans grupoj.

source: Select the response variable and the factor defining groups to test for homogeneity of variance across groups.
eo: Elektu la respondvariablon kaj la faktoron difinantajn grupojn por testi pri homogeneco de varianco inter grupoj.

source: response variable (numeric vector).
eo: respondvariablo (nombra vektoro).

source: factor defining groups (factor).
eo: faktoro difinantaj grupoj (faktoro).

source: Levene, H. (1960). In Contributions to Probability and Statistics: Essays in Honor of Harold Hotelling, I. Olkin et al. eds., Stanford University Press, pp. 278-292.
eo: Levene, H. (1960). En Kontribuoj al Probability and Statistics: Eseoj en Honoro de Harold Hotelling, I. Olkin et al. Red., Stanford University Press, pp 278-292.

source: response variable
eo: respondvariablo

source: groups
eo: grupoj

source: Continuity correction in normal approximation for p-value
eo: Kontinueckorekto en normala alproksimiĝo por p-valoro

source: Location Shift
eo: Loka Ŝanĝo

source: Hypothesis
eo: Hipotezo

source: Confidence interval percent
eo: Konfida intervalo procento

source: Confidence interval of difference
eo: Konfida intervalo de diferenco

source: Difference in Location
eo: Diferenco en Loko

source: This test performs the Wilcoxon Rank Sum and Signed Rank Tests (the first is equivalent to the Mann-Whitney test).
eo: Tiu ĉi testo elfaras la Wilcoxon Rank Sum kaj Signed Rank Tests (la unua estas ekvivalenta al la Mann-Whitney-testo).

source: Select a single vector (or paired test) to perform a Wilcoxon signed rank test on the null that the true distribution of x (or the difference between the paired vectors) is symmetric about 0 (or the specified location).
eo: Elektu ununuran vektoron (aŭ parigitan teston) por plenumi Wilcoxon-signitan rangoteston sur la nulo ke la vera distribuo de x (aŭ la diferenco inter la paritaj vektoroj) estas simetria ĉirkaŭ 0 (aŭ la specifita loko).

source: Select two vectors to perform a Wilcoxon rank sum test (equivalent to the Mann-Whitney test: see <link href="rkward://rhelp/wilcox.test"/> for details) on the null that the distributions of x and y differ (by 0 or the specified location shift).
eo: Elektu du vektorojn por fari Wilcoxon-rangan sumon-teston (ekvivalenta al la Mann-Whitney-testo: vidu <link href="rkward://rhelp/wilcox.test"/> por detaloj) pri la nulo, ke la distribuoj de x kaj y malsamas (per 0 aŭ la specifita lokoŝanĝo).

source: The alternative hypothesis. "greater" means that x is shifted to the right of y / of the location parameter.
eo: La alternativa hipotezo. "pli granda" signifas ke x estas movita dekstren de y / de la loka parametro.

source: Check this for a paired test (Wilcoxon signed rank test of the difference between the two vectors).
eo: Marku ĉi tion por parigita testo (Wilcoxon subskribita rangotesto de la diferenco inter la du vektoroj).

source: Check this if you want the confidence interval to be computed/printed.
eo: Marku ĉi tion se vi volas, ke la konfida intervalo estu komputita/presita.

source: Confidence level of the printed confidence interval.
eo: Konfida nivelo de la presita konfidenca intervalo.

source: The location / location shift to form the null hypothesis.
eo: La loko/lokŝanĝo por formi la nulan hipotezon.

source: Should an exact p-value be computed? By default ("Automatic") an asymptomatic p-value is calculated if and only if you have less than 50 cases per group without binding when an exact test should be performed.
eo: Ĉu preciza p-valoro estu kalkulita? Defaŭlte ("Aŭtomata") sensimptoma p-valoro estas kalkulita se kaj nur se vi havas malpli ol 50 kazojn per grupo sen ligado kiam preciza testo devus esti farita.

source: Check this option to compute an exact p-value even in the presence of ties.
eo: Marku ĉi tiun elekteblon por kalkuli precizan p-valoron eĉ en ĉeesto de ligoj.

source: If checked a continuity correction in the normal approximation for the p-value is applied.
eo: Se markite, kontinueckorekto en la normala aproksimado por la p-valoro estas aplikata.

source: Wilcoxon/Mann-Whitney Test
eo: Wilcoxon/Mann-Whitney Testo

# compare against
source: against (optional)
eo: kontraŭ (laŭvola)

source: First is less
eo: Unue estas malpli

source: Paired test
eo: Parigita testo

source: Save results to workspace
eo: Konservu rezultojn al laborspaco

source: Location (shift) to test against (mu)
eo: Loko (ŝanĝo) por testi kontraŭ (mu)

source: p-value options
eo: p-valoraj opcioj

source: Compute exact p-value
eo: Kalkuli precizan p-valoron

source: Apply continuity correction
eo: Apliki kontinuan korekton

source: Allow ties
eo: Permesu kravatojn

# R code comment
source: Split each input variable by grouping factor(s)
eo: Dividu ĉiun enigvariablon per grupigo de faktoro(j)

# R code comment
source: Convert nested list into flat list
eo: Konverti nestitan liston en ebenan liston

source: Object
eo: Objekto

# R code comment
source: we wrap each single call in a "try" statement to always continue on errors.
eo: ni envolvas ĉiun unuopan vokon en "try" deklaro por ĉiam daŭrigi pri eraroj.

source: mean
eo: signifas

source: geometric mean
eo: geometria meznombro

source: interquantile mean
eo: interkvantila meznombro

source: harmonic mean
eo: harmonia meznombro

source: median
eo: mediano

source: max
eo: maks

source: standard deviation
eo: norma devio

# noun
source: sum
eo: sumo

source: product
eo: produkto

source: Median Absolute Deviation
eo: Meza Absoluta Devio

source: total length (N)
eo: tuta longo (N)

source: number of NAs
eo: nombro da NA-oj

source: Descriptive statistics
eo: Priskriba statistiko

source: Compute the most common descriptive statistics for one or more numeric vectors
eo: Kalkulu la plej oftajn priskribajn statistikojn por unu aŭ pluraj nombraj vektoroj

source: Select one or more objects to analyse. For most types of analysis, the objects need to be numeric vectors. On the subsequent tabs/pages specify, which statistics you want computed (see below for details).
eo: Elektu unu aŭ plurajn objektojn por analizi. Por plej multaj specoj de analizo, la objektoj devas esti nombraj vektoroj. Sur la postaj langetoj/paĝoj specifu, kiajn statistikojn vi volas komputi (vidu sube por detaloj).

source: Each selected variable will be analysed independently of the others. NA values are excluded from the calculations.
eo: Ĉiu elektita variablo estos analizita sendepende de la aliaj. NA-valoroj estas ekskluditaj de la kalkuloj.

source: Select one or more numeric vectors to analyse
eo: Elektu unu aŭ plurajn nombrajn vektorojn por analizi

source: Optionally select one or more grouping factors by which to split each input vector. The grouping factors have to be of the same length as the input vectors (and thus, all input vectors have to be of the same length, if using any grouping). If specifying more than one grouping factor, separate splits will be performed for each combination of values of the grouping factors.
eo: Laŭvole elektu unu aŭ plurajn grupigajn faktorojn per kiuj disfendi ĉiun enigvektoron. La grupigfaktoroj devas esti de la sama longo kiel la enigvektoroj (kaj tiel, ĉiuj enigvektoroj devas esti de la sama longo, se uzado de ajna grupiĝo). Se oni specifas pli ol unu grupigan faktoron, apartaj disigoj estos faritaj por ĉiu kombinaĵo de valoroj de la grupigfaktoroj.

source: Should the mean value be computed?
eo: Ĉu la mezvaloro estu kalkulita?

source: Trim of the mean. See <link href="rkward://rhelp/mean"/>
eo: Trim de la meznombro. Vidu <link href="rkward://rhelp/mean"/>

source: Should the geometric mean value be computed?
eo: Ĉu la geometria mezvaloro estu kalkulita?

source: Should the interquantile mean value be computed?
eo: Ĉu la interkvantila mezvaloro estu kalkulita?

source: Compute the standard deviation?
eo: Kalkuli la norman devion?

source: Should the median value be computed?
eo: Ĉu la meza valoro estu kalkulita?

source: Compute the median absolute deviation, i.e., the (lo-/hi-) median of the absolute deviations from the median, and (by default) adjust by a factor for asymptotically normal consistency (see <link href="rkward://rhelp/mad"/>).
eo: Kalkulu la mezan absolutan devion, t.e., la (lo-/hi-) medianon de la absolutaj devioj de la mediano, kaj (defaŭlte) ĝustigu per faktoro por asimptote normala konsistenco (vidu <link href="rkward://". help/freneza"/>).

source: Scale factor to use when computing the median absolute deviation
eo: Skalfaktoro por uzi dum komputado de la mediana absoluta devio

source: How to treat even size samples: Average the two middle values, take the lower, or take the higher
eo: Kiel trakti egalgrandajn specimenojn: Mezumu la du mezajn valorojn, prenu la pli malaltan, aŭ prenu la pli altan

source: Compute the range, i.e. lowest and highest value
eo: Kalkulu la intervalon, t.e. plej malalta kaj plej alta valoro

source: Compute the sum of all values
eo: Kalkulu la sumon de ĉiuj valoroj

source: Compute the product of all values
eo: Kalkuli la produkton de ĉiuj valoroj

source: Count the total number of values, and the number of missing values (NAs)
eo: Kalkulu la totalan nombron da valoroj, kaj la nombron da mankantaj valoroj (NAoj)

source: group by:
eo: grupigi per:

source: Save results to file
eo: Konservu rezultojn al dosiero

source: Name of the file
eo: Nomo de la dosiero

source: Mean Standard Deviation
eo: Meza Norma Devio

source: Trim of mean
eo: Trim de meznombro

source: Geometric mean
eo: Geometria meznombro

source: Interquantile mean
eo: Interkvantila meznombro

source: Harmonic mean
eo: Harmonia meznombro

source: Standard deviation
eo: Norma devio

source: Median, MAD
eo: Mediano, MAD

source: Median
eo: Mediano

source: Median Absolute Deviation (mad)
eo: Mediana absoluta Devio (freneza)

source: mad
eo: freneza

source: Constant
eo: Konstanta

source: Treatment of even sample sizes
eo: Traktado de eĉ specimenaj grandecoj

source: use lo-median
eo: uzu lo-medianon

source: use average
eo: uzi mezumon

source: use hi-median
eo: uzu hi-medianon

source: Range, Sum, Product and Length
eo: Gamo, Sumo, Produkto kaj Longo

source: range
eo: gamo/Intervalo

source: sum
eo: sumo

source: Length and NAs
eo: Longo kaj NAs

source: Legend:
eo: Legendo:

source: Correlation Matrix Plot. On top the (absolute) value of the correlation is presented plus the result of the cor.test as stars. On bottom, the bivariate scatterplots are plotted with a fitted line. The graph and the code can be found at <link href="http://addictedtor.free.fr/graphiques/RGraphGallery.php?graph=137">R Graph Gallery (137) Correlation Matrix</link>, from where was adapted and formatted for RKWard.
eo: Korelacia Matrico-Grafiko. Supre la (absoluta) valoro de la korelacio estas prezentita plus la rezulto de la kor.testo kiel steloj. Sur fundo, la duvariaj disaj diagramoj estas punktitaj kun konvenita linio. La grafikaĵo kaj la kodo troveblas ĉe <link href="http://addictedtor.free.fr/graphiques/RGraphGallery.php?graph=137">R Graph Gallery (137) Korelacia Matrico</link>, de kie estis adaptita kaj formatita por RKWard.

source: Choose one or more objects to be plotted. Choose the method to be used, how to treat missing values, what precision you want, and if you want to scale text.
eo: Elektu unu aŭ plurajn objektojn por esti komplotataj. Elektu la metodon uzatan, kiel trakti mankantajn valorojn, kian precizecon vi volas, kaj se vi volas skali tekston.

source: Select a data matrix or a numeric data frame or more than one variables from a data matrix
eo: Elektu datummatricon aŭ nombran datumkadron aŭ pli ol unu variablojn el datummatrico
