Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: When looking for a particular function, you may want to exclude 'data' objects, and vice versa. This control allows you to limit the list to objects that are not (or do not contain) functions, or to those that are (or contain) functions.
ar: عند البحث عن وظيفة معينة، قد ترغب في استثناء كائنات 'البيانات'، والعكس صحيح. يسمح لك هذا التحكم بتقييد القائمة إلى الكائنات التي ليست (أو لا تحتوي على) وظائف، أو إلى تلك التي هي (أو تحتوي على) وظائف.
ru: При поиске определённой функции можно исключить объекты «данных» (и наоборот). Этот параметр позволяет ограничить список только теми объектами, которые не являются функциями (или не содержат их), или теми объектами, которые являются функциями (или содержат их).
tr: Belirli bir işlevi ararken “veri” nesnelerini dışlamak isteyebilirsiniz (veya bunun tersi de geçerlidir). Bu denetim, listeyi işlev olmayan (veya içermeyen) veya işlev olan (veya içeren) nesnelerle sınırlamanıza olanak tanır.

source: Reset filters
ar: أعِد ضبط المرشحات
ru: Сбросить
tr: Süzgeçleri sıfırla

source: Discards the current object search filters
ar: تجاهَل مُرشِّحات البحث عن الكائنات الحالية
ru: Сбрасывает текущие фильтры поиска объектов
tr: Geçerli nesne arama süzgeçlerini atar

source: Show Fields
ar: اعرض الحقول
ru: Показать поля
tr: Alanları Göster

source: Select destination file name
ar: اختار اسم ملف الوجهة
ru: Выберите имя файла назначения
tr: Hedef dosya adını seçin

source: RKWard Output Files [*.rko](*.rko)
ar: ملفات إخراج أر كي وارد [*.rko](*.rko)
ru: Файлы вывода RKWard [*.rko](*.rko)
tr: RKWard Çıktısı Dosyaları [*.rko](*.rko)

source: All Files [*](*)
ar: كلّ الملفّات [*](*)
ru: Все файлы [*](*)
tr: Tüm dosyalar [*](*)

source: File selection canceled
ar: ألغِ اختيار الملف
ru: Выбор файла отменён
tr: Dosya seçimi iptal edildi

source: Are you sure you want to overwrite the existing file '%1'?
ar: هل أنت متأكد من أنك تريد الكتابة فوق الملف الحالي '%1'؟
ru: Перезаписать существующий файл «%1»?
tr: Var olan “%1” dosyasının üzerine yazmak istediğinizden emin misiniz?

source: Overwrite?
ar: الكتابة فوق؟
ru: Перезаписать?
tr: Üzerine Yazılsın mı?

source: User canceled
ar: أُلغِي المستخدم
ru: Операция отменена пользователем
tr: Kullanıcı iptal etti

source: Not overwriting existing file
ar: لا تكتب فوق الملف الحالي
ru: Перезапись существующего файла не выполняется
tr: Var olan dosyanın üzerine yazılmıyor

source: Error while writing temporary output archive %1
ar: حدث خطأ أثناء كتابة أرشيف الإخراج المؤقت %1
ru: Ошибка при записи временного архива вывода %1
tr: Geçici çıktı arşivi %1 yazılırken hata

source: Failure to remove existing file %1. Missing permissions?
ar: فشل في إزالة الملف الحالي %1. هل الصلاحيات مفقودة؟
ru: Не удалось удалить существующий файл «%1». Недостаточно прав?
tr: Var olan %1 dosyası kaldırılamadı. İzinler yetersiz olabilir mi?

source: Failure while copying output archive to %1
ar: فشل أثناء نسخ أرشيف الإخراج إلى %1
ru: Ошибка при копировании архива вывода %1
tr: Çıktı arşivi, %1 konumuna kopyalanamadı

source: The path %1 does not exist or is not a file.
ar: المسار %1 غير موجود أو ليس ملفًا.
ru: Путь %1 не существует или не является файлом.
tr: %1 yolu yok veya bir dosya değil.

source: Failure to open %1. Not an rkward output file?
ar: فشل في فتح %1. هل هو ليس ملف إخراج rkward؟
ru: Не удалось открыть %1. Не является файлом вывода rkward?
tr: %1 açılamadı. Bir RKWard çıktı dosyası olmayabilir mi?

source: Output directory %1 is already in use.
ar: مجلد الإخراج %1 قيد الاستخدام بالفعل.
ru: Выходной каталог %1 уже используется.
tr: Çıktı dizini %1, halihazırda kullanımda.

source: Output had no modifications. Nothing reverted.
ar: لم يجرِ أي تعديل على الإخراج. لا شيء ارتُجِع.
ru: В выведенных данных не было изменений. Нечего отменять.
tr: Çıktıda değişiklik yoktu. Hiçbir şey geri döndürülmedi.

source: This output has not been saved before. Reverting will clear it, entirely. Are you sure you want to proceed?
ar: لم يُحفَظ هذا الإخراج من قبل. سـ يمحوه الارتجاع بالكامل. هل أنت متأكد من أنك تريد المتابعة؟
ru: Эти выведенные данные ранее не сохранялись. Отмена приведёт к их полной очистке. Продолжить?
tr: Bu çıktı daha önce kaydedilmedi. Geri dönmek onu tamamen temizleyecektir. Sürdürmek istediğinizden emin misiniz?

source: Reverting will destroy any changes, since the last time you saved (%1). Are you sure you want to proceed?
ar: سـ يدمّر الارتجاع أي تغييرات، منذ آخر مرة حفظت فيها (%1). هل أنت متأكد من أنك تريد المتابعة؟
ru: Отмена уничтожит все изменения с момента последнего сохранения (%1). Продолжить?
tr: Geri döndürme işlemi, son kaydetmenizden bu yana (%1) yapılan tüm değişiklikleri yok edecektir. Sürdürmek istediğinizden emin misiniz?

source: User canceled.
ar: أُلغِي المستخدم.
ru: Операция отменена пользователем.
tr: Kullanıcı iptal etti

source: Clearing will destroy any unsaved changes, and - upon saving - also saved changes. Are you sure you want to proceed?
ar: سـ يدمّر المسح أي تغييرات غير محفوظة، وعند الحفظ - سـ يدمّر التغييرات المحفوظة أيضًا. هل أنت متأكد من أنك تريد المتابعة؟
ru: Очистка уничтожит все несохранённые изменения, а также (после сохранения) сохранённые изменения. Продолжить?
tr: Temizleme işlemi, kaydedilmemiş tüm değişiklikleri ve kaydetme sonrasında kaydedilen değişiklikleri de yok edecektir. Sürdürmek istediğinizden emin misiniz?

source: Output is not empty. Not clearing it.
ar: الإخراج ليس فارغًا. لا تمسحه.
ru: Выведенные данные не пусты. Очистка не выполняется.
tr: Çıktı boş değil. Temizlenmeyecek.

source: [Unnamed]
ar: [غير مسمى]
ru: [Без имени]
tr: [Adsız]

source: Output has been modified. Not closing it.
ar: الإخراج معدَّل. لا تغلقه.
ru: Выведенные данные были изменены. Закрытие не выполняется.
tr: Çıktı değiştirildi. Kapatılmayacak.

source: The output has been modified, and closing it will discard all changes. What do you want to do?
ar: الإخراج معدَّل، وسيؤدي إغلاقه إلى تجاهل جميع التغييرات. ما الذي تريد فعله؟
ru: Выведенные данные изменены, закрытие приведёт к отмене всех изменений. Что следует сделать?
tr: Çıktı değiştirildi ve kapatıldığında tüm değişiklikler atılacak. Ne yapmak istiyorsunuz?

source: Discard unsaved changes?
ar: تجاهَل التغييرات غير المحفوظة؟
ru: Отменить несохранённые изменения?
tr: Kaydedilmeyen Değişiklikleri At?

source: New empty output directory has been created, automatically
ar: أُنشِئ مجلد إخراج فارغ جديد، بـ آلي
ru: Автоматически создан новый пустой выходной каталог
tr: Yeni boş çıktı dizini kendiliğinden oluşturuldu

source: Output has been activated, automatically
ar: نُشِّطَ الإخراج، بـ آلي
ru: Автоматически активирован вывод
tr: Çıktı, kendiliğinden etkinleştirildi

source: Output '%1' is already loaded in this session. Cannot create it.
ar: الإخراج '%1' مُحمَّل بالفعل في هذه الجلسة. لا يُمكِن إنشاؤه.
ru: Вывод «%1» уже загружен в этом сеансе. Его нельзя создать.
tr: “%1” çıktısı bu oturumda halihazırda yüklü. Oluşturulamıyor.

source: A file named '%1' already exists. Cannot create it.
ar: ملف باسم '%1' موجود بالفعل. لا يُمكِن إنشاؤه.
ru: Файл с именем «%1» уже существует. Его нельзя создать.
tr: “%1” adlı bir dosya halihazırda var. Oluşturulamıyor.

source: File '%1' does not exist.
ar: الملفّ '%1' غير موجود.
ru: Файл «%1» не существует.
tr: “%1” dosyası yok.

source: The output identified by '%1' is not loaded in this session.
ar: الإخراج المحدَّد بـ '%1' غير مُحمَّل في هذه الجلسة.
ru: Вывод с идентификатором «%1» не был загружен в этом сеансе.
tr: “%1” tarafından tanımlanan çıktı bu oturumda yüklü değil.

source: Unhandled output command '%1'
ar: أمر إخراج غير مُعالَج '%1'
ru: Необработанная команда вывода «%1»
tr: İşlenmeyen çıktı komutu “%1”

source: <b>There has been an error while running the command. See below for output details</b>
ar: <b>حدث خطأ أثناء تشغيل الأمر. انظر أدناه لتفاصيل الإخراج</b>

source: Output
ar: الخرج
ru: Вывод
tr: Çıktı

source: Show Output
ar: اعرض الخرج
ru: Показать вывод
tr: Çıktıyı Göster

source: Cancel
ar: ألغِ
ru: Отмена
tr: İptal

source: <b>An error occurred</b> (see below for details)
ar: <b>حدث خطأ</b> (انظر أدناه للتفاصيل)
ru: <b>Произошла ошибка</b> (подробные сведения доступны ниже)
tr: <b>Bir hata oluştu</b> (ayrıntılar için aşağıya bakın)

source: <b>Done</b>
ar: <b>تمّ</b>
ru: <b>Готово</b>
tr: <b>Tamamlandı</b>

source: Close
ar: أغلق
ru: Закрыть
tr: Kapat

source: Keep waiting
ar: استمر في الانتظار
ru: Подождать ещё
tr: Beklemeyi Sürdür

source: Closing this window will cancel the current operation. Are you sure?
ar: إغلاق هذه النافذة سـ يلغي العملية الحالية. هل أنت متأكد؟
ru: Закрытие окна приведёт к отмене текущей операции. Действительно сделать это?
tr: Bu pencereyi kapatmak geçerli işlemi iptal edecek. Emin misiniz?

source: Cancel operation
ar: ألغِ العمليّة
ru: Отменить операцию
tr: İşlemi İptal Et

source: Cancel && Close
ar: ألغِ و أغلِق
ru: Отменить и закрыть
tr: İptal Et ve Kapat

source: An operation is still running, please wait.
ar: عملية ما لا تزال قيد التشغيل، رجاءً انتظر.
ru: Операция ещё выполняется, подождите.
tr: Bir işlem hâlâ sürüyor, lütfen bekleyin.

source: Change
ar: غيّر
ru: Изменить
tr: Değiştir

source: Overwrite
ar: استبدل
ru: Перезаписать
tr: Üzerine Yaz

source: The given object name already exists
ar: اسم الكائن المُعطَى موجود بالفعل
ru: Объект с указанным именем уже существует
tr: Verilen nesne adı halihazırda var

source: Parent object: %1
ar: الكائن الأصل: %1
ru: Родительский объект: %1
tr: Üst nesne: %1

source: Select parent object
ar: اختار الكائن الأصل
ru: Выбор родительского объекта
tr: Üst Nesneyi Seç

source: Paste special...
ar: لصق خاص...
ru: Специальная вставка…
tr: Özel Yapıştır…

source: Paste Special...
ar: لصق خاص...
ru: Специальная вставка
tr: Özel Yapıştır…

source: Paste Mode
ar: وضع اللصق
ru: Режим вставки
tr: Yapıştırma Kipi

source: Single string
ar: سلسلة مفردة
ru: Одиночная строка
tr: Tek dizi

source: Vector
ar: متجه
ru: Вектор
tr: Vektör

source: data.frame
ar: إطار بيانات

source: Field Separator
ar: فاصل الحقول
ru: Разделитель полей
tr: Alan Ayırıcısı

source: Tab
ar: محرف جدولة
ru: Табуляция
tr: Sekme

source: Comma
ar: فاصلة
ru: Запятая
tr: Virgül

source: Single space
ar: مسافة مفردة
ru: Одинарный пробел
tr: Tek boşluk

source: Any whitespace
ar: أي مسافة بيضاء
ru: Любое пустое пространство
tr: Herhangi bir boşluk

source: Other:
ar: أخرى:
ru: Другое:
tr: Diğer:

source: Quoting
ar: الاقتباس
ru: Кавычки
tr: Alıntı

source: Do not quote values
ar: لا تقتبس القيم
ru: Не брать значения в кавычки
tr: Değerleri alıntılama

source: Automatic
ar: آليّ
ru: Автоматически
tr: Kendiliğinden

source: Quote all values
ar: اقتبس جميع القيم
ru: Брать в кавычки все значения
tr: Tüm değerleri alıntıla

source: Labels
ar: اللصائق
ru: Подписи
tr: Etiketler

source: First row contains labels
ar: الصف الأول يحتوي على لصائق
ru: Первая строка содержит подписи
tr: İlk satır etiketleri içerir

source: First column contains labels
ar: العمود الأول يحتوي على لصائق
ru: Первый столбец содержит подписи
tr: İlk sütun etiketleri içerir

source: Transformations
ar: تحويلات
ru: Преобразования
tr: Dönüşümler

source: Reverse horizontally
ar: اعكِس أفقيًا
ru: Перевернуть по горизонтали
tr: Yatay olarak ters çevir

source: Reverse vertically
ar: اعكِس عموديًا
ru: Перевернуть по вертикали
tr: Dikey olarak ters çevir

source: Flip rows/columns
ar: اقلِب الصفوف/الأعمدة
ru: Поменять местами строки и столбцы
tr: Satırları/Sütunları ters çevir

source: Insert NAs where needed
ar: أدخِل NA حيثما لزم الأمر
ru: Вставить «Н/Д», где требуется
tr: Gereken yere NA ekle

source: Command failed to parse. Try using <i>Edit->Paste special...</i> in the R Console window for better diagnostics.
ar: فشل الأمر في التحليل. جرب استخدام <i>تحرير->لصق خاص...</i> في نافذة طرفية R لتشخيص أفضل.
ru: Не удалось обработать команду. Чтобы получить более подробные диагностические данные, воспользуйтесь пунктом меню <i>Правка -> Специальная вставка…</i> в окне консоли R.
tr: Komut ayrıştırılamadı. Daha iyi tanılama için R Konsolu penceresinde <i>Düzen → Özel Yapıştır…</i> seçeneğini kullanmayı deneyin.

source: Pasting object from clipboard data failed.
ar: فشل لصق الكائن من بيانات الحافظة.
ru: Не удалось вставить объект из данных в буфере обмена.
tr: Panodan nesne yapıştırılamadı.

source: Paste failed
ar: فشل اللصق
ru: Не удалось выполнить вставку
tr: Yapıştırılamadı

source: Copy lines to output
ar: انسخ الأسطر إلى الإخراج
ru: Скопировать строки в вывод
tr: Satırları Çıktıya Kopyala

source: Run line / selection
ar: شغِّل السطر / التحديد
ru: Выполнить строку или выделенный фрагмент
tr: Satırı/Seçimi Çalıştır

source: Runs the current selection (if any) or the current line (if there is no selection)
ar: يشغل التحديد الحالي (إذا وُجِدَ) أو السطر الحالي (إذا لم يكن هناك تحديد)
ru: Выполняет текущий выделенный фрагмент (если имеется) или текущую строку (если ничего не выделено)
tr: Geçerli seçimi (varsa) veya geçerli satırı (seçim yoksa) çalıştırır

source: Run selection
ar: شغِّل التحديد
ru: Выполнить выделенный фрагмент
tr: Seçimi Çalıştır

source: Run all
ar: شغّل الكلّ
ru: Выполнить всё
tr: Tümünü Çalıştır

source: &Function reference
ar: مرجع الوظيفة
ru: &Документация по функции
tr: &İşlev Başvurusu

source: [No keyword detected]
ar: [ما من كلمة مفتاحية كُشِفَت]
ru: [Не обнаружено ключевых слов]
tr: [Algılanan anahtar sözcük yok]

source: Search online
ar: ابحث على الإنترنت
ru: Поиск в Интернете
tr: Çevrimiçi Ara

# very short: Preview is updating
source: updating
ar: يحدّث
ru: обновление
tr: güncelleniyor

# very short: Error while generating preview
source: error
ar: خطأ
ru: ошибка
tr: hata

# very short: Preview is up to date
source: ready
ar: جاهز
ru: готово
tr: hazır

# very short: Preview is not(yet) possible
source: n/a
ar: غ/م
ru: н/д
tr: yok

# very short: Preview is turned off
source: off
ar: متوقف
ru: откл.
tr: kapalı

source: The preview is current unavailable (you will need to make further selections).
ar: المعاينة غير متاحة حاليًا (سـ تحتاج إلى إجراء المزيد من التحديدات).
ru: Предварительный просмотр сейчас недоступен (необходимо выбрать что-то ещё).
tr: Önizleme şu anda kullanılamıyor (biraz daha seçim yapmanız gerekiyor).

source: Preview is turned off.
ar: المعاينة مُوقَفَة.
ru: Предварительный просмотр отключён.
tr: Önizleme kapatıldı.

source: Preview is currently being updated.
ar: يجري تحديث المعاينة حاليًا.
ru: Предварительный просмотр сейчас обновляется.
tr: Önizleme şu anda güncelleniyor.

source: The command to generate the preview has failed.
ar: فشل الأمر لتوليد المعاينة.
ru: Не удалось выполнить команду для создания данных предварительного просмотра.
tr: Önizleme üretme komutu başarısız oldu.

source: Preview is up to date.
ar: المعاينة مُحدَّثة.
ru: Предварительный просмотр отражает актуальное состояние.
tr: Önizleme güncel.

source: Warnings or Errors:
ar: تحذيرات أو أخطاء:
ru: Предупреждения или ошибки:
tr: Uyarılar veya hatalar:

source: Could not open file %1 for reading
ar: تعذّر فتح الملف %1 للقراءة.
ru: Не удалось открыть файл %1 для чтения
tr: %1 dosyası okumak için açılamadı

source: Error parsing XML-file. Error-message was: '%1' in line '%2', column '%3'. Expect further errors to be reported below
ar: خطأ في تحليل ملف XML. كانت رسالة الخطأ: '%1' في السطر '%2'، العمود '%3'. توقَّع أن تُرصَد أخطاء أخرى أدناه
ru: Ошибка обработки файла XML. Получено следующее сообщение об ошибке: «%1» в строке «%2», позиция «%3». Ниже могут появиться сообщения о последующих ошибках.
tr: XML dosyası ayrıştırılırken hata oluştu. Hata iletisi şuydu: “%2”. satırda, “%3”. sütunda “%1”. Aşağıda daha fazla hatanın bildirilmesini bekleyin

source: Trying to retrieve children of invalid element
ar: محاولة استرجاع أبناء عنصر غير صالح
ru: Попытка получить дочерние элементы некорректного элемента
tr: Geçersiz ögenin alt ögeleri alınmaya çalışılıyor

source: Expected exactly one element '%1' but found %2
ar: تُوقِّع عنصر واحد بالضبط '%1' ولكن عُثِر على %2
ru: Ожидался только один элемент «%1», но найдено %2
tr: Tam olarak bir “%1” ögesi bekleniyordu; ancak %2 bulundu

source: '%1'-attribute not given. Assuming '%2'
ar: السمة '%1' غير مُعطاة. افتراض '%2'
ru: «%1»-атрибут не указан. Будет использоваться «%2»
tr: “%1” özniteliği verilmedi; “%2” varsayılıyor

source: Illegal attribute value. Allowed values are one of '%1', only.
ar: قيمة سمة غير قانونية. القيم المسموح بها هي واحدة من '%1'، فقط.
ru: Недопустимое значение атрибута. Допускается только какое-либо из следующих значений: «%1».
tr: Geçersiz öznitelik değeri. İzin verilen değerler yalnızca “%1” değerlerinden biridir.

source: Illegal attribute value. Only integer numbers are allowed.
ar: قيمة سمة غير قانونية. الأعداد الصحيحة فقط هي المسموح بها.
ru: Недопустимое значение атрибута. Допускаются только целые числа.
tr: Geçersiz öznitelik değeri. Yalnızca tamsayılara izin verilir.

source: Illegal attribute value. Only real numbers are allowed.
ar: قيمة سمة غير قانونية. الأعداد الحقيقية فقط هي المسموح بها.
ru: Недопустимое значение атрибута. Допускаются только вещественные числа.
tr: Geçersiz öznitelik değeri. Yalnızca gerçek sayılara izin verilir.

source: Illegal attribute value. Allowed values are '%1' or '%2', only.
ar: قيمة سمة غير قانونية. القيم المسموح بها هي '%1' أو '%2' فقط.
ru: Недопустимое значение атрибута. Допускается только значение «%1» или «%2»,
tr: Geçersiz öznitelik değeri. İzin verilen değerler yalnızca “%1” veya “%2” değerlerinden biridir.

source: Trying to retrieve contents of invalid element
ar: محاولة استرجاع محتويات عنصر غير صالح
ru: Попытка получить содержимое некорректного элемента
tr: Geçersiz ögenin içeriği alınmaya çalışılıyor

source: XML-parsing '%1'
ar: تحليل XML لـ '%1'
ru: XML-обработка «%1»
tr: “%1” dosyasındaki XML ayrıştırılıyor

source: yes
ar: نعم
ru: да
tr: evet

source: no
ar: لا
ru: нет
tr: hayır

source: (no label)
ar: (بِلا لصيقة)
ru: (нет подписи)
tr: (etiket yok)

source: You tried to invoke a plugin called '%1', but that plugin is currently unknown. Probably you need to load the corresponding PluginMap (Settings->Configure RKWard->Plugins), or perhaps the plugin was renamed.
ar: حاولت استدعاء إضافة تُدعَى '%1'، ولكن تلك الإضافة غير معروفة حاليًا. يُحتمَل أنك تحتاج إلى تحميل خريطة الإضافة المقابلة (إعدادات->اضبط أر كي وارد->إضافات)، أو ربما أُعيد تسمية الإضافة.
ru: Выполнена попытка вызова модуля «%1», но он неизвестен программе. Вероятно, следует загрузить соответствующий файл карты модулей («Настройка -> Настроить RKWard -> Модули»). Также возможно, что модуль был переименован.
tr: “%1” adındaki bir eklentiyi çağırmayı denediniz; ancak bu eklenti şu anda bilinmiyor. Büyük olasılıkla ilgili PluginMap’i yüklemeniz gerekiyor (Ayarlar → RKWard Uygulamasını Yapılandır → Eklentiler) veya eklenti yeniden adlandırılmış olabilir.

source: No such plugin
ar: ما من إضافة كهذه
ru: Модуль не найден
tr: Böyle bir eklenti yok

source: Bad serialization format while trying to invoke plugin '%1'. In general, this should not happen, unless you modified the parameters by hand. Please consider reporting this issue.
ar: صيغة تسلسل رديئة أثناء محاولة استدعاء الإضافة '%1'. بشكل عام، يجب ألا يحدث هذا، ما لم تعدّل المعاملات يدويًا. رجاءً فكِّر في الإبلاغ عن هذه المشكلة.
ru: Некорректный формат сериализации при попытке вызвать модуль «%1». Обычно такое не должно происходить, если параметры не были изменены вручную. Рекомендуется сообщить разработчикам об ошибке.
tr: “%1” eklentisini çağırmaya çalışırken hatalı serileştirme biçimi. Genel olarak, parametreleri elle değiştirmediğiniz sürece bu gerçekleşmemelidir. Lütfen bu sorunu bildirmeyi düşünün.

source: Bad serialization format
ar: صيغة تسلسل رديئة
ru: Некорректный формат сериализации
tr: Hatalı serileştirme biçimi

source: The plugin has crashed.
ar: تعطَّلَت الإضافة.
ru: Произошёл сбой модуля.
tr: Eklenti çöktü.

source: Not all specified settings could be applied. Most likely this is because some R objects are no longer present in your current workspace.
ar: لا يُمكِن تطبيق جميع الإعدادات المحددة. غالبًا ما يكون هذا بسبب أن بعض كائنات R لم تعد موجودة في مساحة عملك الحالية.
ru: Не все указанные параметры можно применить. Наиболее вероятная причина заключается в том, что некоторые объекты R больше не присутствуют в текущей рабочей области.
tr: Belirtilen ayarların tümü uygulanamadı. Bunun nedeni büyük olasılıkla bazı R nesnelerinin artık geçerli çalışma alanınızda bulunmamasıdır.

source: Not all settings applied
ar: لم يُطبَّق كل الإعدادات
ru: Применены не все параметры
tr: Ayarların tümü uygulanmadı

source: The plugin could not be auto-submitted with these settings.
ar: لا يُمكِن إرسال الإضافة بـ آلي بهذه الإعدادات.
ru: С этими параметрами настройки модуль нельзя отправить автоматически.
tr: Bu ayarlarla eklenti kendiliğinden gönderilemedi.

source: Could not submit
ar: لا يُمكِن الإرسال
ru: Не удалось отправить
tr: Gönderilemedi

source: Could not open plugin map file %1. (Is not readable, or failed to parse)
ar: لا يُمكِن فتح ملف خريطة الإضافة %1. (إما أنه غير قابل للقراءة، أو فشل تحليله)
ru: Не удалось открыть файл карты модулей %1. (Он недоступен для чтения или непригоден для обработки)
tr: %1 eklenti eşlem dosyası açılamadı. (Okunamıyor veya ayrıştırılamadı)

source: Skipping plugin map file '%1': Not compatible with this version of RKWard
ar: تخطي ملف خريطة الإضافة '%1': غير متوافق مع هذا الإصدار من أر كي وارد
ru: Пропуск файла карты модулей «%1»: отсутствует совместимость с этой версией RKWard
tr: “%1” eklenti eşlem dosyası atlanıyor: RKWard’ın bu sürümüyle uyumlu değil

source: Specified required file '%1' does not exist or is not readable. Ignoring.
ar: الملف المطلوب المحدد '%1' غير موجود أو غير قابل للقراءة. تجاهَلْه.
ru: Указанный необходимый файл «%1» не существует или недоступен для чтения. Игнорируется.
tr: Belirtilen gerekli dosya “%1” yok veya okunamıyor. Yok sayılıyor.

source: Could not resolve specified required pluginmap '%1'. You may have to install additional packages.
ar: لا يُمكِن حل خريطة الإضافة المطلوبة المحددة '%1'. قد تضطر إلى تثبيت حِزَم إضافية.
ru: Не удалось обнаружить все компоненты, описанные в карте модулей «%1». Вероятно, потребуется установить дополнительные пакеты.
tr: Belirtilen gerekli eklenti haritası “%1” çözülemedi. Ek paketler kurmanız gerekebilir.

source: Duplicate declaration of component id "%1" within pluginmap file "%2".
ar: إعلان مُكرَّر عن معرِّف المكون "%1" ضمن ملف خريطة الإضافة "%2".
ru: В файле карты модулей «%2» дублируется объявление идентификатора компонента «%1».
tr: “%2” eklenti eşlem dosyasındaki “%1” bileşen kimliğinin yinelenen beyanı.

source: Specified file '%1' for component id "%2" does not exist or is not readable. Ignoring.
ar: الملف المحدد '%1' لمعرِّف المكون "%2" غير موجود أو غير قابل للقراءة. تجاهَلْه.
ru: Указанного файла «%1» для компонента с идентификатором «%2» либо не существует, либо этот файл недоступен для чтения. Игнорируется.
tr: “%2” bileşen kimliği için belirtilen “%1” dosyası yok veya okunamıyor. Yok sayılıyor.

source: Component '%1' is not available in a version compatible with this version of RKWard
ar: المكون '%1' غير متوفر في إصدار متوافق مع هذا الإصدار من أر كي وارد
ru: Версия компонента «%1» несовместима с этой версией RKWard
tr: “%1” bileşeni, RKWard’ın bu sürümüyle uyumlu bir sürümde kullanılabilir değil

source: Unspecified
ar: غير محدد
ru: Не указано
tr: Belirtilmemiş

source: Copyright (c): %1
ar: حقوق النشر (c): %1
ru: Авторские права ©: %1
tr: Telif hakkı (c): %1

source: License: %1
ar: الترخيص: %1
ru: Лицензия: %1
tr: Lisans: %1

source: Authors:
ar: المؤلفون:
ru: Авторы:
tr: Yazarlar:

# Author roles (contributor, etc.)
source: Roles
ar: الأدوار
ru: Роли
tr: Görevler

source: Translators:
ar: المترجمون:
ru: Переводчики:
tr: Çevirmenler:

source: RKWard plugin map
ar: خريطة إضافة أر كي وارد
ru: Карта модулей RKWard
tr: RKWard eklenti eşlemi

source: R package
ar: حزمة R
ru: Пакет R
tr: R paketi
