Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: Ignore (and keep) the file. You can import it manually, at any time, using rk.import.legacy.output()
ar: تجاهَل (واحتفِظ) بالملف. يُمكِنك استيراده يدويًا، في أي وقت، باستعمال rk.import.legacy.output()
ru: Проигнорировать (и оставить) файл. Его всегда можно импортировать вручную с помощью rk.import.legacy.output()
tr: Dosyayı yok sayın (ve tutun). İstediğiniz zaman rk.import.legacy.output() ögesini kullanarak elle içe aktarabilirsiniz.

source: R Backend
ar: نهاية R الخلفية
ru: Серверное приложение R
tr: R Arka Ucu

source: R Packages
ar: حِزَم R
ru: Пакеты R
tr: R Paketleri

source: The R2HTML package is used by nearly all RKWard output functions, and thus required.
ar: تُستخدَم حزمة R2HTML بواسطة جميع وظائف إخراج أر كي وارد تقريبًا، وهي بالتالي مطلوبة.
ru: Так как пакет R2HTML используется почти всеми функциями вывода данных RKWard, он является необходимым.
tr: R2HTML paketi neredeyse tüm RKWard çıktı işlevleri tarafından kullanılır ve bu nedenle gereklidir.

source: The rmarkdown package is required for rendering .Rmd files (including preview rendering), which is an optional but recommended feature.
ar: حزمة rmarkdown مطلوبة لعرض ملفات Rmd. (يشمل ذلك العرض المسبَق)، وهي ميزة اختيارية لكنها مُوصى بها.
ru: Для обработки файлов .Rmd (включая обработку предварительного просмотра) требуется пакет rmarkdown. Эта возможность не является обязательной для работы программы, но рекомендуется.
tr: İsteğe bağlı; ancak önerilen bir özellik olan .Rmd dosyalarının (önizleme oluşturma dahil) sunulabilmesi için rmarkdown paketi gereklidir.

source: External software
ar: برمجيات خارجية
ru: Внешнее программное обеспечение
tr: Dış yazılımlar

source: The pandoc software is needed for rendering (or previewing) R markdown (.Rmd) files. This is optional but recommended.
ar: برنامج pandoc مطلوب لعرض (أو العرض المسبَق لـ) ملفات R markdown (Rmd.). هذا اختياري لكنه مُوصى به.
ru: Для обработки (или предварительного просмотра) файлов разметки (.Rmd) требуется программное обеспечение pandoc. Эта возможность не является обязательной для работы программы, но рекомендуется.
tr: R markdown (.Rmd) dosyalarını oluşturmak (veya önizlemek) için pandoc yazılımı gereklidir. Bu isteğe bağlıdır; ancak önerilir.

source: The kbibtex software is useful for managing citations while writing articles. It integrates into RKWard via the Document Preview kate plugin.
ar: برنامج kbibtex مفيد لإدارة الاستشهادات أثناء كتابة المقالات. ادمجْه في أر كي وارد عن طريق إضافة Document Preview لـ kate.
ru: Программа kbibtex помогает работать с библиографической информацией при написании статей. Она интегрируется в RKWard с помощью модуля предварительного просмотра Kate.
tr: kbibtex yazılımı, makale yazarken atıfları yönetmek için kullanışlıdır. Kate Belge Önizleme eklentisi aracılığıyla RKWard ile tümleşir

source: Summary of the next steps
ar: ملخص الخطوات التالية
ru: Сводка следующих шагов
tr: Sonraki adımların özeti

source: <h1>Reinstallation required</h1><p>Your installation of RKWard is broken, and cannot be fixed, automatically. You will have to reinstall RKWard!</p>
ar: <h1>إعادة التثبيت مطلوبة</h1><p>تثبيت أر كي وارد الخاص بك معطوب، ولا يُمكِن إصلاحه، بـ آلي. يجب عليك إعادة تثبيت أر كي وارد!</p>
ru: <h1>Требуется переустановка</h1><p>Установленный дистрибутив RKWard повреждён, автоматическое исправление ошибок невозможно. Необходимо переустановить RKWard!</p>
tr: <h1>Yeniden kurulum gerekiyor</h1><p>RKWard kurulumunuz bozuk ve kendiliğinden düzeltilemiyor. RKWard’ı yeniden kurmanız gerekecek!</p>

source: <h2>Software to install</h2>
ar: <h2>برنامج للتثبيت</h2>
ru: <h2>Программное обеспечение для установки</h2>
tr: <h2>Kurulacak yazılımlar</h2>

source: <p>The following software is recommended for installation, but automatic installation is not (yet) supported. Click on the links, below, for download information:</p><li>%1</li>
ar: <p>البرنامج التالي مُوصى به للتثبيت، ولكن التثبيت الـ آلي غير مدعوم (بعد). انقر على الروابط، بالأسفل، لمعلومات التنزيل:</p><li>%1</li>
ru: <p>Рекомендуется установить следующее программное обеспечение, но автоматическая установка (ещё) не поддерживается. Переходите по расположенным ниже ссылкам для получения сведений о загрузке:</p><li>%1</li>
tr: <p>Kurulum için aşağıdaki yazılımlar önerilir; ancak kendiliğinden kurulum (henüz) desteklenmemektedir. İndirme bilgisi için aşağıdaki bağlantılara tıklayın:</p><li>%1</li>

source: No software to install
ar: ما من برنامج للتثبيت
ru: Нет программного обеспечения для установки
tr: Kurulacak yazılım yok

source: <h2>R packages to install</h2>
ar: <h2>حِزَم R للتثبيت</h2>
ru: <h2>Пакеты R для установки</h2>
tr: <h2>Kurulacak R paketleri</h2>

source: <p>%1 R packages are marked for installation. The R package installation dialog will be started when you press finish. You may be prompted to select a download mirror.</p>
ar: <p>عُلِّمَت %1 من حِزَم R للتثبيت. عند الضغط على إنهاء، سـ تبدأ نافذة تثبيت حزمة R. قد يـ طُلَب منك اختيار خادم تنزيل موازٍ.</p>
ru: <p>Пакеты R (%1) отмечены для установки. Нажмите «Завершить» для запуска диалога установки пакетов R. Может быть предложено выбрать зеркало для загрузки.</p>
tr: <p>%1 R paketi kurulum için imlendi. Bitir düğmesine bastığınızda R paketi kurulum iletişim kutusu başlatılacaktır. Bir indirme yansısı seçmeniz istenebilir.</p>

source: No R packages to install
ar: ما من حِزَم R للتثبيت
ru: Нет пакетов R для установки
tr: Kurulacak R paketi yok

source: RKWard
ar: أر كي وارد

source: Frontend to the R statistics language
ar: واجهة أمامية للغة R للإحصاء
ru: Интерфейс к R, языку программирования для статистической обработки данных
tr: R istatistik dili için ön uç

source: Thomas Friedrichsmeier
ar: توماس فريدريكسماير

source: Project leader / main developer
ar: قائد المشروع / المطور الرئيسي
ru: Лидер проекта / главный разработчик
tr: Proje lideri, ana geliştirici

source: Pierre Ecochard
ar: بيير إيكوشار

source: C++ developer between 2004 and 2007
ar: مطور C++ بين عامي 2004 و 2007
ru: Разработчик на C++ с 2004 по 2007 годы
tr: 2004 ve 2007 yılları arası C++ geliştiricisi

source: Prasenjit Kapat
ar: بْرازِنجيت كابَت

source: Many plugins, suggestions, plot history feature
ar: العديد من الإضافات، الاقتراحات، ميزة سجل الرسم
ru: Много модулей, предложения, функция журнала графиков
tr: Birçok eklenti, öneriler, grafik geçmişi özelliği

source: Meik Michalke
ar: مايك ميشالك

source: Many plugins, suggestions, rkwarddev package
ar: العديد من الإضافات، الاقتراحات، حزمة rkwarddev
ru: Много модулей, предложения, пакет rkwarddev
tr: Birçok eklenti, öneriler, rkwarddev paketi

source: Stefan Roediger
ar: ستيفان روديجر
tr: Stefan Rödiger

source: Many plugins, suggestions, marketing, translations
ar: العديد من الإضافات، الاقتراحات، التسويق، الترجمات
ru: Много модулей, предложения, маркетинг, переводы
tr: Çeşitli eklentiler, öneriler ve tanıtım, yerelleştirme

source: Contributors in alphabetical order
ar: المساهمون حسب الترتيب الأبجدي
ru: Участники в алфавитном порядке
tr: Katkıda bulunanların abecesel sıralı listesi

source: Björn Balazs
ar: بيورن بالاز

source: Extensive usability feedback
ar: ملاحظات شاملة حول قابلية الاستخدام
ru: Развёрнутая обратная связь по вопросам удобства использования
tr: Kapsamlı kullanılabilirlik geri bildirimi

source: Aaron Batty
ar: آرون باتي

source: Wealth of feedback, hardware donations
ar: ثروة من الملاحظات، تبرعات بالأجهزة
ru: Подробная обратная связь, безвозмездная помощь оборудованием
tr: Birçok geri bildirim, donanım bağışları

source: Jan Dittrich
ar: يان ديتريتش

source: Philippe Grosjean
ar: فيليب جروسجين

source: Several helpful comments and discussions
ar: العديد من التعليقات والمناقشات المفيدة
ru: Полезные комментарии и обсуждения
tr: Çeşitli yardımcı yorumlar ve tartışmalar

source: Adrien d'Hardemare
ar: أدريان د'هارديمار

source: Plugins and patches
ar: الإضافات والتصحيحات
ru: Модули и исправления
tr: Eklentiler ve yamalar

source: Yves Jacolin
ar: إيف جاكولين

source: New website
ar: موقع ويب جديد
ru: Новый веб-сайт
tr: Yeni web sayfası

source: Germán Márquez Mejía
ar: جيرمان ماركيز ميخيا

source: HP filter plugin, spanish translation
ar: إضافة مُرشِّح HP، ترجمة إسبانية
ru: Модуль фильтра Ходрика — Прескотта , перевод на испанский язык
tr: HP süzgeci eklentisi, İspanyolca çeviri

source: Marco Martin
ar: ماركو مارتن

source: A cool icon
ar: أيقونة رائعة
ru: Классный значок
tr: Havalı bir simge

source: Daniele Medri
ar: دانييلي ميدري

source: RKWard logo, many suggestions, help on wording
ar: شعار أر كي وارد، العديد من الاقتراحات، المساعدة في الصياغة
ru: Логотип RKWard, много предложений, помощь с формулировками
tr: RKward logosu, birçok öneri, üslup üzerine yardım

source: David Sibai
ar: ديفيد صيباعي

source: Several valuable comments, hints and patches
ar: العديد من التعليقات القيمة، التلميحات والتصحيحات
ru: Ценные комментарии, подсказки и исправления
tr: Çeşitli değerli yorumlar, ipuçları ve yamalar

source: Ilias Soumpasis
ar: إلياس سومباسيس

source: Translation, Suggestions, plugins
ar: الترجمة، الاقتراحات، الإضافات
ru: Перевод, предложения, модули
tr: Çeviri, öneriler, eklentiler

source: Ralf Tautenhahn
ar: رالف تاوتنهاهن

source: Many comments, useful suggestions, and bug reports
ar: الكثير من التعليقات، الاقتراحات المفيدة، وتقارير الأخطاء
ru: Много комментариев, полезные предложения и отчёты об ошибках
tr: Birçok yorum, yararlı öneriler ve hata bildirimleri

source: Jannis Vajen
ar: يانيس فاجين

source: German Translation, bug reports
ar: ترجمة ألمانية، تقارير أخطاء
ru: Перевод на немецкий язык, отчёты об ошибках
tr: Almanca çeviri, hata raporları

source: Roland Vollgraf
ar: رولاند فولجراف

source: Some patches
ar: بعض التصحيحات
ru: Некоторые исправления
tr: Birkaç yama

source: Roy Qu
ar: روي كو

source: patches and helpful comments
ar: تصحيحات وتعليقات مفيدة
ru: Исправления и полезные комментарии
tr: Yamalar ve yararlı yorumlar

source: Many more people on rkward@kde.org
ar: الكثير من الأشخاص الإضافيين على rkward@kde.org

source: Sorry, if we forgot to list you. Please contact us to get added
ar: نعتذر، إذا نسينا إدراجك. رجاءً اتصل بنا لتُضَف
ru: Если вашего имени не оказалось в списке, примите наши извинения. Пожалуйста, сообщите нам об этом, чтобы мы могли добавить его.
tr: Sizi listelemeyi unuttuysak özür dileriz. Eklenmek için lütfen bizimle iletişime geçin

source: How to cite:
ar: كيف تستشهد:
ru: Как цитировать:
tr: Nasıl atıf yapılır:

source: Peer-reviewed article in the Journal of Statistical Software
ar: مقال مُراجَع من النظراء في مجلة البرمجيات الإحصائية
ru: Отрецензированная статья в Journal of Statistical Software (журнал статистического программного обеспечения)
tr: Journal of Statistical Software’de hakemli makale

source: [Omitted %1 more factor levels]
ar: [أُغفِلَت %1 مستوى عامل إضافي]
ru: [Пропущено уровней факторов: ещё %1]
tr: [%1 etken düzeyi daha atlandı]

source: Alignment
ar: محاذاة
ru: Выравнивание
tr: Hizalama

source: Default
ar: المبدئيّ
ru: По умолчанию
tr: Öntanımlı

source: Left
ar: يسار
ru: Слева
tr: Sol

source: Right
ar: يمين
ru: Справа
tr: Sağ

source: Decimal Places
ar: المنازل العشرية
ru: Десятичные знаки
tr: Ondalık Basamaklar

source: Default setting
ar: إعداد مبدئي
ru: Значение по умолчанию
tr: Öntanımlı ayar

source: As required
ar: حسب المطلوب
ru: По необходимости
tr: Gerektiği üzere

source: Fixed precision:
ar: دقة ثابتة:
ru: Фиксированная точность:
tr: Sabit kesinlik:

source: Formatting options for '%1'
ar: خيارات التنسيق لـ '%1'
ru: Параметры форматирования для «%1»
tr: “%1” Biçimlendirme Seçenekleri

source: Levels / Value labels for '%1'
ar: مستويات / لصائق قيمة لـ '%1'
ru: Уровни / подписи значений для «%1»
tr: “%1” Düzeyleri/Değer Etiketleri

source: Levels can be assigned only to consecutive integers starting with 1 (the index column is read only). To remove levels at the end of the list, just set them to empty.
ar: يُمكِن تعيين المستويات فقط للأعداد الصحيحة المتتالية التي تبدأ بـ 1 (عمود الفهرس للقراءة فقط). لإزالة مستويات في نهاية القائمة، فقط اضبطْها إلى فارغ.
ru: Уровни можно назначать только последовательным целым числам, начиная с 1 (столбец индекса доступен только для чтения). Чтобы убрать уровни в конце списка, просто задайте для них пустые значения.
tr: Düzeyler, yalnızca 1 ile başlayan ardışık tam sayılara atanabilir (dizin sütunu saltokunurdur). Listenin sonundaki düzeyleri kaldırmak için bunları boş olarak ayarlamanız yeterlidir.

source: Filename
ar: اسم الملفّ
ru: Имя файла
tr: Dosya Adı

source: Add
ar: أضف
ru: Добавить
tr: Ekle

source: Up
ar: أعلى
ru: Выше
tr: Yukarı

source: Down
ar: أسفل
ru: Ниже
tr: Aşağı

source: Click to add new row
ar: انقر لإضافة صف جديد
ru: Нажмите для добавления новой строки
tr: Yeni satır eklemek için tıklayın

source: Remove this row / element
ar: أزِل هذا الصف / العنصر
ru: Удалить эту строку / элемент
tr: Bu satırı/ögeyi kaldır

source: After starting (and after loading the specified workspace, if applicable), evaluate the given R code.
ar: بعد البدء (وبعد تحميل مساحة العمل المحددة، إذا كان ذلك قابلاً للتطبيق)، قيِّم كود R المُعطَى.
ru: Выполнить данный код R после запуска (и загрузки указанной рабочей области, если применимо).
tr: Başladıktan sonra (ve varsa belirtilen çalışma alanını yükledikten sonra), verilen R kodunu değerlendirin.

source: Verbosity of debug messages (0-5)
ar: إسهاب رسائل التنقيح (0-5)
ru: Уровень подробности сообщений отладки (0-5)
tr: Hata ayıklama iletilerinin ayrıntı düzeyi (0–5)

source: Mask for components to debug (see debug.h)
ar: قناع للمكونات للتنقيح (انظر debug.h)
ru: Маска компонентов, отладку которых следует выполнить (см. debug.h)
tr: Hatası ayıklanacak bileşenler için maske (bkz. debug.h)

source: Where to send debug message (file|terminal)
ar: أين ترسل رسالة التنقيح (ملف|طرفية)
ru: Куда следует отправить сообщение отладки (file|terminal)
tr: Hata ayıklama iletisinin nereye gönderileceği (dosya|uçbirim)

source: Debugger for the backend. (Enclose any debugger arguments in single quotes ('') together with the command. Make sure to re-direct stdout!)
ar: مُنقِّح للنهاية الخلفية. (ضَع أي وسائط للمُنقِّح بين علامات اقتباس مفردة ('') مع الأمر. تأكد من إعادة توجيه stdout!)
ru: Отладчик для серверного приложения. (Заключайте аргументы отладчика в одинарные кавычки ('') вместе с командой. Обязательно перенаправьте стандартный вывод!)
tr: Arka uç için hata ayıklayıcısı. (Hata ayıklayıcısı argümanlarını komutla birlikte tek tırnak ('') içine alın. stdout’u yeniden yönlendirdiğinizden emin olun!)

source: Use specified R installation, instead of the one configured at compile time (note: rkward R library must be installed to that installation of R)
ar: استخدِم تثبيت R المُحدَّد، بدلًا من ذلك الذي ضُبِطَ عند وقت التجميع (ملاحظة: يجب تثبيت مكتبة rkward R لذلك التثبيت من R)
ru: Использовать указанный вариант R вместо настроенного во время сборки (примечание: для этой версии R необходимо установить библиотеку R rkward).
tr: Derleme zamanında yapılandırılan R kurulumu yerine belirtilen R kurulumunu kullanın (not: R kitaplığı, bu belirtilen R kurulumuna kurulmuş olmalıdır)

source: Reuse a running RKWard instance (if available). If a running instance is reused, only the file arguments will be interpreted, all other options will be ignored.
ar: أعِد استخدام مثيل أر كي وارد قيد التشغيل (إذا كان متاحًا). إذا أُعيد استخدام مثيل قيد التشغيل، فـ تفسَّر وسائط الملف فقط، وتُتجاهَل جميع الخيارات الأخرى.
ru: Воспользоваться уже запущенным экземпляром RKWard (если он имеется). В этом случае будут обработаны только аргументы файлов, а все остальные параметры будут проигнорированы.
tr: Çalışan bir RKWard örneğini (varsa) yeniden kullanın. Çalışan bir örnek yeniden kullanılırsa yalnızca dosya argümanları yorumlanır, diğer tüm seçenekler yok sayılır.

source: Behaves like --reuse, if any file arguments are also given, starts a new instance, otherwise. Intended for use in the .desktop file.
ar: تصرَّف مثل --reuse، إذا أُعطِيَت أي وسائط ملف أيضًا، فـ ابدأ مثيلًا جديدًا، وإلا فـ لا تفعل. قُصِدَ استخدامها في ملف .desktop.
ru: Работает аналогично --reuse, если также указаны какие-либо аргументы файлов. В ином случае — запускает новый экземпляр. Предназначается для использования в файле .desktop.
tr: Herhangi bir dosya argümanı da verilmişse --reuse gibi davranır, aksi halde yeni bir örnek başlatır. .desktop dosyasında kullanılmak üzere tasarlanmıştır.

source: When used in conjunction with rkward://runplugin/-URLs specified on the command line, suppresses the warning about application-external (untrusted) links.
ar: عند الاستخدام بالاقتران مع عناوين URL لـ rkward://runplugin/-المحددة في سطر الأوامر، كبَت تحذير الروابط الخارجية عن التطبيق (غير الموثوقة).
ru: При использовании совместно с указанными в командной строке URL-адресами, начинающимися с «rkward://runplugin/», подавляет предупреждение о внешних (недоверенных) ссылках.
tr: Komut satırında belirtilen rkward://runplugin/-URLs ile birlikte kullanıldığında, uygulama dışı (güvenilmeyen) bağlantılarla ilgili uyarıyı susturur.

source: Disable some startup validation code. Experimental option, not intended for regular use.
ar: عطِّل بعض أكواد التحقق عند البدء. خيار تجريبي، غير مقصود للاستخدام العادي.
ru: Отключить часть кода начальных проверок. Экспериментальный параметр, не предназначенный для использования на регулярной основе.
tr: Bazı başlangıç doğrulama kodlarını devre dışı bırakın. Deneysel bir seçenektir, düzenli kullanıma yönelik değildir.

source: Act as if the version of RKWard had changed (show setup wizard, and (re-)install rkward R package).
ar: تصرَّف كما لو أن إصدار أر كي وارد قد تغيَّر (أظهر معالج الإعداد، و (أعِد) تثبيت حزمة rkward R).
ru: Поведение как при смене версии RKWard (показать мастер настройки, (пере)установить пакет R rkward).
tr: RKWard sürümü değişmiş gibi davran (kurulum sihirbazını göster ve RKWard R paketini yeniden kur)

source: File or files to open, typically a workspace, or an R script file. When loading several things, you should specify the workspace, first.
ar: ملف أو ملفات لفتحها، عادةً مساحة عمل، أو ملف نصي لـ R. عند تحميل عدة أشياء، يجب عليك تحديد مساحة العمل، أولًا.
ru: Один или несколько файлов, которые следует открыть. Обычно это файлы рабочих областей или сценариев. Если загружается несколько файлов, необходимо сначала указать файл рабочей области.
tr: Açılacak dosya veya dosyalar (genellikle bir çalışma alanı veya bir R komut dosyası). Birkaç şey yüklerken öncelikle çalışma alanını belirtmelisiniz.

source: <p><em>Note:</em> This setting does not take effect until you restart RKWard.</p>
ar: <p><em>ملاحظة:</em> لن يسري هذا الإعداد حتى تُعيد تشغيل أر كي وارد.</p>
ru: <p><em>Примечание:</em> этот параметр вступит в силу только после перезапуска RKWard.</p>
tr: <p><em>Not:</em> Bu ayar, siz RKWard’ı yeniden başlatana kadar etkili olmaz.</p>

source: Search
ar: ابحث
ru: Поиск
tr: Ara

source: <p><b>Note:</b> This search line accepts so-called regular expressions. To limit the search to matches at the start of the string, start the filter with '^', e.g. ('^rk.'). To limit searches to the end of the string, append '$' at the end of the filter. To match arbitrary text in the middle of the search term, insert '.*'.</p>
ar: <p><b>ملاحظة:</b> يقبل سطر البحث هذا ما يُسمَّى بالتعبيرات النمطية. لتقييد البحث لـ مطابقات في بداية السلسلة، ابدأ المُرشِّح بـ '^'، على سبيل المثال ('^rk.'). لتقييد عمليات البحث لنهاية السلسلة، ألحِق '$' في نهاية المُرشِّح. لـ مطابقة نص عشوائي في منتصف مصطلح البحث، أدخِل '.*'.</p>
ru: <p><b>Примечание:</b> в этой строке поиска можно использовать так называемые регулярные выражения. Чтобы ограничить поиск совпадениями в начале строки, начните фильтр с «^», например: «^rk.». Чтобы ограничить поиск совпадениями в конце строки, добавьте «$» в конце фильтра. Чтобы указать, что в середине может быть произвольный текст, вставьте «.*».</p>
tr: <p><b>Not:</b>Bu arama satırı, düzenli ifadeler olarak adlandırılan ifadeleri kabul eder. Aramayı dizinin başındaki eşlemelerle sınırlandırmak için süzgeci “^” ile başlatın, örn. (“^rk.”). Aramaları dizinin sonuna kadar sınırlandırmak için süzgecin sonuna “$” ekleyin. Arama teriminin ortasındaki rastgele metni eşleştirmek için “.*.” kullanın.</p>

source: Search backwards (previous occurrence of search term)
ar: ابحث للخلف (التكرار السابق لمصطلح البحث)
ru: Поиск «назад» (предыдущее соответствие поисковому запросу)
tr: Geriye doğru ara (önceki arama terimi)

source: Search forward (next occurrence of search term)
ar: ابحث للأمام (التكرار التالي لمصطلح البحث)
ru: Поиск «вперёд» (следующее соответствие поисковому запросу)
tr: İleri doğru ara (sonraki arama terimi)

source: Match case
ar: طابق الحالة
ru: С учётом регистра
tr: BÜYÜK/küçük harf duyarlı

source: Find as you type
ar: اعثر وأنت تكتب
ru: Поиск по мере набора
tr: Yazarken bul

source: Highlight all matches
ar: أبرز كل المتطابقات
ru: Выделить все совпадения
tr: Tüm eşleşmeleri vurgula

source: Other Environments
ar: بيئات أخرى
ru: Другие окружения
tr: Diğer Ortamlar

source: My Workspace
ar: مساحة عملي
ru: Моя рабочая область
tr: Çalışma Alanım

source: My Workspace (no objects matching filter)
ar: مساحة عملي (لا توجد كائنات مطابقة للمُرشِّح)
ru: Моя рабочая область (нет объектов, соответствующих фильтру)
tr: Çalışma Alanım (Süzgeçle eşleşen nesne yok)

source: Show Hidden Objects
ar: أظهِر الكائنات المخفية
ru: Показать скрытые объекты
tr: Gizli Nesneleri Göster

# Fields==columns in tree view
source: Fields to search in
ar: حقول للبحث فيها
ru: Поля поиска
tr: İçinde aranacak alanlar

source: Top level objects, only
ar: كائنات المستوى الأعلى فقط
ru: Объекты только верхнего уровня
tr: Yalnızca üst düzey nesneler

source: Top level objects, and direct children
ar: كائنات المستوى الأعلى، والأبناء المباشرون
ru: Объекты верхнего уровня и прямые дочерние объекты
tr: Üst düzey nesneler ve doğrudan alt nesneleri

source: Depth of search in the object tree.<ul><li><i>%1</i> means looking for matches in objects that are on the search path, only (in <i>.GlobalEnv</i> or a loaded package)</li><li><i>%2</i> includes direct child objects. In this case, the list will show matching objects on the search path, <i>and</i> objects on the search path that hold matching child objects.</li>
ar: عمق البحث في شجرة الكائن.<ul><li><i>%1</i> يعني البحث عن مطابقات في الكائنات الموجودة في مسار البحث فقط (في <i>.GlobalEnv</i> أو حزمة محملة)</li><li><i>%2</i> يشمل الأبناء المباشرين. في هذه الحالة، ستُظهر القائمة الكائنات المطابقة في مسار البحث، <i>و</i> الكائنات الموجودة في مسار البحث التي تحمل أبناء مطابقين.</li>
ru: Глубина поиска в иерархии объектов.<ul><li><i>%1</i> означает поиск совпадений только в объектах по пути поиска (в <i>.GlobalEnv</i> или загруженном пакете)</li><li><i>%2</i> включает в поиск прямые дочерние объекты. В этом случае в списке будут показаны объекты по пути поиска, соответствующие условиям поиска, <i>а также</i> объекты по пути поиска, содержащие соответствующие условиям поиска дочерние объекты.</li>
tr: Nesne ağacındaki arama derinliği.<ul><li><i>%1</i>, yalnızca arama yolundaki nesnelerde eşleşme aramak anlamına gelir (<i>.GlobalEnv</i> veya yüklü bir paket içinde)</li><li><i>%2</i>, doğrudan alt nesneleri de içerir. Bu durumda liste, arama yolunda eşleşen nesneleri, arama yolunda eşleşen alt nesneleri tutan <i>ve</i> nesneleri gösterecektir.</li>

source: Show all objects
ar: أظهِر جميع الكائنات
ru: Показать все объекты
tr: Tüm nesneleri göster

source: Show functions, only
ar: أظهِر الوظائف فقط
ru: Показать только функции
tr: Yalnızca işlevleri göster

source: Show objects excluding functions
ar: أظهِر الكائنات باستثناء الوظائف
ru: Показать объекты, за исключением функций
tr: İşlevler dışlayıp nesneleri göster
