Repository: KDE/rkward
Catalog: po/*/rkward__analysis.po
Languages: eo

source: Indicates which correlation coefficient (or covariance) is to be computed. One of "pearson", "kendall", or "spearman", can be used
eo: Indikas kiun korelacian koeficienton (aŭ kunvariancon) estas komputota. Unu el "pearson", "kendall", aŭ "lancisto", povas esti uzata

source: Select how to treat missing values. If use is "whole cases" then missing values are handled by casewise deletion. If use has the value "pairwise" then the correlation between each pair of variables is computed using all complete pairs of observations on those variables. This can result in covariance or correlation matrices which are not positive semidefinite. "pairwise" only works with the "pearson" method for cov and var.
eo: Elektu kiel trakti mankantajn valorojn. Se uzo estas "tutaj kazoj" tiam mankantaj valoroj estas pritraktataj per kazlauze forigo. Se uzo havas la valoron "parole" tiam la korelacio inter ĉiu paro de variabloj estas komputita uzante ĉiujn kompletajn parojn de observaĵoj sur tiuj variabloj. Tio povas rezultigi kunvariancon aŭ korelaciajn matricojn kiuj ne estas pozitivaj duondifinaj. "pairwise" funkcias nur kun la metodo "pearson" por cov kaj var.

source: Select how many digits after decimal point should be shown
eo: Elektu kiom da ciferoj post dekuma punkto estu montritaj

source: Select it if you want to scale text according to the (absolute) correlation value.
eo: Elektu ĝin se vi volas skali tekston laŭ la (absoluta) korelacia valoro.

source: <link href="http://addictedtor.free.fr/graphiques/RGraphGallery.php?graph=137">R Graph Gallery (137) Correlation Matrix</link>
eo: <link href="http://addictedtor.free.fr/graphiques/RGraphGallery.php?graph=137">R Graph Gallery (137) Korelacia Matrico</link>

source: Spearman
eo: Lancisto

source: Precision (digits)
eo: Precizeco (ciferoj)

source: Scale text
eo: Skala teksto

# Author name
source: RKWard Team
eo: RKWard Teamo

source: Number of cases
eo: Nombro da kazoj

source: Number of missing values
eo: Nombro de mankantaj valoroj

source: Minimum
eo: Minimumo

source: Maximum
eo: Maksimumo

source: Minimum values
eo: Minimumaj valoroj

source: Maximum values
eo: Maksimumaj valoroj

source: Inter Quartile Range
eo: Interkvartila Gamo

source: Quartiles
eo: Kvartiloj

source: Quantiles
eo: Kvantiloj

# R code comment
source: robust statistics
eo: fortika statistiko

source: Location Estimate
eo: Loka Takso

source: Mad scale estimate
eo: Freneza skalo takso

source: Huber M-Estimator
eo: Huber M-Taksilo

# R code comment
source: store results
eo: Konservi rezultojn

source: Univariate statistics
eo: Unuvaria statistiko

source: Proportion of trimmed values for trimmed mean
eo: Proporcio de eltonditaj valoroj por eltondita meznombro

source: Constant for the MAD estimation
eo: Konstanto por la MAD-takso

source: Winsorized values for Huber estimator
eo: Winsorigitaj valoroj por Huber-takso

source: Tolerance in Huber estimator
eo: Toleremo en Huber-takso

source: Mu for Huber estimator
eo: Mu por Huber-takso

source: S for Huber estimator
eo: S por Huber-takso

source: Initial value
eo: Komenca valoro

source: Basic statistics
eo: Baza statistiko

source: Select variables
eo: Elektu variablojn

source: Variable
eo: Variablo

source: Statistics
eo: Statistikoj

source: General
eo: Ĝenerala

source: Moments
eo: Momentoj

source: extrema
eo: ekstrema

source: Number of minimum values displayed
eo: Nombro de minimumaj valoroj montritaj

source: Number of maximum values displayed
eo: Nombro de maksimumaj valoroj montritaj

source: Interquartile Range
eo: Interkvartila Gamo

source: Quartile
eo: Kvartilo

source: Other (eg : for deciles, enter 10)
eo: Aliaj (ekz.: por deciloj, enigu 10)

source: Robust statistics
eo: Fortika statistiko

source: Dispersion
eo: Disperdo

source: Robust mean
eo: Fortika meznombro

source: Percentage of trimmed values
eo: Procento de eltonditaj valoroj

source: M-Estimator
eo: M-Taksilo

source: Huber -M estimator (Require MASS Library)
eo: Huber -M-taksilo (Postu MASS Library)

source: Winsorize at 'k' sd
eo: Winsorize ĉe 'k' sd

source: Custom Mu value
eo: Propra Mu valoro

source: Enter your value
eo: Enigu vian valoron

source: Custom s value
eo: Propra valoro

source: S value
eo: S-valoro

source: Tolerance
eo: Toleremo

source: Omit missing values
eo: Forlasu mankantajn valorojn

source: Store results
eo: Konservi rezultojn
