Repository: KDE/rkward
Catalog: po/*/rkward__analysis.po
Languages: eo

# NAME OF TRANSLATORS
source: Your names
eo: Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
eo: olivermkellogg@gmail.com

source: Analysis
eo: Analizo

source: Assorted plugins for univariate and multivariate data analysis. Part of the official RKWard distribution
eo: Variaj aldonaĵoj por unuvaria kaj plurvaria datuma analizo. Parto de la oficiala RKWard-distribuo

source: Basic Statistics
eo: Baza Statistiko

source: Correlation Matrix
eo: Korelacia Matrico

source: Correlation Matrix Plot
eo: Korelacia Matrico-Grafiko

source: Descriptive Statistics
eo: Priskriba Statistiko

source: t-Test
eo: t-Testo

source: Wilcoxon/Mann-Whitney Tests
eo: Wilcoxon/Mann-Whitney Testoj

# Statistics
source: Moment
eo: Momenton

source: Bonett-Seier Test of Geary's Kurtosis
eo: Bonett-Seier Testo de la Kurtozo de Geary

source: D'Agostino Test of Skewness
eo: D'Agostino Testo de Skewness

source: Anscombe-Glynn Test of Kurtosis
eo: Anscombe-Glynn Testo de Kurtozo

source: Skewness and Kurtosis
eo: Skewness kaj Kurtosis

source: F-Test
eo: F-Testo

source: Fligner-Killeen Test
eo: Fligner-Killeen Testo

source: Bartlett Test
eo: Testo de Bartlett

source: Levene's Test
eo: Testo de Levene

source: Mood Two-Sample Test
eo: Humoro-Du-Prova Testo

source: Chi-squared Test for Outlier
eo: Chi-kvadrata Testo por Outlier

source: Dixon Test
eo: Testo de Dixon

source: Find Outlier
eo: Trovu Outlier

source: Grubbs Test
eo: Grubbs Testo

source: N to 1 Crosstabulation
eo: N al 1 Kructabelo

source: N to N Crosstabulation
eo: N al N Kructabelo

source: Box-Pierce or Ljung-Box Tests
eo: Box-Pierce aŭ Ljung-Box Testoj

source: KPSS Test for Stationarity
eo: KPSS Testo por Senmoveco

source: Hodrick-Prescott Filter
eo: Hodrick-Prescott Filtrilo

source: Phillips-Perron Test
eo: Testo de Phillips-Perron

source: Linear Regression
eo: Lineara Regreso

# Power of tests
source: Power Analysis
eo: Potenca Analizo

source: Correlation
eo: Korelacio

source: Crosstabs
eo: Kructabuloj

source: Means
eo: Rimedoj

source: t-Tests
eo: t-testoj

# Statistics
source: Moments
eo: Momentoj

source: Outlier Tests
eo: Eksteraj Testoj

source: Regression
eo: Regreso

source: Variances / Scale
eo: Variancoj / Skalo

source: Parametric tests
eo: Parametrikaj provoj

source: Nonparametric tests
eo: Neparametraj provoj

source: Time Series
eo: Tempo-Serio

source: Wilcoxon Tests
eo: Wilcoxon-testoj

source: Variable Names
eo: Variaj Nomoj

source: statistic
eo: statistiko

source: null.value
eo: nula.valoro

source: confidence interval percent
eo: konfidenca intervalo procento

source: confidence interval of difference
eo: konfidenca intervalo de diferenco

source: estimate of the ratio of scales
eo: takso de la proporcio de skvamoj

source: This test performs the Ansari-Bradley two-sample exact test to test for a difference in scale parameters. This test differs from <link href="rkward://component/ansari_bradley_test"/> in that exact p-values can also be computed in the presence of ties.
eo: Ĉi tiu testo elfaras la Ansari-Bradley-du-provan precizan teston por testi por diferenco en skalparametroj. Ĉi tiu testo diferencas de <link href="rkward://component/ansari_bradley_test"/> en tio, ke precizaj p-valoroj ankaŭ povas esti komputitaj en ĉeesto de kravatoj.

source: Select two data sets for the Ansari-Bradley two-sample test. For this test the samples need to be numeric vectors (see below for details).
eo: Elektu du datumajn arojn por la du-specimena testo de Ansari-Bradley. Por ĉi tiu testo la provaĵoj devas esti nombraj vektoroj (vidu malsupre por detaloj).

source: Select the data to be computed. The vectors need to be numeric.
eo: Elektu la datumojn por esti komputitaj. La vektoroj devas esti nombraj.

source: Here you can specify the alternative hypothesis. It must be one of "two sided", "greater" or "less".
eo: Ĉi tie vi povas specifi la alternativan hipotezon. Ĝi devas esti unu el "two sided", "greater" aŭ "less".

source: Defines whether an exact p-value should be computed.
eo: Difinas ĉu preciza p-valoro devus esti komputita.

source: Check this if you want the confidence interval to be computed.
eo: Marku ĉi tion se vi volas, ke la konfida intervalo estu komputita.

source: Here you can define the confidence level of the interval (95% is typical).
eo: Ĉi tie vi povas difini la konfidan nivelon de la intervalo (95% estas tipa).

source: Ansari-Bradley two-sample exact test
eo: Ansari-Bradley du-prova ekzakta testo

source: Basic settings
eo: Bazaj agordoj

source: compare
eo: kompari

# compare against
source: against
eo: kontraux

source: using test hypothesis
eo: uzante testhipotezon

source: Two-sided
eo: Duflanka

source: greater
eo: pli granda

source: less
eo: malpli

source: Options
eo: Elektebloj

source: compute exact p-value
eo: kalkulu precizan p-valoron

source: Always
eo: Ĉiam

source: Automatic
eo: Aŭtomate

source: Never
eo: Neniam

source: Confidence Interval
eo: Konfida Intervalo

source: compute confidence interval
eo: komputi konfidan intervalon

source: confidence level
eo: konfida nivelo

source: Alternative Hypothesis
eo: Alternativa Hipotezo

source: This test performs the Ansari-Bradley two-sample test to test for a difference in scale parameters.
eo: Ĉi tiu testo elfaras la du-provan teston de Ansari-Bradley por provi diferencon en skalparametroj.

source: Defines whether an exact p-value should be computed. To compute an exact p-value in the presence of ties, use <link href="rkward://component/ansari_bradley_exact_test"/>.
eo: Difinas ĉu preciza p-valoro devus esti komputita. Por kalkuli precizan p-valoron en ĉeesto de ligoj, uzu <link href="rkward://component/ansari_bradley_exact_test"/>.

source: Ansari-Bradley two-sample test
eo: Ansari-Bradley-du-prova testo

source: Compute confidence interval
eo: Komputilu konfidan intervalon

# R code comment
source: cor requires all objects to be inside the same data.frame.
eo: kor postulas, ke ĉiuj objektoj estu ene de la sama data.frame.

# R code comment
source: Here we construct such a temporary frame from the input variables
eo: Ĉi tie ni konstruas tian provizoran kadron el la eniga variabloj

# R code comment
source: Non-numeric variables will be treated as ordered data and transformed into numeric ranks
eo: Ne-nombraj variabloj estos traktataj kiel ordigitaj datumoj kaj transformitaj en nombrajn rangojn

# R code comment
source: Keep track of all transformations
eo: Konservu ĉiujn transformojn

# R code comment
source: Finally combine the actual data
eo: Fine kombini la realajn datumojn

# R code comment
source: calculate correlation matrix
eo: kalkuli korelacian matricon

# R code comment
source: calculate matrix of probabilities
eo: kalkuli matricon de probabloj

# R code comment
source: as we need to do pairwise comparisons for technical reasons, we need to exclude incomplete cases first to match the use="complete.obs" parameter in cor()
eo: ĉar ni devas fari duopaj komparoj pro teknikaj kialoj, ni devas unue ekskludi nekompletajn kazojn por kongrui kun la parametro use="complete.obs" en cor()

# R code comment
source: polyserial expects x to be numeric
eo: poliserialo atendas ke x estu nombra

source: Coefficient
eo: Koeficiento

source: Standard errors, test of bivariate normality and sample size
eo: Normaj eraroj, testo de duvaria normaleco kaj specimena grandeco

source: p-values and sample size
eo: p-valoroj kaj specimena grandeco

source: Variables treated as numeric ranks
eo: Variabloj traktitaj kiel nombraj rangoj

# noun
source: Variable:
eo: Variablo:

source: original value
eo: origina valoro

source: assigned rank
eo: asignita rango

source: Calculate a correlation matrix given a number of numerical input vectors.
eo: Kalkuli korelacian matricon donitan nombron da nombraj enigvektoroj.

source: Choose the vectors to calculate correlations for. A correlation is calculated for each pair of vectors. Optionally, (two-sided) p-values are calculated for each pair.
eo: Elektu la vektorojn por kalkuli korelaciojn. Korelacio estas kalkulita por ĉiu paro de vektoroj. Laŭvole, (duflankaj) p-valoroj estas kalkulitaj por ĉiu paro.

source: Select the vectors to be correlated. For Pearson, Kendall and Spearman, the vectors need to be numeric (see below), and of equal length. Polyserial correlations are calculated between pairs of numeric and categorial variables, and polychoric correlations between categorial variables. If the categorial variables are dichotomous, polyserial/polychoric is equivalent to biserial/tetrachoric correlations.
eo: Elektu la vektorojn por esti korelaciitaj. Por Pearson, Kendall kaj Spearman, la vektoroj devas esti nombraj (vidu malsupre), kaj de egala longo. Pluriseriaj korelacioj estas kalkulitaj inter paroj de nombraj kaj kategoriaj variabloj, kaj polikoraj korelacioj inter kategoriaj variabloj. Se la kategoriaj variabloj estas dikotomaj, poliseriaj/poliĥoriaj estas ekvivalentaj al biseriaj/tetraĥoraj korelacioj.

source: If checked, an additional table with the (two-sided) significance values is calculated and printed. For polyserial/polychoric correlations, Chi-squared tests of bivariate normality are conducted, and also the standard errors are reported.
eo: Se markite, plia tabelo kun la (duflankaj) signifovaloroj estas kalkulita kaj presita. Por poliseriaj/polikoraj korelacioj, Ĥi-kvadrataj testoj de duvaria normaleco estas faritaj, kaj ankaŭ la normaj eraroj estas raportitaj.

source: Method of correlation to be used.
eo: Metodo de korelacio uzota.

source: For Kendall and Spearman, if some variables are not numeric but ordered categorial variables, have them treated as numeric ranks.
eo: Por Kendall kaj Spearman, se kelkaj variabloj ne estas nombraj sed ordigitaj kategoriaj variabloj, traktu ilin kiel nombrajn rangojn.

source: In case of missing values, should be row be excluded from all calculation (i.e. even for those pairs of variables, where neither value is missing), or should they only be excluded for those pairs where it is actually missing?
eo: En kazo de mankantaj valoroj, vico estu ekskludita de ĉiu kalkulo (t.e. eĉ por tiuj paroj de variabloj, kie neniu valoro mankas), aŭ ĉu ili nur estu ekskluditaj por tiuj paroj kie ĝi fakte mankas?

source: Correlation matrix
eo: Korelacia matrico

source: Variables
eo: Variabloj

source: variable(s):
eo: variablo(j):

source: Calculate p values
eo: Kalkuli p valorojn

source: Method
eo: Metodo

source: Pearson's product-moment correlation
eo: La produkt-momenta korelacio de Pearson

source: Kendall's tau
eo: La tau de Kendall

source: Spearman's rho
eo: La rho de Spearman

source: Polyserial correlation
eo: Poliseria korelacio

source: Polychoric correlation
eo: Poliĥora korelacio

source: Treat ordered categorial variables as numeric ranks
eo: Traktu ordigitajn kategoriajn variablojn kiel nombrajn rangojn

source: Exclude missing values
eo: Ekskludu mankantajn valorojn

source: whole cases
eo: tutaj kazoj

source: pairwise
eo: duope

# R code comment
source: convenience function to bind together several two dimensional tables into a single three dimensional table
eo: konvena funkcio por kunligi plurajn dudimensiajn tabelojn en ununuran tridimensian tabelon

# a statistic indicator
source: statistic
eo: statistiko

# R code comment
source: calculate crosstabs
eo: kalkuli kructabulojn

# noun
source: count
eo: nombro

source: % of row
eo: % de vico

source: % of column
eo: % de kolumno

source: % of total
eo: % de totalo

# expected count
source: expected
eo: atendita

source: Crosstabs (n to 1)
eo: Kructabuloj (n ĝis 1)

source: Pearson's Chi Square Test for Crosstabs
eo: Chi Square Test de Pearson por Crosstabs

# a statistic indicator
source: Statistic
eo: Statistiko

source: Barplot for Crosstabs
eo: Barploto por Kructabuloj

# dependent variable
source: Dependent
eo: Dependa

# independent variable
source: Independent
eo: Sendependa

source: Calculate two dimensional contingency tables for the count of occurrences of values in one "dependent" variable crossed with the values in one or more "independent" variables.
eo: Kalkuli dudimensiajn eventualajn tabelojn por la kalkulo de okazoj de valoroj en unu "dependa" variablo krucita kun la valoroj en unu aŭ pluraj "sendependaj" variabloj.

source: Specify the "dependent" variable. This variable will be present in all created tables. Specify one or more "independent" variables. Each of these will be cross-tabulated against the "dependent" variable. "Dependent" and "Independent", here, does not imply any inferential statistics. In each table, the occurrence of combinations of values in the "dependent" and "independent" variable is counted.
eo: Indiku la variablon "dependa". Ĉi tiu variablo ĉeestos en ĉiuj kreitaj tabeloj. Indiku unu aŭ plurajn "sendependajn" variablojn. Ĉiu el ĉi tiuj estos kructabelita kontraŭ la "dependa" variablo. "Dependa" kaj "Sendependa", ĉi tie, ne implicas iujn ajn inferencajn statistikojn. En ĉiu tabelo, la okazo de kombinaĵoj de valoroj en la "dependa" kaj "sendependa" variablo estas nombrita.

source: For complete crosstabulation of three or more variables against each other (into a single table), use <link href="rkward://component/crosstab_multi"/>.
eo: Por kompleta kructabelo de tri aŭ pli da variabloj unu kontraŭ la alia (en ununuran tabelon), uzu <link href="rkward://component/crosstab_multi"/>.

source: Select any vector that can be interpreted as a factor. This variable will be present in all tables.
eo: Elektu ajnan vektoron kiu povas esti interpretita kiel faktoro. Ĉi tiu variablo ĉeestos en ĉiuj tabeloj.

source: Select one or more vectors that can be interpreted as a factor. Each of these will be cross-tabulated against the "dependent" variable.
eo: Elektu unu aŭ plurajn vektorojn, kiuj povas esti interpretitaj kiel faktoro. Ĉiu el ĉi tiuj estos kructabelita kontraŭ la "dependa" variablo.

source: Should a chisquare test be performed (for each pair)?
eo: Ĉu oni faru ĉi-kvadratan teston (por ĉiu paro)?

source: Should a barplot be produced (for each pair)?
eo: Ĉu oni devus produkti barploton (por ĉiu paro)?

source: Allows to preview the result. Only the first table (and plot) is shown in the preview, even if more than one table is produced.
eo: Permesas antaŭrigardi la rezulton. Nur la unua tabelo (kaj grafiko) estas montrita en la antaŭvido, eĉ se pli ol unu tabelo estas produktita.

source: Calculate and show sums / margins
eo: Kalkulu kaj montru sumojn/marĝenojn

source: Calculate and show the proportion (in %) of each cell's count of the corresponding row's total count.
eo: Kalkulu kaj montru la proporcion (en %) de la kalkulo de ĉiu ĉelo de la totala kalkulo de la responda vico.

source: Calculate and show the proportion (in %) of each cell's count of the corresponding column's total count.
eo: Kalkulu kaj montru la proporcion (en %) de la kalkulo de ĉiu ĉelo de la totala kalkulo de la responda kolumno.

source: Calculate and show the proportion (in %) of each cell's count of overall total count.
eo: Kalkulu kaj montru la proporcion (en %) de la kalkulo de ĉiu ĉelo de totala totala kalkulo.

source: Should Monte-Carlo simulation be used to compute the p-value(s)?
eo: Ĉu Montekarlo-simulado estu uzata por komputi la p-valoro(j)n?

source: Number of replicates used in the Monte-Carlo test (if applicable).
eo: Nombro da kopioj uzataj en la Montekarlo-testo (se aplikeble).

source: Show the chisquare expected values per cell.
eo: Montru la ĉi-kvadratajn atendatajn valorojn per ĉelo.

source: Various options controlling the look of the generated barplot(s). See <link href="rkward://component/barplot_embed"/>
eo: Diversaj elektebloj regantaj la aspekton de la generita barploto(j). Vidu <link href="rkward://component/barplot_embed"/>

source: Dependent
eo: Dependa

source: Independent
eo: Sendependa

source: Draw Barplot
eo: Desegnu Barploton

source: Sums and proportions
eo: Sumoj kaj proporcioj

source: Show sums
eo: Montru sumojn

source: Show percent of row
eo: Montru procenton de vico

source: Show percent of column
eo: Montru procenton de kolumno

source: Show percent of total
eo: Montru procenton de totalo

source: Chisquare Options
eo: Chisquare Opcioj

source: Method of computing p-value
eo: Metodo de komputado de p-valoro

source: Asymptotic
eo: Asimptota

source: Number of replicates
eo: Nombro de kopioj

source: Number of replicates used in the Monte Carlo Method
eo: Nombro da kopioj uzitaj en la Montekarlo-Metodo

source: Show expect values
eo: Montru atendatajn valorojn

source: Barplot Options
eo: Barplot Opcioj

source: Crosstabs (n to n)
eo: Kructabuloj (n ĝis n)

source: Multiple crosstabulation where all the variables are crosstabulated with all the others.
eo: Multobla kructabelo kie ĉiuj variabloj estas kructabelitaj kun ĉiuj aliaj.

source: Choose one or more objects to be crosstabulated.
eo: Elektu unu aŭ plurajn objektojn por kructabeli.

source: For the case of two variables, or when the occurrences of values should be counted only for one "dependent" variable, <link href="rkward://component/crosstab"/> may be more appropriate, and offers more options.
eo: Por la kazo de du variabloj, aŭ kiam la aperoj de valoroj devus esti kalkulitaj nur por unu "dependa" variablo, <link href="rkward://component/crosstab"/> povas esti pli taŭga, kaj ofertas pli da ebloj.

source: Select a data frame or more than one variables from a data frame or with the same length
eo: Elektu datumkadron aŭ pli ol unu variablojn el datumkadro aŭ kun la sama longo

source: Should NA (and NaN) values be excluded (default)? If this option is not checked, missing values are listed in the table just like regular values.
eo: Ĉu NA (kaj NaN) valoroj estu ekskluditaj (defaŭlte)? Se ĉi tiu elekteblo ne estas markita, mankantaj valoroj estas listigitaj en la tabelo same kiel regulaj valoroj.

source: Control the "width" of the printed table: Categories of the first n selected variables are listed as rows, the remaining ones as columns.
eo: Regi la "larĝon" de la presita tabelo: Kategorioj de la unuaj n elektitaj variabloj estas listigitaj kiel vicoj, la ceteraj kiel kolumnoj.

source: variables:
eo: variabloj:

source: Row variables
eo: Vicaj variabloj

source: D'Agostino test of skewness
eo: D'Agostino-testo de skewness

source: This test performs the D'Agostino test for skewness in normally distributed data.
eo: Ĉi tiu testo elfaras la D'Agostino-teston pri dekliniĝo en normale distribuitaj datenoj.

source: Choose the data to perform the D'Agostino test for skewness in normally distributed data. You can choose multiple data. See <link href="rkward://rhelp/agostino.test"/>.
eo: Elektu la datumojn por elfari la D'Agostino-teston pri deformado en normale distribuitaj datumoj. Vi povas elekti plurajn datumojn. Vidu <link href="rkward://rhelp/agostino.test"/>.

source: Select the data to be computed. The vectors need to be numeric, and can be of different length.
eo: Elektu la datumojn por esti komputitaj. La vektoroj devas esti nombraj, kaj povas esti de malsama longo.

source: Show the total length of the data, and the number of missing values (purely informational, does not affect the test)?
eo: Montru la totalan longon de la datumoj, kaj la nombron da mankantaj valoroj (nure informa, ne influas la teston)?

source: If checked, a verbose description of the alternative hypothesis will be shown along with the results
eo: Se markite, multvorta priskribo de la alternativa hipotezo estos montrita kune kun la rezultoj

source: Test hypothesis (H1)
eo: Testa hipotezo (H1)

source: Show Length and NAs
eo: Montru Longon kaj NAojn

source: Verbose alternative hypothesis
eo: Vorta alternativa hipotezo

source: Anscombe-Glynn test of kurtosis
eo: Anscombe-Glynn-testo de kurtozo

source: This test performs the Anscombe-Glynn test of kurtosis for normal samples.
eo: Ĉi tiu testo elfaras la Anscombe-Glynn-teston de kurtozo por normalaj provaĵoj.

source: Choose the data to perform the Anscombe-Glynn test of kurtosis for normal samples. You can choose multiple data. See <link href="rkward://rhelp/anscombe.test"/>.
eo: Elektu la datumojn por plenumi la Anscombe-Glynn-teston de kurtozo por normalaj specimenoj. Vi povas elekti plurajn datumojn. Vidu <link href="rkward://rhelp/anscombe.test"/>.

source: Bonett-Seier test of Geary's kurtosis
eo: Bonett-Seier-testo de la kurtozo de Geary

source: This test performs the Bonett-Seier test of Geary's measure of kurtosis for normally distributed data.
eo: Tiu testo elfaras la Bonett-Seier-teston de la mezuro de Geary de kurtozo por normale distribuitaj datenoj.

source: Choose the data to perform the Bonett-Seier test of Geary's measure of kurtosis for normally distributed data. You can choose multiple data. See <link href="rkward://rhelp/bonett.test"/>.
eo: Elektu la datumojn por plenumi la Bonett-Seier-teston de la mezuro de Geary de kurtozo por normale distribuitaj datumoj. Vi povas elekti plurajn datumojn. Vidu <link href="rkward://rhelp/bonett.test"/>.

# Statistical moment
source: Moment
eo: Momenton

source: Statistical Moment
eo: Statistika Momento

source: This test computes the sample moment of specified order.
eo: Ĉi tiu testo kalkulas la specimenan momenton de specifita ordo.

source: Choose the data to compute the sample moments. You can choose multiple data. See <link href="rkward://rhelp/moment"/>.
eo: Elektu la datumojn por kalkuli la specimenajn momentojn. Vi povas elekti plurajn datumojn. Vidu <link href="rkward://rhelp/moment"/>.

source: If checked, central moments are computed.
eo: Se kontrolite, centraj momentoj estas komputitaj.

source: If checked, absolute moments are computed.
eo: Se kontrolite, absolutaj momentoj estas kalkulitaj.

source: If checked, missing values will be excluded from calculation (default setting in RKWard).
eo: Se markite, mankantaj valoroj estos ekskluditaj de kalkulo (defaŭlta agordo en RKWard).

source: sample moment
eo: specimena momento

source: Order
eo: Sinsekvo

source: specific test settings
eo: specifaj testaj agordoj

source: compute central moments
eo: kalkulu centrajn momentojn

source: compute absolute moments
eo: kalkuli absolutajn momentojn

source: remove missing values
eo: forigi mankantajn valorojn

source: additional settings
eo: aldonaj agordoj

source: Skewness
eo: Dekliniĝo

source: Kurtosis
eo: Kurtozo

source: Excess Kurtosis
eo: Troa Kurtozo

source: This computes the estimator of Pearson's measure of kurtosis, Geary's kurtosis and skewness of given data.
eo: Ĉi tio kalkulas la taksilon de la mezuro de Pearson de kurtozo, la kurtozo de Geary kaj deformeco de donitaj datenoj.

source: Choose the data to compute the kurtosis and/or skewness. You can choose multiple data. See <link href="rkward://rhelp/skewness"/>, <link href="rkward://rhelp/kurtosis"/> and <link href="rkward://rhelp/geary"/>.
eo: Elektu la datumojn por komputi la kurtozon kaj/aŭ dekliniĝon. Vi povas elekti plurajn datumojn. Vidu <link href="rkward://rhelp/skewness"/>, <link href="rkward://rhelp/kurtosis"/> kaj <link href="rkward://rhelp/geary "/>.

source: If this option is chosen, Skewness will be computed.
eo: Se ĉi tiu opcio estas elektita, Skewness estos kalkulita.

source: If this option is chosen, Pearson's kurtosis will be computed.
eo: Se ĉi tiu opcio estas elektita, la kurtozo de Pearson estos komputita.

source: If this option is chosen, Geary's kurtosis will be computed.
eo: Se ĉi tiu opcio estas elektita, la kurtozo de Geary estos komputita.

source: If checked, missing values will be excluded from calculation of skewness and kurtosis.
eo: Se markite, mankantaj valoroj estos ekskluditaj de kalkulo de skewness kaj kurtozo.

source: Select Variables
eo: Elektu Variaĵojn

source: Geary's kurtosis
eo: Kurtozo de Geary

source: Show Length
eo: Montru Longon

source: X-squared
eo: X-kvadrata

source: p-value
eo: p-valoro

source: Variance
eo: Varianco
