Repository: KDE/rkward
Catalog: po/*/rkward__distributions.po
Languages: ru

source: Only the distribution function can be plotted for the Tukey distribution.
ru: Для распределения Тьюки можно построить только график функции распределения.

source: Number of independent observations whose range to consider.
ru: Количество независимых наблюдений, диапазон которых будет учитываться.

source: Degrees of freedom for the (independent sample) estimate of standard deviation.
ru: Степени свободы для оценки (независимой выборки) стандартного отклонения.

source: Number of observations
ru: Количество наблюдений

source: Degrees of freedom for standard deviation estimate
ru: Степени свободы для оценки стандартного отклонения

source: Plot Studentized Range (Tukey) probabilities
ru: График вероятностей стьюдентизированного диапазона (Тьюки)

# Uniform distribution
source: Uniform
ru: Равномерное

source: Density and distribution function plots for the Uniform distribution.
ru: Графики функций плотности и распределения для равномерного распределения.

source: See R reference on Uniform distribution.
ru: Смотрите справку R по равномерному распределению.

source: Plot Uniform probabilities
ru: График вероятностей равномерного распределения

# Weibull distribution
source: Weibull
ru: Вейбулла

source: Density and distribution function plots for the Weibull distribution.
ru: Графики функций плотности и распределения для распределения Вейбулла.

source: See R reference on Weibull distribution.
ru: Смотрите справку R по распределению Вейбулла.

source: Plot Weibull probabilities
ru: График вероятностей распределения Вейбулла

# Wilcoxon Rank Sum distribution
source: Wilcoxon Rank Sum
ru: Сумма рангов Вилкоксона

source: Density and distribution function plots for the Wilcoxon distribution.
ru: Графики функций плотности и распределения для распределения Вилкоксона.

source: See R reference on Wilcoxon distribution.
ru: Смотрите справку R по распределению Вилкоксона.

source: Upper quantile (at most m*n)
ru: Верхний квантиль (не больше m*n)

source: Plot Wilcoxon Rank Sum statistic probabilities
ru: График статистических вероятностей распределения суммы рангов Вилкоксона

source: Poisson distribution
ru: Распределение Пуассона

source: Provides a calculator for probabilities, quantiles, and densities in the Poisson distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в распределении Пуассона.

source: Quantiles represent the number of events observed in a specified region (e.g. a fixed number of trials, or a fixed period of time), where λ (lambda) is the expected (mean) number of such events.
ru: Квантили представляют количество событий, наблюдаемых в указанной области (например, фиксированное количество испытаний или фиксированный период времени), где λ (лямбда) является ожидаемым (средним) количеством таких событий.

source: The expected (mean) number of events in the region of interest.
ru: Ожидаемое (среднее) количество событий в интересующей области.

source: λ (Lambda)
ru: λ (лямбда)

source: t distribution
ru: t-распределение

source: Provides a calculator for probabilities, quantiles, and densities in the <i>t</i> distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в <i>t</i>-распределении.

source: Degrees of freedom.
ru: Степени свободы.

source: Non-centrality parameter.
ru: Параметр нецентральности.

source: Select Variables
ru: Выбор переменных

source: variable(s):
ru: переменные:

source: Note: Objects must have at least 8 values
ru: Примечание: объекты должны иметь не менее 8 значений

source: Options
ru: Параметры

source: Show Length and NAs
ru: Показать длину и недоступные значения

source: This plugin calculates a Jarque-Bera chi-squared statistic for a variable x and tests against the null hypothesis of normality.
ru: Этот модуль рассчитывает статистику хи-квадрат Харке — Бера для переменной x и выполняет проверку на соответствие нулевой гипотезе о нормальности.

source: Select one or more numeric variables to test against normality. An individual test is run for each one of them. The output consists of the JB chi-squared statistic with 2 degrees of freedom and its correspondent p-value. The statistic's distribution is asymptotic, so this test performs better when working with big samples.
ru: Выберите одну или несколько числовых переменных для тестирования на нормальность. Для каждой из них выполняется отдельная проверка. Выходные данные состоят из статистики хи-квадрат Харке — Бера с 2 степенями свободы и соответствующего p-значения. Распределение статистики является асимптотическим, поэтому этот тест лучше работает для больших выборок.

source: Make sure the data does not contain NAs or, if so, that the 'Exclude NAs' option is checked, as neglecting this will usually prevent the test from succeeding.
ru: Убедитесь, что данные не содержат недоступных значений. Когда такие значения имеются, установите флажок «Исключить недоступные значения» (если этого не сделать, то тест, скорее всего, не получится выполнить).

source: Select the data to be computed (one or more variables). The vectors need to be numeric and can be of different length.
ru: Выберите данные для вычисления (одну или несколько переменных). Векторы должны быть числовыми и могут иметь разную длину.

source: Select if you want to include the number of observations and NAs in the output. (Default: YES)
ru: Укажите, следует ли включить количество наблюдений и недоступные значения в выходные данные. (По умолчанию: ДА)

source: Select if your data has missing values. The NAs are then omitted when performing the test. (Default: YES)
ru: Укажите, содержат ли данные отсутствующие значения. Такие значения будут пропущены при последующем выполнении теста. (По умолчанию: ДА)

source: Exclude NAs
ru: Исключить недоступные значения

source: Lilliefors (Kolmogorov-Smirnov) Normality test
ru: Тест на нормальность Лиллиефорса (Колмогорова — Смирнова)

source: Note: Objects must have at least 5 values
ru: Примечание: объекты должны иметь не менее 5 значений

source: number of classes
ru: количество классов

source: degrees of freedom
ru: степени свободы

source: p-value from chi^2-distribution from
ru: p-значение из распределения хи^2 с

source: n.classes-3 degrees of freedom
ru: n.classes-3 степеней свободы

source: n.classes-1 degrees of freedom
ru: n.classes-1 степеней свободы

source: Note: Objects must have between 5 and 5000 values
ru: Примечание: объекты должны иметь от 5 до 5000 значений

source: Note: Objects must have between 3 and 5000 values
ru: Примечание: объекты должны иметь от 3 до 5000 значений

source: Studentized Range (Tukey) distribution
ru: Распределение стьюдентизированного диапазона (Тьюки)

source: Provides a calculator for probabilities, quantiles in the Standardized Range (Tukey) distribution. Calculating densities is not supported by this plugin.
ru: Предоставляет калькулятор вероятностей и квантилей в распределении стьюдентизированного диапазона (Тьюки). Этот модуль не поддерживает расчёт плотностей.

source: Quantiles are the ratio between the observed range in the given number of observations, and the standard deviation estimate (based on given number of degrees of freedom) of an independent sample.
ru: Квантили — это отношение наблюдаемого диапазона в указанном количестве наблюдений к оценке стандартного отклонения (на основе указанного количества степеней свободы) независимой выборки.

source: Uniform distribution
ru: Равномерное распределение

source: Provides a calculator for probabilities, quantiles, and densities in the Uniform distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в равномерном распределении.

source: Lower limit.
ru: Нижний предел.

source: Upper limit.
ru: Верхний предел.

source: Lower limit of the distribution
ru: Нижний предел распределения

source: Upper limit of the distribution
ru: Верхний предел распределения

source: Weibull distribution
ru: Распределение Вейбулла

source: Provides a calculator for probabilities, quantiles, and densities in the Weibull distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в распределении Вейбулла.

source: Shape parameter (k).
ru: Параметр формы (k).

source: Scale parameter (λ).
ru: Параметр масштаба (λ).

source: Wilcoxon Rank Sum distribution
ru: Распределение суммы рангов Вилкоксона

source: Provides a calculator for probabilities, quantiles, and densities in the Wilcoxon distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в распределении Вилкоксона.

source: Quantiles correspond to the value of the Wilcoxon Rank Sum statistic, i.e. the number of pairs from sample x and y, for which y[j] is not greater than x[i].
ru: Квантили соответствуют значению статистики суммы рангов Вилкоксона, то есть количеству пар из выборок x и y, для которых y[j] не больше x[i].

source: m (Numbers of observations in the first sample)
ru: m (количество наблюдений в первой выборке)

source: n (Numbers of observations in the second sample)
ru: n (количество наблюдений во второй выборке)

# Author name
source: RKWard Team
ru: Команда RKWard
