Repository: KDE/rkward
Catalog: po/*/rkward__item_response_theory.po
Languages: ar, eo

source: Select the matrix of polytomous item responses from the objects shown on the left.
ar: اختر مصفوفة استجابات البند مُتعددة التفرع من الكائنات الموضحة على اليسار.
eo: Elektu la matricon de politomaj objektorespondoj el la objektoj montritaj maldekstre.

source: If you only want to use a subset of items from selected object, you can specify these here.
ar: إذا أردت فقط استخدام مجموعة فرعية من البنود من الكائن المحدد، يمكنك تحديدها هنا.
eo: Se vi volas nur uzi subaron de eroj el elektita objekto, vi povas specifi ĉi tiujn ĉi tie.

source: Choose if discrimination parameters should be computed for each item individually. Alternatively, you can estimate one discrimination parameter that is equal for all items, or fix it at 1 for all items.
ar: اختر إذا كان يجب حساب مَعْلَمَات التمييز لكل بند على حدة. بدلاً من ذلك، يمكنك تقدير مَعْلَمَة تمييز واحدة مُتساوية لجميع البنود، أو تثبيتها على 1 لجميع البنود.
eo: Elektu ĉu diskriminaciaj parametroj estu komputitaj por ĉiu objekto individue. Alternative, vi povas taksi unu diskriminacian parametron kiu estas egala por ĉiuj eroj, aŭ fiksi ĝin je 1 por ĉiuj eroj.

source: By default start values for the parameters are computed automatically. Alternatively, you can force the use of random start values, or give a list of values to be used. For detailed information on the specific layout of that list please refer to the manual for the <link href="rkward://rhelp/gpcm">gpcm()</link> function.
ar: آليًا تُحسب قيم البدء للمَعْلَمَات بطريقة آليَّة. وبدلاً من ذلك، يمكنك فرض استخدام قيم بدء عشوائية، أو اعطِ قائمة من القيم لـ تُستخدَم. للحصول على معلومات مفصلة حول التخطيط المعين لتلك القائمة، ارجع إلى دليل دالة <link href="rkward://rhelp/gpcm">gpcm()</link>.
eo: Defaŭlte startvaloroj por la parametroj estas kalkulitaj aŭtomate. Alternative, vi povas devigi la uzon de hazardaj komencaj valoroj, aŭ doni liston de uzotaj valoroj. Por detalaj informoj pri la specifa aranĝo de tiu listo bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/gpcm">gpcm()</link>.

source: Options are forward difference approximation (the default) and central difference approximation.
ar: الخيارات هي تقريب الفروق الأمامية (المبدئي) وتقريب الفروق المركزية.
eo: Elektebloj estas antaŭa diferencproksimumado (la defaŭlta) kaj centra diferencproksimumado.

source: Step size to be used in the numerical derivative. Default is 1e-06. If you use central difference approximation, change this to a larger value, e.g., 1e-03 or 1e-04.
ar: حجم الخطوة لـ يُستخدَم في المُشتقة العددية. المبدئي هو 1e-06. إذا استخدمت تقريب الفروق المركزية، غيِّر هذا إلى قيمة أكبر، مثل 1e-03 أو 1e-04.
eo: Paŝa grandeco por esti uzata en la nombra derivaĵo. Defaŭlte estas 1e-06. Se vi uzas centran diferencon, ŝanĝu ĉi tion al pli granda valoro, ekz., 1e-03 aŭ 1e-04.

source: IRT parameter estimation: Generalized partial credit model
ar: تقدير مَعْلَمَة نظرية الاستجابة للبنود: نموذج الائتمان الجزئي المُعمَّم
eo: IRT-parametrotakso: Ĝeneraligita parta kreditmodelo

source: Item selection
ar: تحديد العنصر
eo: Elekto de objektoj

source: Select a subset of items
ar: اختر مجموعة فرعية من البنود
eo: Elektu subaron de eroj

source: List of items:
ar: قائمة العناصر:
eo: Listo de eroj:

source: Should parameters be fixed (constrained)?
ar: هل يجب تثبيت (تقييد) المَعْلَمَات؟
eo: Ĉu parametroj estu fiksitaj (limigitaj)?

source: Each item has its one discrimination parameter
ar: لكل بند مَعْلَمَة تمييز خاصة به
eo: Ĉiu ero havas sian unu diskriminacian parametron

source: Equal discrimination parameter across items
ar: معلمة تمييز متساوية عبر البنود
eo: Egala diskriminacia parametro inter eroj

source: Discrimination parameter fixed at 1 across items
ar: معلمة التمييز مثبتة عند 1 عبر البنود
eo: Diskriminacia parametro fiksita je 1 tra eroj

source: Use own list of start values
ar: استخدِم قائمتك الخاصة من قيم البدء
eo: Uzu propran liston de komencaj valoroj

source: List of start values:
ar: قائمة قيم البدء:
eo: Listo de komencaj valoroj:

source: Numerical derivative algorithm to approximate Hessian matrix:
ar: خوارزمية المشتق العددي لتقريب مصفوفة Hessian:
eo: Cifereca deriva algoritmo por proksimigi Hessian matricon:

source: Forward difference approximation
ar: تقريب الفرق الأمامي
eo: Alproksimiĝo al antaŭa diferenco

source: Central difference approximation
ar: تقريب الفرق المركزي
eo: Centra diferenc-alproksimiĝo

source: GRM parameter estimation
ar: تقدير معلمة نموذج الاستجابة المتدرجة (GRM)
eo: GRM-parametrotakso

source: To fit the graded response model with default settings, just the matrix of manifest variables (polytomous item responses) must be selected. Further options are described in the sections below.
ar: لِمُلاءمة نموذج الاستجابة المتدرجة بالإعدادات المبدئية، يجب اختيار مصفوفة المتغيرات الظاهرة (استجابات البنود المتعددة القياسات) فقط. وصفت خيارات إضافية في الأقسام بالأسفل.
eo: Por konveni la gradigitan respondmodelon kun defaŭltaj agordoj, nur la matrico de manifestaj variabloj (politomaj objektorespondoj) devas esti elektita. Pliaj elektoj estas priskribitaj en la sekcioj sube.

source: If checked it is assumed that discrimination parameters are equal for all items.
ar: إذا اُختير، يُفترَض أن معلمات التمييز متساوية لجميع البنود.
eo: Se markite oni supozas, ke diskriminaciaj parametroj estas egalaj por ĉiuj eroj.

source: By default start values for the parameters are computed automatically. Alternatively, you can force the use of random start values, or give a list of values to be used. For detailed information on the specific layout of that list please refer to the manual for the <link href="rkward://rhelp/grm">grm()</link> function.
ar: بصورة مبدئية، تُحسب قيم البدء للمعلمات آليًا. بديلًا لذلك، تستطيع فرض استخدام قيم بدء عشوائية، أو إعطاء قائمة بالقيم التي تستخدَم. لمعلومات مفصلة عن التنسيق الخاص لتلك القائمة، ارجع إلى دليل الدالة <link href="rkward://rhelp/grm">grm()</link>.
eo: Defaŭlte startvaloroj por la parametroj estas kalkulitaj aŭtomate. Alternative, vi povas devigi la uzon de hazardaj komencaj valoroj, aŭ doni liston de uzotaj valoroj. Por detalaj informoj pri la specifa aranĝo de tiu listo bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/grm">grm()</link>.

source: If checked the Hessian matrix is computed.
ar: إذا اُختيرت، تُحسب مصفوفة Hessian.
eo: Se kontrolite, la hesia matrico estas komputita.

source: Number of digits to abbreviate item names
ar: عدد الأرقام لاختصار أسماء البنود
eo: Nombro da ciferoj por mallongigi objektonomojn

source: Specifies how many digits are used in abbreviating item names. Defaults to 6.
ar: يحدد كم رقمًا يستخدَم في اختصار أسماء البنود. المبدئي هو 6.
eo: Specifas kiom da ciferoj estas uzataj por mallongigi objektonomojn. Defaŭlte al 6.

source: IRT parameter estimation: Graded response model
ar: تقدير معلمة نظرية الاستجابة للبنود (IRT): نموذج الاستجابة المتدرجة
eo: IRT-parametrotakso: Gradigita respondmodelo

source: Assume equal discrimination parameters across items
ar: افترِض معلمات تمييز متساوية عبر البنود
eo: Supozu egalajn diskriminaciajn parametrojn tra eroj

source: Compute Hessian matrix
ar: احسب مصفوفة Hessian
eo: Kalkuli Hessian matricon

source: Number of digits to abbreviate item names:
ar: عدد الأرقام لاختصار أسماء البنود:
eo: Nombro da ciferoj por mallongigi objektonomojn:

source: LPCM parameter estimation
ar: تقدير معلمة نموذج الائتمان الجزئي الخطي (LPCM)
eo: LPCM-parametrotakso

source: To fit the linear partial credit model with default settings, just the matrix of manifest variables (item responses) must be selected. Further options are described in the sections below. For detailed information on the expected layout of matrices and vectors please refer to the manual for the <link href="rkward://rhelp/LPCM">LPCM()</link> function.
ar: لِمُلاءمة نموذج الائتمان الجزئي الخطي بالإعدادات المبدئية، يجب اختيار مصفوفة المتغيرات الظاهرة (استجابات البنود) فقط. وصفت خيارات إضافية في الأقسام بالأسفل. لمعلومات مفصلة عن التنسيق المتوقع للمصفوفات والمتجهات، ارجع إلى دليل الدالة <link href="rkward://rhelp/LPCM">LPCM()</link>.
eo: Por konveni la linearan partan kreditmodelon kun defaŭltaj agordoj, nur la matrico de manifestaj variabloj (objektaj respondoj) devas esti elektita. Pliaj elektoj estas priskribitaj en la sekcioj sube. Por detalaj informoj pri la atendata aranĝo de matricoj kaj vektoroj bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/LPCM">LPCM()</link>.

source: Select the matrix of item responses from the objects shown on the left.
ar: اختر مصفوفة استجابات البنود من الكائنات المعروضة على اليسار.
eo: Elektu la matricon de objektorespondoj el la objektoj montritaj maldekstre.

source: By default the design matrix for the LPCM will be computed automatically. Alternatively, you may specify your own design matrix here.
ar: بصورة مبدئية، تُحسب مصفوفة التصميم لنموذج الائتمان الجزئي الخطي آليًا. بديلًا لذلك، قد تحدد مصفوفة التصميم الخاصة بك هنا.
eo: Defaŭlte la dezajnomatrico por la LPCM estos komputita aŭtomate. Alternative, vi povas specifi vian propran desegnan matricon ĉi tie.

source: IRT parameter estimation: Linear partial credit model
ar: تقدير معلمة نظرية الاستجابة للبنود (IRT): نموذج الائتمان الجزئي الخطي
eo: IRT-parametrotakso: Lineara parta kreditmodelo

source: LRSM parameter estimation
ar: تقدير معلمة نموذج مقياس التصنيف الخطي (LRSM)
eo: LRSM parametrotakso

source: To fit the linear rating scale model with default settings, just the matrix of manifest variables (item responses) must be selected. Further options are described in the sections below. For detailed information on the expected layout of matrices and vectors please refer to the manual for the <link href="rkward://rhelp/LRSM">LRSM()</link> function.
ar: لِمُلاءمة نموذج مقياس التصنيف الخطي بالإعدادات المبدئية، يجب اختيار مصفوفة المتغيرات الظاهرة (استجابات البنود) فقط. وصفت خيارات إضافية في الأقسام بالأسفل. لمعلومات مفصلة عن التنسيق المتوقع للمصفوفات والمتجهات، ارجع إلى دليل الدالة <link href="rkward://rhelp/LRSM">LRSM()</link>.
eo: Por konveni la linearan taksan skalmodelon kun defaŭltaj agordoj, nur la matrico de manifestaj variabloj (objektaj respondoj) devas esti elektita. Pliaj elektoj estas priskribitaj en la sekcioj sube. Por detalaj informoj pri la atendata aranĝo de matricoj kaj vektoroj bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/LRSM">LRSM()</link>.

source: By default the design matrix for the LRSM will be computed automatically. Alternatively, you may specify your own design matrix here.
ar: بصورة مبدئية، تُحسب مصفوفة التصميم لنموذج مقياس التصنيف الخطي آليًا. بديلًا لذلك، قد تحدد مصفوفة التصميم الخاصة بك هنا.
eo: Defaŭlte la dezajnomatrico por la LRSM estos komputita aŭtomate. Alternative, vi povas specifi vian propran desegnan matricon ĉi tie.

source: IRT parameter estimation: Linear rating scale model
ar: تقدير معلمة نظرية الاستجابة للبنود (IRT): نموذج مقياس التصنيف الخطي
eo: IRT-parametrotakso: Lineara taksa skalmodelo

source: PCM parameter estimation
ar: تقدير معلمة نموذج الائتمان الجزئي (PCM)
eo: PCM-parametrotakso

source: To fit the partial credit model with default settings, just the matrix of manifest variables (item responses) must be selected. Further options are described in the sections below. For detailed information on the expected layout of matrices and vectors please refer to the manual for the <link href="rkward://rhelp/PCM">PCM()</link> function.
ar: لِمُلاءمة نموذج الائتمان الجزئي بالإعدادات المبدئية، يجب اختيار مصفوفة المتغيرات الظاهرة (استجابات البنود) فقط. وصفت خيارات إضافية في الأقسام بالأسفل. لمعلومات مفصلة عن التنسيق المتوقع للمصفوفات والمتجهات، ارجع إلى دليل الدالة <link href="rkward://rhelp/PCM">PCM()</link>.
eo: Por konveni la partan kreditmodelon kun defaŭltaj agordoj, nur la matrico de manifestaj variabloj (objektaj respondoj) devas esti elektita. Pliaj elektoj estas priskribitaj en la sekcioj sube. Por detalaj informoj pri la atendata aranĝo de matricoj kaj vektoroj bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/PCM">PCM()</link>.

source: By default the design matrix for the PCM will be computed automatically. Alternatively, you may specify your own design matrix here.
ar: بصورة مبدئية، تُحسب مصفوفة التصميم لنموذج الائتمان الجزئي آليًا. بديلًا لذلك، قد تحدد مصفوفة التصميم الخاصة بك هنا.
eo: Defaŭlte la dezajnomatrico por la PCM estos komputita aŭtomate. Alternative, vi povas specifi vian propran desegnan matricon ĉi tie.

source: IRT parameter estimation: Partial credit model
ar: تقدير معلمة نظرية الاستجابة للبنود (IRT): نموذج الائتمان الجزئي
eo: IRT-parametrotakso: Parta kreditmodelo

source: RSM parameter estimation
ar: تقدير معلمة نموذج مقياس التصنيف (RSM)
eo: RSM-parametrotakso

source: To fit the rating scale model with default settings, just the matrix of manifest variables (item responses) must be selected. Further options are described in the sections below. For detailed information on the expected layout of matrices and vectors please refer to the manual for the <link href="rkward://rhelp/RSM">RSM()</link> function.
ar: لِمُلاءمة نموذج مقياس التصنيف بالإعدادات المبدئية، يجب اختيار مصفوفة المتغيرات الظاهرة (استجابات البنود) فقط. وصفت خيارات إضافية في الأقسام بالأسفل. لمعلومات مفصلة عن التنسيق المتوقع للمصفوفات والمتجهات، ارجع إلى دليل الدالة <link href="rkward://rhelp/RSM">RSM()</link>.
eo: Por konveni la taksan skalmodelon kun defaŭltaj agordoj, nur la matrico de manifestaj variabloj (objektaj respondoj) devas esti elektita. Pliaj elektoj estas priskribitaj en la sekcioj sube. Por detalaj informoj pri la atendata aranĝo de matricoj kaj vektoroj bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/RSM">RSM()</link>.

source: By default the design matrix for the RSM will be computed automatically. Alternatively, you may specify your own design matrix here.
ar: بصورة مبدئية، تُحسب مصفوفة التصميم لنموذج مقياس التصنيف آليًا. بديلًا لذلك، قد تحدد مصفوفة التصميم الخاصة بك هنا.
eo: Defaŭlte la dezajnomatrico por la RSM estos komputita aŭtomate. Alternative, vi povas specifi vian propran desegnan matricon ĉi tie.

source: IRT parameter estimation: Rating scale model
ar: تقدير معلمة نظرية الاستجابة للبنود (IRT): نموذج مقياس التصنيف
eo: IRT-parametrotakso: Taksa skalmodelo

source: Wald test (%1)
ar: اختبار Wald (%1)
eo: Wald-testo (%1)

source: Wald test on item level (z-values):
ar: اختبار Wald على مستوى البند (قيم z):
eo: Wald-testo sur objektonivelo (z-valoroj):

source: Wald test
ar: اختبار Wald
eo: Wald-testo

source: Data
ar: البيانات
eo: Datumoj

source: Choose fitted model to test:
ar: اختر النموذج المُلائم للاختبار:
eo: Elektu taŭgan modelon por testi:

source: Only objects of class Rm are valid!
ar: كائنات الصنف Rm فقط صالحة!
eo: Nur objektoj de klaso Rm validas!

source: Split criterion for subject raw scores
ar: معيار التقسيم للدرجات الخام للموضوع
eo: Split kriterio por subjektaj krudaj poentoj

source: Median
ar: الوسيط
eo: Mediano

source: Mean
ar: المتوسط

source: Use dichotomous vector to define groups
ar: استخدِم متجهًا ثنائيًا لتحديد المجموعات
eo: Uzu dikotoman vektoron por difini grupojn

source: Select grouping vector:
ar: اختر متجه التجميع:
eo: Elektu grupan vektoron:

source: Optimizer
ar: المُحسِّن
eo: Optimigilo

source: Cronbach's alpha
ar: ألفا كرونباخ
eo: alfao de Cronbach

source: Dataset
ar: مجموعة البيانات
eo: Datenaro

source: Subset
ar: مجموعة فرعية
eo: Subaro

source: Items:
ar: البنود:
eo: Eroj:

source: <br />Sample units:
ar: <br />وحدات العينة:
eo: <br />Ekzemplanuoj:

source: Effects on alpha if items are removed:
ar: تأثيرات على ألفا إذا أُزيلت البنود:
eo: Efikoj sur alfa se eroj estas forigitaj:

source: %1% Confidence interval:
ar: فترة ثقة %1%:
eo: %1% Konfida intervalo:

source: Item responses:
ar: استجابات البنود:
eo: Item-respondoj:

source: Must be a matrix or data.frame, including the items as columns.
ar: يجب أن تكون مصفوفة أو إطار بيانات، تتضمن البنود كأعمدة.
eo: Devas esti matrico aŭ data.frame, inkluzive de la eroj kiel kolumnoj.

source: Number of Bootstrap samples:
ar: عدد عينات Bootstrap:
eo: Nombro da Bootstrap-specimenoj:

source: Compute standardized Cronbach's alpha
ar: احسب ألفا كرونباخ المعيارية
eo: Komputilo normigita alfao de Cronbach

source: Ignore missing values
ar: تجاهَل القيم المفقودة
eo: Ignoru mankantajn valorojn

source: Compute Bootstrap confidence interval (CI)
ar: احسب فترة ثقة Bootstrap (CI)
eo: Komputilu Bootstrap konfidan intervalon (CI)

source: Confidence interval:
ar: فترة الثقة:
eo: Konfida intervalo:

source: Goodness of Fit for Rasch Models (%1)
ar: جودة المُلاءمة لنماذج Rasch (%1)
eo: Boneco de Taŭgeco por Rasch-Modeloj (%1)

source: Goodness of Fit (Rasch model)
ar: جودة المُلاءمة (نموذج Rasch)
eo: Boneco de Fit (Rasch-modelo)

source: Choose fitted model to examine:
ar: اختر النموذج المُلائم للفحص:
eo: Elektu taŭgan modelon por ekzameni:

source: Only objects of class rasch are valid!
ar: كائنات الصنف rasch فقط صالحة!
eo: Nur objektoj de klasa rasch validas!

source: Bootstrap options
ar: خيارات Bootstrap
eo: Bootstrap-opcioj

source: Number of samples
ar: عدد العينات
eo: Nombro de specimenoj

source: Item-fit statistics (%1)
ar: إحصائيات مُلاءمة البند (%1)
eo: Statistiko de eroj-konvenaj (%1)

source: Alternative: Items do not fit the model
ar: بديل: البنود لا تلائم النموذج
eo: Alternativo: Eroj ne konvenas al la modelo

source: Ability Categories:
ar: فئات القدرة:
eo: Kapablaj Kategorioj:

source: Monte Carlo samples:
ar: عينات Monte Carlo:
eo: Montekarlo-provaĵoj:

source: Item-Fit Statistics and P-values:
ar: إحصائيات مُلاءمة البند وقيم P:
eo: Item-Fit Statistics kaj P-valoroj:

source: Item-fit statistics for Rasch, LTM and 3PM
ar: إحصائيات مُلاءمة البند لنماذج Rasch و LTM و 3PM
eo: Item-taŭgaj statistikoj por Rasch, LTM kaj 3PM

source: Only objects of class ltm, rasch and tpm are valid!
ar: كائنات الأصناف ltm و rasch و tpm فقط صالحة!
eo: Nur objektoj de klaso ltm, rasch kaj tpm validas!

source: Grouping of sample units
ar: تجميع وحدات العينة
eo: Grupiĝo de specimenaj unuoj

source: Number of categories
ar: عدد الفئات
eo: Nombro de kategorioj

source: Summarize the ability estimates by
ar: لخِّص تقديرات القدرة بواسطة
eo: Resumu la kapablectaksojn per

source: Median of each group
ar: وسيط كل مجموعة
eo: Mediano de ĉiu grupo

source: Mean of each group
ar: متوسط كل مجموعة
eo: Mezo de ĉiu grupo

source: p value assumptions
ar: افتراضات قيمة p
eo: p valoraj supozoj

source: Assume chi-squared distribution
ar: افترِض توزيع مربع كاي
eo: Supozi ĉi-kvadratan distribuon

source: Use Monte Carlo procedure to approximate distribution
ar: استخدِم إجراء Monte Carlo لتقريب التوزيع
eo: Uzu Montekarlon proceduron por proksimuma distribuo

source: Number of replications
ar: عدد التكرارات
eo: Nombro de reproduktaĵoj

source: Person-fit statistics (%1)
ar: إحصائيات مُلاءمة الشخص (%1)
eo: Person-taŭga statistiko (%1)

source: Response patterns, person-fit statistics (L0, Lz) and probabilities for each response pattern (Pr):
ar: أنماط الاستجابة، إحصائيات مُلاءمة الشخص (L0، Lz) واحتمالات كل نمط استجابة (Pr):
eo: Respondpadronoj, person-taŭga statistiko (L0, Lz) kaj verŝajnecoj por ĉiu respondpadrono (Pr):

source: Person-fit statistics for Rasch, LTM and 3PM
ar: إحصائيات مُلاءمة الشخص لنماذج Rasch و LTM و 3PM
eo: Person-taŭga statistiko por Rasch, LTM kaj 3PM

source: Alternative hypothesis to test
ar: الفرضية البديلة للاختبار
eo: Alternativa hipotezo por testi

source: Inconsistent response pattern under the estimated model
ar: نمط استجابة غير متّسق وفق النموذج المقدر
eo: Nekonsekvenca respondpadrono sub la laŭtaksa modelo

source: More consistent response pattern than the model predicts
ar: نمط استجابة أكثر اتساقًا مما يتنبأ به النموذج
eo: Pli konsekvenca respondpadrono ol la modelo antaŭdiras

source: Two sided (test both of the above)
ar: ثنائي الجانب (اختبر كليهما)
eo: Duflankaj (testu ambaŭ ĉi-suprajn)

source: Response pattern
ar: نمط الاستجابة
eo: Responda ŝablono

source: Compute for observed response pattern
ar: احسب لنمط الاستجابة المُلاحَظ
eo: Kalkuti por observita respondŝablono

source: Compute for given response pattern
ar: احسب لنمط الاستجابة المُعطى
eo: Kalkuli por donita respondŝablono

source: Select matrix or data.frame with pattern to use:
ar: اختر مصفوفة أو إطار بيانات بالنمط للاستعمال:
eo: Elektu matricon aŭ data.frame kun ŝablono por uzi:

source: Assume standard normal distribution
ar: افترض توزيعًا طبيعيًا معياريًا
eo: Supozu norman normalan distribuon

source: Unidimensionality check (%1)
ar: تدقيق أحادية البعد (%1)
eo: Kontrolo de unudimensieco (%1)

source: Matrix of tetrachoric correlations:
ar: مصفوفة الارتباطات الرباعية:
eo: Matrico de tetrakoraj korelacioj:

source: Unidimensionality Check using Modified Parallel Analysis:
ar: تدقيق أحادية البعد باستخدام تحليل التوازي المعدَّل:
eo: Unudimensia Kontrolo uzante Modifitan Paralelan Analizon:

source: Alternative hypothesis: <em>The second eigenvalue of the observed data is substantially larger than the second eigenvalue of data under the assumed IRT model</em>
ar: الفرضية البديلة: <em>القيمة الذاتية الثانية للبيانات المرصودة أكبر بكثير من القيمة الذاتية الثانية للبيانات في إطار نموذج نظرية استجابة البند المفترض (IRT)</em>
eo: Alternativa hipotezo: <em>La dua ajgenvaloro de la observitaj datenoj estas sufiĉe pli granda ol la dua ajgenvaloro de datumoj sub la supozita IRT-modelo</em>

source: Second eigenvalue in the observed data:
ar: القيمة الذاتية الثانية في البيانات المرصودة:
eo: Dua propra valoro en la observitaj datenoj:

source: Average of second eigenvalues in Monte Carlo samples:
ar: متوسط القيم الذاتية الثانية في عينات مونت كارلو:
eo: Mezumo de duaj propraj valoroj en Montekarlo-provaĵoj:

source: p-value:
ar: قيمة الاحتمال (p-value):
eo: p-valoro:

source: Unidimensionality check (Rasch, LTM, 3PM)
ar: تدقيق أحادية البعد (راش، نموذج المعلمتين اللوجستي، نموذج الثلاث معلمات)
eo: Unudimensia kontrolo (Rasch, LTM, 3PM)

source: Choose fitted model to check:
ar: اختر النموذج الموفَّق للتدقيق:
eo: Elektu taŭgan modelon por kontroli:

source: Only objects of class rasch, ltm or tpm are valid!
ar: كائنات الفئات راش، نموذج المعلمتين اللوجستي، أو نموذج الثلاث معلمات فقط صالحة!
eo: Nur objektoj de klaso rasch, ltm aŭ tpm validas!

source: Monte Carlo options
ar: خيارات مونت كارلو
eo: Opcioj de Montekarlo

source: Number of samples:
ar: عدد العينات:
eo: Nombro da specimenoj:

source: Item Response Theory
ar: نظرية استجابة البند
eo: Item Responda Teorio

source: Item Response Theory Plugins. Part of the official RKWard distribution
ar: إضافات نظرية استجابة البند. جُزء من توزيع أر كي وارد الرسمي
eo: Item Responda Teorio Kromaĵoj. Parto de la oficiala RKWard-distribuo

source: Rasch model fit
ar: توفيق نموذج راش
eo: Rasch modelo taŭgas

source: Two parameter logistic model fit
ar: توفيق نموذج المعلمتين اللوجستي
eo: Du parametro loĝistika modelo taŭgas

source: Birnbaum three parameter model fit
ar: توفيق نموذج بيرنباوم لثلاث معلمات
eo: Birnbaum tri parametro modelo taŭgas

source: Linear logistic test model fit
ar: توفيق نموذج الاختبار اللوجستي الخطي
eo: Lineara loĝistika testmodelo taŭgas

source: Graded response model fit
ar: توفيق نموذج الاستجابة المتدرجة
eo: Gradigita respondmodelo taŭgas

source: Rating scale model fit
ar: توفيق نموذج مقياس التصنيف
eo: Takso skalmodelo taŭgas

source: Partial credit model fit
ar: توفيق نموذج الاعتماد الجزئي
eo: Parta kreditmodelo taŭgas

source: Generalized partial credit model fit
ar: توفيق نموذج الاعتماد الجزئي المُعمَّم
eo: Ĝeneraligita parta kreditmodelo taŭgas

source: Linear rating scale model fit
ar: توفيق نموذج مقياس التصنيف الخطي
eo: Lineara taksa skalmodelo taŭgas

source: Linear partial credit model fit
ar: توفيق نموذج الاعتماد الجزئي الخطي
eo: Lineara parta kreditmodelo taŭgas

source: Goodness of Fit (Rasch)
ar: جودة التوفيق (راش)
eo: Boneco de Taŭgeco (Rasch)
