Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: Show only packages matching:
ar: أظهر فقط الحزم التي تطابق:
ru: Показывать только пакеты с соответствием:
tr: Yalnızca şununla eşleşen paketleri göster:

source: <p>You can limit the packages displayed in the list to with names or titles matching a filter string.</p>
ar: <p>يمكنك حصر الحزم المعروضة في القائمة لتشمل الأسماء أو العناوين التي تطابق سلسلة تصفية.</p>
ru: <p>Можно сделать так, чтобы в списке были показаны только те пакеты, имена или заголовки которых соответствуют строке фильтра.</p>
tr: <p>Listede görüntülenen paketleri, bir süzgeç dizisiyle eşleşen adlar veya başlıklarla sınırlayabilirsiniz.</p>

source: Show only packages providing RKWard dialogs
ar: أظهر فقط الحزم التي توفر حوارات أر كي وارد
ru: Показывать только пакеты, предоставляющие диалоги RKWard
tr: Yalnızca RKWard iletişim kutularını sağlayan paketleri göster

source: <p>Some but not all R packages come with plugins for RKWard. That means they provide a graphical user-interface in addition to R functions. Check this box to show only such packages.</p>
ar: <p>بعض حزم R، وليس كلها، تأتي مع إضافات لـ أر كي وارد. يعني ذلك أنها توفر واجهة مستخدم رسومية بالإضافة إلى دوال R. حدد هذا المربع لإظهار هذه الحزم فقط.</p>
ru: <p>Некоторые (не все) пакеты R поставляются с модулями для RKWard. Это означает, что они предоставляют не только функции R, но и графический интерфейс пользователя. Включите этот параметр для просмотра только таких пакетов.</p>
tr: <p>R paketlerinin tümü olmasa da bazıları RKWard için eklentilerle birlikte gelir. Bu, R işlevlerine ek olarak grafiksel bir kullanıcı arayüzü sağladıkları anlamına gelir. Yalnızca bu tür paketleri göstermek için bu kutuyu işaretleyin.</p>

source: Install packages to:
ar: ثبت الحزم إلى:
ru: Установить пакеты в:
tr: Paketleri şuraya kur:

source: Install suggested packages
ar: ثبت الحزم المقترحة
ru: Установить предложенные пакеты
tr: Önerilen paketleri kur

source: Some packages "suggest" additional packages, which are not strictly necessary for using that package, but which may provide additional related functionality. Check this option to include such additional suggested packages.
ar: تقترح بعض الحزم حزمًا إضافية، ليست ضرورية بالضرورة لاستخدام تلك الحزمة، ولكن قد توفر وظائف إضافية ذات صلة. حدد هذا الخيار لتضمين هذه الحزم المقترحة الإضافية.
ru: Некоторые пакеты «предлагают» дополнительные пакеты, которые не являются строго необходимыми для их работы, но могут предоставлять дополнительный функционал. Включите этот параметр, чтобы установить также и их.
tr: Bazı paketler, söz konusu paketin kullanılması için kesinlikle gerekli olmayan; ancak ilgili ek işlevsellik sağlayabilecek ek paketleri “önerir”. Önerilen ek paketleri içermek için bu seçeneği işaretleyin.

source: Configure Repositories
ar: اضبط المستودعات
ru: Настроить репозитории
tr: Depoları Yapılandır

source: Many packages are available on CRAN (Comprehensive R Archive Network), and other repositories.<br>Click this to add more sources.
ar: تتوفر العديد من الحزم على CRAN (شبكة أرشيف R الشاملة)، ومستودعات أخرى.<br>انقر على هذا لإضافة المزيد من المصادر.
ru: Многие пакеты доступны в CRAN (Comprehensive R Archive Network, обширный сетевой архив R) и других репозиториях.<br>Нажмите для добавления дополнительных источников.
tr: CRAN (Kapsamlı R Arşiv Ağı) ve diğer depolarda pek çok paket bulunur.<br>Daha fazla kaynak eklemek için buna tıklayın.

source: <b>Install %1 packages (plus dependencies), remove %2 packages</b>
ar: <b>ثبت %1 حزمة (بالإضافة إلى التبعيات)، أزل %2 حزمة</b>
ru: <b>Установить пакеты (%1) и зависимости, удалить пакеты (%2)</b>
tr: <b>%1 paketi (ve bağımlılıklarını) kur, %2 paketi kaldır</b>

source: The following package(s) requested by the backend have not been found in the package repositories: "%1". Maybe the package name was mis-spelled. Or maybe you need to add additional repositories via the "Configure Repositories" button.
ar: لم يعثر على الحزمة (الحزم) التالية المطلوبة من قبل الخلفية في مستودعات الحزم: «%1». ربما هجئ اسم الحزمة خطأ. أو ربما تحتاج إلى إضافة مستودعات إضافية عبر زر «اضبط المستودعات».
ru: В репозиториях не найдены следующие запрашиваемые серверным приложением пакеты: «%1». Возможно, при указании имён пакетов были допущены ошибки. Либо следует добавить дополнительные репозитории с помощью кнопки «Настроить репозитории».
tr: Arka uç tarafından talep edilen şu paket(ler) paket depolarında bulunamadı: “%1”. Paket adı yanlış yazılmış olabilir veya belki de “Depoları Yapılandır” düğmesi aracılığıyla ek depolar eklemeniz gerekebilir.

source: Package not available
ar: الحزمة غير متوفرة
ru: Пакет недоступен
tr: Paket kullanılamıyor

source: <p>Please stand by while searching for installed and available packages.</p><p><strong>Note:</strong> This requires a working internet connection, and may take some time, esp. if one or more repositories are temporarily unavailable.</p>
ar: <p>انتظر ريثما يبحث عن الحزم المثبتة والمتاحة.</p><p><strong>ملاحظة:</strong> هذا يتطلب اتصال إنترنت عامل، وقد يستغرق بعض الوقت، خاصة إذا كان واحد أو أكثر من المستودعات غير متاح مؤقتًا.</p>
ru: <p>Подождите, выполняется поиск установленных и доступных пакетов.</p><p><strong>Примечание:</strong> необходимо работающее интернет-соединение, может потребоваться некоторое время (особенно в том случае, если один или несколько репозиториев временно недоступны).</p>
tr: <p>Kurulu ve kullanılabilir paketleri ararken lütfen beklemede kalın.</p><p><strong>Not:</strong> Bu, çalışan bir internet bağlantısı gerektirir ve özellikle bir veya daha fazla deponun geçici olarak kullanılamaması durumunda biraz zaman alabilir.</p>

source: Status
ar: الحالة
ru: Состояние
tr: Durum

source: <p>Packages marked with an RKWard icon in this column provide enhancements to RKWard, typically in the form of additional graphical dialogs.</p>
ar: <p>الحزم المميزة بأيقونة أر كي وارد في هذا العمود توفر تحسينات لـ أر كي وارد، عادةً على شكل حوارات رسومية إضافية.</p>
ru: <p>Пакеты, отмеченные значком RKWard в этом столбце, расширяют возможности RKWard (как правило, они предоставляют дополнительные графические диалоги).</p>
tr: <p>Bu sütunda RKWard simgesiyle imlenen paketler, genellikle ek grafik iletişim kutuları ile RKWard’a yönelik geliştirmeler sağlar.</p>

source: <p>You can select packages for installation / removal by checking / unchecking the corresponding boxes in this column.</p>
ar: <p>يمكنك تحديد الحزم للتثبيت / الإزالة عن طريق تحديد / إلغاء تحديد المربعات المقابلة في هذا العمود.</p>
ru: <p>Пакеты для установки или удаления можно выбрать путём установки или снятия соответствующих флажков в этом столбце.</p>
tr: <p>Bu sütundaki ilgili kutuları işaretleyerek/işaretlerini kaldırarak kurulum/kaldırma için paketleri seçebilirsiniz.</p>

source: <p>The name of the package.</p>
ar: <p>اسم الحزمة.</p>
ru: <p>Имя пакета.</p>
tr: <p>Paketin adı.</p>

source: <p>A descriptive title for the package. Currently this is not available for packages in non-local repositories.</p>
ar: <p>عنوان وصفي للحزمة. هذا غير متاح حاليًا للحزم في المستودعات غير المحلية.</p>
ru: <p>Описательное название пакета. В настоящее время доступно только для пакетов в локальных репозиториях.</p>
tr: <p>Paket için açıklayıcı bir başlık. Şu anda bu, yerel olmayan depolardaki paketler için bulunmaz.</p>

source: <p>Installed and / or available version of the package</p>
ar: <p>الإصدار المثبت و / أو المتاح للحزمة</p>
ru: <p>Установленная и / или доступная версия пакета</p>
tr: <p>Paketin kurulu veya kullanılabilen sürümü</p>

source: <p>Location where the package is installed / available</p>
ar: <p>الموقع الذي تثبتت / تتوفر فيه الحزمة</p>
ru: <p>Расположение, где установлен или доступен пакет</p>
tr: <p>Paketin kurulu veya kullanılabildiği konum</p>

source: Updateable Packages
ar: حزم قابلة للتحديث
ru: Доступные обновления
tr: Güncellenebilir Paketler

source: Packages for which an update is available. This may include packages which were merely built against a newer version of R.
ar: الحزم التي يتوفر لها تحديث. قد يشمل هذا الحزم التي بُنيت فقط مقابل إصدار أحدث من R.
ru: Пакеты, для которых доступно обновление. Сюда могут входить те пакеты, которые просто были собраны для новой версии R.
tr: Kullanılabilir güncelleştirmeleri olan paketler. Bu, yalnızca R’nin daha yeni bir sürümüne göre yapılı paketleri içerebilir.

source: New Packages
ar: حزم جديدة
ru: Новые пакеты
tr: Yeni Paketler

source: Packages which are available for installation, but which are not currently installed.
ar: حزم متوفرة للتثبيت، ولكنها غير مثبتة حاليًا.
ru: Пакеты, которые доступны для установки, но в настоящее время не установлены.
tr: Kurulabilen; ancak şu anda kurulu olmayan paketler

source: Installed Packages
ar: الحزم المثبّتة
ru: Установленные пакеты
tr: Kurulu Paketler

source: Packages which are installed locally. Note that updates may be available for these packages.
ar: حزم مثبتة محليًا. لاحظ أن التحديثات قد تكون متاحة لهذه الحزم.
ru: Пакеты, которые установлены локально. Обратите внимание, что для этих пакетов могут быть доступны обновления.
tr: Yerel olarak kurulu paketler. Bu paketler için güncellemeler olabileceğini aklınızda bulundurun.

source: Install
ar: ثبّت
ru: Установить
tr: Kur

source: Remove
ar: أزل
ru: Удалить
tr: Kaldır

source: Installed plugin groups (.pluginmap files)
ar: مجموعات الإضافات المثبتة (ملفات .pluginmap)
ru: Установленные группы модулей (файлы .pluginmap)
tr: Kurulu eklenti grupları (.pluginmap dosyaları)

source: Context:
ar: السّياق:
ru: Контекст:
tr: Bağlam:

source: Crash recovery file detected
ar: اكتشف ملف استرداد الأعطال
ru: Обнаружен файл для восстановления при сбое
tr: Çökme kurtarma dosyası algılandı

source: <p>It looks like RKWard has crashed, recently. We are sorry about that! However, not everything is lost, and with a bit of luck, your data has been saved in time.</p>
ar: <p>يبدو أن أر كي وارد عطل مؤخرًا. نعتذر عن ذلك! ومع ذلك، لم يضع كل شيء، و مع قليل من الحظ، حفظت بياناتك في الوقت المناسب.</p>
ru: <p>Похоже, недавно произошёл сбой RKWard. Но не всё потеряно; скорее всего, данные удалось вовремя сохранить.</p>
tr: <p>Görünüşe göre RKWard yakın zamanda çöktü. Bunun için üzgünüz! Ancak her şey kaybolduğunu söylemek için biraz erken ve azıcık da şansın yardımıyla veriniz zamanında kaydedilmiş olmalı.</p>

source: <p>A workspace recovery file exists, dating from <i>%2</i>.</p>
ar: <p>يوجد ملف استرداد مساحة عمل، يعود تاريخه إلى <i>%2</i>.</p>
ru: <p>Имеются файлы восстановления рабочей области (%1), самый последний от <i>%2</i>.</p>
tr: <p><i>%2</i> tarihli 1 çalışma alanı kurtarma dosyası var.</p>

source: <p>Do you want to open this file, now, save it for later (as <i>%1</i>), or discard it?</p>
ar: <p>هل تريد فتح هذا الملف الآن، أم حفظه لوقت لاحق (مثل <i>%1</i>)، أم تجاهله؟</p>
ru: <p>Открыть файл прямо сейчас, сохранить его для открытия в дальнейшем (как <i>%1</i>) или отбросить его?</p>
tr: <p>Bu dosyayı şimdi açmak mı, daha sonrası için kaydetmek mi (<i>%1</i> olarak) veya atmak mı istiyorsunuz?</p>

source: Recover
ar: استعد
ru: Восстановить
tr: Kurtar

source: Saves the recovery file(s), and opens it (or the most recent one)
ar: يحفظ ملف (ملفات) الاسترداد، ويفتحه (أو الأحدث)
ru: Сохраняет файлы восстановления и открывает их (или самый последний файл)
tr: Kurtarma dosyasını/dosyalarını kaydeder ve onu (veya en yenisini) açar

source: Save for later
ar: احفظ لوقت لاحق
ru: Сохранить на потом
tr: Sonrası için Kaydet

source: Saves the recovery file(s) for later use, but does not open it
ar: يحفظ ملف (ملفات) الاسترداد لاستخدامه لاحقًا، ولكنه لا يفتحه
ru: Сохраняет файлы восстановления для использования в дальнейшем, но не открывает их
tr: Kurtarma dosyasını/dosyalarını daha sonra kullanmak üzere kaydeder; ancak açmaz

source: Delete
ar: احذف
ru: Удалить
tr: Sil

source: Deletes the recovery file(s)
ar: يحذف ملف (ملفات) الاسترداد
ru: Удаляет файлы восстановления
tr: Kurtarma dosya(larını) siler

source: You are about to delete the recovery file %2. There will be no way to bring it back. Really delete it?
ar: أنت على وشك حذف ملف الاسترداد %2. لن تكون هناك طريقة لاستعادته. هل تريد حذفه حقًا؟
ru: Будут удалены файлы восстановления (%1, последний — %2). Это действие нельзя отменить. Продолжить?
tr: %2 kurtarma dosyasını silmek üzeresiniz. Onu geri getirmenin hiçbir yolu olmayacak. Gerçekten silinsin mi?

source: Really delete recovery file(s)?
ar: هل تريد حذف ملف (ملفات) الاسترداد حقًا؟
ru: Удалить файлы восстановления?
tr: Kurtarma Dosyalarını Gerçekten Sil?

source: Save modified
ar: احفظ ما عُدل
ru: Сохранить изменённые
tr: Değiştirileni Kaydet

source: The following items have been modified. Do you want to save them before closing?
ar: عدلت العناصر التالية. هل تريد حفظها قبل الإغلاق؟
ru: Следующие записи были изменены. Сохранить их перед закрытием?
tr: Aşağıdaki ögeler değiştirildi. Kapatmadan önce bunları kaydetmek istiyor musunuz?

source: R Workspace (Data and Functions)
ar: مساحة عمل R (البيانات والدوال)
ru: Рабочая область R (данные и функции)
tr: R Çalışma Alanı (Veri ve İşlevler)

source: [Not saved]
ar: [لم يحفظ]
ru: [Не сохранено]
tr: [Kaydedilmedi]

source: Output files
ar: ملفات الإخراج
ru: Файлы вывода
tr: Çıktı Dosyaları

source: Scripts
ar: السّكربتات
ru: Сценарии
tr: Betikler

# Save the selected items
source: Save selected
ar: احفظ المحدد
ru: Сохранить выбранные
tr: Seçiliyi Kaydet

source: Discard all
ar: أهمل الكلّ
ru: Отменить все
tr: Tümünü At

source: Do not close
ar: لا تغلق
ru: Не закрывать
tr: Kapatma

source: <b>Select one or more:</b>
ar: <b>حدد واحدًا أو أكثر:</b>
ru: <b>Выберите один или несколько вариантов:</b>
tr: <b>Birini veya daha fazlasını seçin:</b>

source: <b>Select one:</b>
ar: <b>حدد واحدًا:</b>
ru: <b>Выберите один вариант:</b>
tr: <b>Birini seçin:</b>

source: Show problem details
ar: أظهر تفاصيل المشكلة
ru: Показать подробные сведения о проблеме
tr: Sorun ayrıntılarını göster

source: RKWard <b>failed to detect an R installation</b> on this system
ar: <b>فشل أر كي وارد في اكتشاف تثبيت R</b> على هذا النظام
ru: RKWard <b>не удалось обнаружить установленный дистрибутив R</b> в этой системе
tr: RKWard, bu sistemde bir <b>R kurulumu algılayamadı</b>

source: RKWard is currently using the R installation at <nobr>%1</nobr>.
ar: يستخدم أر كي وارد حاليًا تثبيت R في <nobr>%1</nobr>.
ru: RKWard сейчас использует следующее расположение дистрибутива R: <nobr>%1</nobr>.
tr: RKWard şu anda <nobr>%1</nobr> konumundaki R kurulumunu kullanıyor.

source: <b>R backend has failed to start.</b>
ar: <b>فشلت الخلفية R في البدء.</b>
ru: <b>Не удалось запустить серверное приложение R.</b>
tr: <b>R arka ucu başlatılamadı.</b>

source: <b>R backend has crashed.</b>
ar: <b>عطلت الخلفية R.</b>
ru: <b>Сбой серверного приложения R.</b>
tr: <b>R arka ucu çöktü.</b>

source: <b>R version %1 started, successfully.</b>
ar: <b>بدأ الإصدار %1 من R بنجاح.</b>
ru: <b>Успешно выполнен запуск R версии %1.</b>
tr: <b>R sürüm %1, başarıyla başlatıldı.</b>

source: <p>You are using the R version bundled inside the RKWard AppImage.</p><p>This version comes with several technical limitations. Importantly, you will not be able to install most R addon packages. In general, it is therefore recommended to select a system-installed version of R, instead, below.</p>
ar: <p>أنت تستخدم إصدار R المرفق داخل صورة تطبيق أر كي وارد (AppImage).</p><p>يأتي هذا الإصدار بعدة قيود تقنية. الأهم من ذلك، لن تتمكن من تثبيت معظم حزم R الإضافية. بشكل عام، يوصى بالتالي بتحديد إصدار R مثبت على النظام، بدلاً من ذلك، أدناه.</p>
ru: <p>Используется версия R из пакета AppImage RKWard.</p><p>Эта версия имеет несколько технических ограничений. Важным является отсутствие возможности установить большинство пакетов дополнений R. Следовательно, рекомендуется выбрать ниже установленную в системе версию R.</p>
tr: <p>Şu anda RKWard AppImage’i içinde gelen R sürümünü kullanıyorsunuz.</p><p>Bu sürüm, bilinen birkaç teknik sınırlama içerir. En önemlisi olarak, çoğu R eklentisi paketlerini kuramayacaksınız. Genelde bunun yerine, sistem geneline kurulu bir R kurulumunu seçmeniz önerilir.</p>

source: <b>Waiting for R backend...</b>
ar: <b>في انتظار الخلفية R...</b>
ru: <b>Ожидание данных от серверного приложения R…</b>
tr: <b>R arka ucu bekleniyor…</b>

source: Select another R executable
ar: حدد ملف R تنفيذي آخر
ru: Использовать другой исполняемый файл R
tr: Başka bir R yürütülebiliri seç

source: Select R executable
ar: حدد ملف R تنفيذي
ru: Выбор исполняемого файла R
tr: R Yürütülebiliri Seç

source: Use R at %1
ar: استخدم R في %1
ru: Использовать R в %1
tr: %1 konumundaki R’yi kullan

source: Use R at:
ar: استخدم R في:
ru: Использовать R в:
tr: Şuradaki R’yi kullan:

source: Attempt to restart R at %1
ar: حاول إعادة تشغيل R في %1
ru: Попробовать перезапустить R в %1
tr: %1 konumundaki R’yi yeniden başlatmayı dene

source: Keep current version (%1)
ar: احتفظ بالإصدار الحالي (%1)
ru: Оставить текущую версию (%1)
tr: Geçerli sürümü tut (%1)

source: No action needed.
ar: لا حاجة لاتخاذ إجراء.
ru: Дополнительные действия не требуются.
tr: Gereken eylem yok.

source: Not installed
ar: غير مثبّت
ru: Не установлено
tr: Kurulu değil

source: Install %1
ar: ثبّت %1
ru: Установить %1
tr: Kur: %1

source: (Attempt to) install the package %1 and its dependencies for this version of R. In most cases, this requires a working internet connection.
ar: (حاول) تثبيت الحزمة %1 وتبعياتها لهذا الإصدار من R. في معظم الحالات، يتطلب هذا اتصال إنترنت عامل.
ru: (Попытаться) установить пакет %1 и его зависимости для этой версии R. В большинстве случаев для этого необходимо работающее интернет-соединение.
tr: R’nin bu sürümü için %1 paketini ve bağımlılıklarını kurmayı deneyin. Çoğu durumda, bunun için çalışan bir internet bağlantısı gerekir.

source: No change
ar: لا تغيير
ru: Без изменений
tr: Değişiklik yok

source: Proceed without the package. You will again be given the option to install the package, when the package is needed.
ar: تابع بدون الحزمة. ستمنح خيار تثبيت الحزمة مرة أخرى، عندما تحتاج الحزمة.
ru: Продолжить без этого пакета. Предложение об установке появится снова, когда он понадобится.
tr: Paket olmadan sürdürün. Pakete gereksinim duyulduğunda size paketi yeniden kurma seçeneği sunulacak.

source: Installed
ar: مثبّتة
ru: Установлено
tr: Kurulu

source: Mark %1 for installation (actual installation is not yet supported, but you will be prompted with a link to a download page at the last page of this dialog)
ar: ضع علامة على %1 للتثبيت (التثبيت الفعلي غير مدعوم بعد، ولكن ستطالب برابط لصفحة تنزيل في الصفحة الأخيرة من هذا الحوار)
ru: Отметить %1 для установки (фактическая установка ещё не поддерживается, но на последней странице этого диалога будет ссылка на страницу загрузки)
tr: Kurulum için %1 seçeneğini işaretleyin (gerçek kurulum henüz desteklenmiyor; ancak bu iletişim kutusunun son sayfasında bir indirme sayfasına yönlendiren bir bağlantı sağlanacaktır)

source: Proceed without %1. You will be missing some functionality.
ar: تابع بدون %1. ستفقد بعض الوظائف.
ru: Продолжить без %1. Будут отсутствовать некоторые функциональные возможности.
tr: %1 olmadan sürdürün. Bazı işlevsellikler kullanılamayacaktır.

source: Not found
ar: لم يُعثر عليه
ru: Не найдено
tr: Bulunamadı

source: RKWard Setup Assistant
ar: مساعد إعداد أر كي وارد
ru: Помощник по настройке RKWard
tr: RKWard Kurulum Yardımcısı

source: <p>This dialog will guide you through a quick check of the basic setup of the required (or recommended) components.</p>
ar: <p>هذا الحوار سيدلك خلال فحص سريع للإعداد المبدئي للمكونات المطلوبة (أو الموصى بها).</p>
ru: <p>Этот диалог поможет быстро проверить базовые параметры настройки необходимых (или рекомендуемых) компонентов.</p>
tr: <p>Bu iletişim kutusu, gerekli (veya önerilen) bileşenlerin temel kurulumunun hızlı bir şekilde denetlenmesinde size yol gösterecektir.</p>

source: <p>The setup assistant has been invoked, automatically, because a new version of RKWard has been detected.</p>
ar: <p>استدعي مساعد الإعداد، آليًا، لاكتشاف إصدار جديد من أر كي وارد.</p>
ru: <p>Выполнен автоматический вызов помощника по настройке, так как обнаружена новая версия RKWard.</p>
tr: <p>RKWard’ın yeni bir sürümü algılandığından kurulum yardımcısı kendiliğinden çağrıldı.</p>

source: <p>The setup assistant has been invoked, automatically, because a new version of R has been detected.</p>
ar: <p>استدعي مساعد الإعداد، آليًا، لاكتشاف إصدار جديد من R.</p>
ru: <p>Выполнен автоматический вызов помощника по настройке, так как обнаружена новая версия R.</p>
tr: <p>R’nin yeni bir sürümü algılandığından kurulum yardımcısı kendiliğinden çağrıldı.</p>

source: Basic installation
ar: تثبيت مبدئي
ru: Базовая установка
tr: Temel kurulum

source: Installation directory
ar: مجلد التثبيت
ru: Каталог установки
tr: Kurulum dizini

source: Not found.
ar: لم يُعثر عليه.
ru: Не найдено.
tr: Bulunamadı

source: Reinstallation required
ar: إعادة تثبيت مطلوبة
ru: Требуется переустановка
tr: Yeniden kurulum gerekiyor

source: This problem cannot be corrected, automatically. You will have to reinstall RKWard.
ar: لا يمكن تصحيح هذه المشكلة، آليًا. يجب عليك إعادة تثبيت أر كي وارد.
ru: Эту проблему нельзя исправить автоматически. Необходимо переустановить RKWard.
tr: Bu sorun kendiliğinden düzeltilemiyor. RKWard’ı yeniden kurmanız gerekecek.

source: Found.
ar: عثر عليه.
ru: Найдено.
tr: Bulundu

source: RKWard plugins
ar: إضافات أر كي وارد
ru: Модули RKWard
tr: RKWard eklentileri

source: <p>No plugins are enabled. This is probably not intended.</p>
ar: <p>لم تفعل أي إضافات. ربما لم يقصد هذا.</p>
ru: <p>Включённых модулей нет. Вероятно, это не планировалось.</p>
tr: <p>Hiçbir eklenti etkin değil. Bu, büyük olasılıkla amaçlanan bir şey değildi.</p>

source: None selected
ar: غير المحدد
ru: Ничего не выбрано
tr: Seçili yok

source: Restore defaults
ar: استعد المبدئيات
ru: Восстановить значения по умолчанию
tr: Öntanımlıları geri yükle

source: Enable the default plugins
ar: فعل الإضافات المبدئية
ru: Включить стандартные модули
tr: Öntanımlı eklentileri etkinleştirin

source: Proceed without plugins
ar: تابع بدون إضافات
ru: Продолжить без модулей
tr: Eklentiler olmadan sürdür

source: Kate plugins
ar: إضافات Kate
ru: Модули Kate
tr: Kate eklentileri

source: <p>Important functionality in RKWard is provided by kate plugins. It looks like none are installed on this system. On Linux/BSD, this can usually be fixed by installing kate.</p>
ar: <p>تُوفَّر وظائف هامة في أر كي وارد بواسطة إضافات (plugins) لـ kate. يبدو أنه ما من إضافة مثبتة على هذا الحاسوب. على أنظمة Linux/BSD، يُمكِن عادةً إصلاح هذا عن طريق تثبيت kate.</p>
ru: <p>Важные функциональные возможности RKWard реализованы на основе модулей Kate. Похоже, что они не установлены в этой системе. При работе в Linux/BSD такую ситуацию обычно можно исправить путём установки Kate.</p>
tr: <p>RKWard’daki önemli sayıda işlevsellik Kate eklentileri tarafından sağlanır. Bu sistemde hiçbiri kurulu değil gibi görünüyor. Bunu genellikle Linux/BSD’de Kate’i kurarak düzeltebilirsiniz.</p>

source: None found
ar: لم يُعثر على أي شيء
ru: Ничего не найдено
tr: Bir şey bulunamadı

source: Found %1 plugin.
ar: عثر على %1 إضافة.
ru: Найден %1 модуль.
tr: %1 eklenti bulundu.

source: Pre 0.7.3 output file
ar: ملف إخراج ما قبل 0.7.3
ru: Файл вывода версии ниже 0.7.3
tr: 0.7.3 öncesi çıktı dosyası

source: Exists
ar: موجود
ru: Существует
tr: Var

source: Import
ar: استورد
ru: Импорт
tr: İçe aktar

source: Import to the session, so you can save in the new output format.
ar: استورد إلى الجلسة، كي تستطيع الحفظ بصيغة الإخراج الجديدة.
ru: Импортировать в сеанс, чтобы сохранить в новом выходном формате.
tr: Oturuma içe aktarın, böylece yeni çıktı biçiminde kaydedebilirsiniz.

source: No action
ar: لا إجراء
ru: Ничего не делать
tr: Eylem yok
