Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: <p><b>Where should I report bugs or wishes?</b></p><p>Thank you for taking the time to help improve RKWard. To help us handle your request, efficiently, please submit your bug reports or wishes in the <a href="%1">KDE bugtracking system</a>. Note that you need a user account for this, so that we will be able to contact you, for follow-up questions. <b>If you do not have an account, please <a href="%2">create one</a>, first.</b></p><p>In case this is not possible for some reason, refer to <a href="%3">%3</a> for alternative ways of reporting issues.</p>
ar: <p><b>أين أبلغ عن الأخطاء أو الرغبات؟</b></p><p>نشكرك على تخصيص وقتك للمساعدة في تحسين أر كي وارد. لمساعدتنا في معالجة طلبك بكفاءة، الرجاء إرسال تقارير الأخطاء أو الرغبات الخاصة بك في <a href="%1">نظام تتبع الأخطاء في كيدي</a>. لاحظ أنك تحتاج إلى حساب مستخدم لهذا، حتى نتمكن من الاتصال بك لأسئلة المتابعة. <b>إذا لم يكن لديك حساب، فالرجاء <a href="%2">إنشاء واحد</a> أولاً.</b></p><p>في حال تعذر ذلك لسبب ما، ارجع إلى <a href="%3">%3</a> لطرق بديلة للإبلاغ عن المشكلات.</p>
ru: <p><b>Куда отправлять отчёты об ошибках или пожелания?</b></p><p>Спасибо, что помогаете сделать программу RKWard лучше. Чтобы разработчики могли эффективно поработать с вашим запросом, воспользуйтесь <a href="%1">системой отслеживания ошибок KDE</a>. Обратите внимание, что для этого потребуется учётная запись пользователя (чтобы разработчики смогли связаться с вами, если потребуется что-либо уточнить). <b>Если у вас нет такой учётной записи, то сначала <a href="%2">создайте её</a>.</b></p><p>В том случае, если это невозможно сделать по каким-либо причинам, обратитесь к разделу <a href="%3">%3</a>, чтобы узнать об альтернативных способах отправки отчётов об ошибках.</p>
tr: <p><b>Hataları veya istekleri nereye bildirmeliyim?</b></p><p>RKWard’ı geliştirmeye yardımcı olmak üzere zaman ayırdığınız için teşekkür ederiz. İsteğinizi verimli bir şekilde ele almamıza yardımcı olmak için lütfen hata raporlarınızı veya dileklerinizi <a href="%1">KDE hata izleme sistemine</a> gönderin. Sonrasında sorularımız olursa sizinle iletişime geçebilmemiz için bir kullanıcı hesabına gereksiniminiz olduğunu unutmayın. <b>Eğer bir hesabınız yoksa öncelikle lütfen <a href="%2">bir tane</a> oluşturun.</b></p><p>Bir nedenden dolayı bu olanaklı değilse hata bildirmenin alternatif yolları için lütfen <a href="%3">%3</a> sayfasına bakın.</p>

source: <p><b>What information should I provide, and how?</b></p>Clicking "Report issue" will take you to the KDE bugtracking system. After logging in, some information will already be pre-filled into the report form. Please make sure to fill in the missing bits - in English - where indicated, especially in the "Comment" field.</p>
ar: <p><b>ما المعلومات التي ينبغي أن أقدمها، وكيف؟</b></p>النقر على "الإبلاغ عن المشكلة" سينقلك إلى نظام تتبع الأخطاء في كيدي. بعد تسجيل الدخول، ستكون بعض المعلومات مملوءة مسبقًا في نموذج التقرير. الرجاء التأكد من ملء الأجزاء المفقودة - باللغة الإنجليزية - حيث يشار إليها، خاصة في حقل "التعليق".</p>
ru: <p><b>Какую информацию следует предоставить и каким образом?</b></p>Нажатие кнопки «Сообщить об ошибке» позволяет перейти в систему отслеживания ошибок KDE. После входа в эту систему форма отчёта уже будет частично заполнена. Заполните остальные поля необходимыми данными (на английском), уделяя особое внимание полю «Комментарий».</p>
tr: <p><b>Hangi bilgileri, nasıl sağlamalıyım?</b></p>“Hata Bildir”e tıklamak sizi KDE hata izleme sistemine götürecektir. Giriş yaptıktan sonra bazı bilgiler rapor formuna önceden doldurulmuş olur. Lütfen, özellikle “Comment” alanında, belirtilen yerlerde eksik kısımları—İngilizce olarak—doldurduğunuzdan emin olun.</p>

source: Report issue
ar: أبلغ عن مشكلة
ru: Сообщить об ошибке
tr: Hata Bildir

source: Forwarding you to the KDE bugtracking system
ar: يحوّل إلى نظام تتبع الأخطاء في كيدي
ru: Переход к системе отслеживания ошибок KDE
tr: Sizi KDE hata izleme sistemine yönlendiriyoruz

source: You are now being forwarded to the KDE bugtracking system. Should you continue to see this page for more than a few seconds (e.g. if JavaScript is disabled), please click "Proceed", below.
ar: جافاسكربت تحوّل إلى نظام تتبع الأخطاء في كيدي. إذا واصلت رؤية هذه الصفحة لأكثر من بضع ثوان (على سبيل المثال، إذا جرى تعطيل جافاسكربت)، فالرجاء النقر على "متابعة"، أدناه.
ru: Выполняется переход к системе отслеживания ошибок KDE. Если эта страница не исчезнет через несколько секунд (такое возможно, например, при отключении JavaScript), нажмите «Продолжить» ниже.
tr: Şimdi KDE hata izleme sistemine yönlendiriliyorsunuz. Bu sayfayı birkaç saniyeden daha uzun süre görüyorsanız (örneğin, JavaScript devre dışıysa) lütfen aşağıdaki “Sürdür” düğmesine tıklayın.

source: Proceed
ar: متابعة
ru: Продолжить
tr: Sürdür

source: Show Details
ar: أظهر التّفاصيل
ru: Показать подробности
tr: Ayrıntıları Göster

source: Report As Bug
ar: أبلغ كخطأ
ru: Сообщить об ошибке
tr: Hata Olarak Bildir

source: Message code: %1
ar: رمز الرسالة: %1
ru: Код сообщения: %1
tr: İleti kodu: %1

source: ---Problem description--- Please fill in the missing bits *in English*.
ar: ---وصف المشكلة--- الرجاء ملء الأجزاء المفقودة *باللغة الإنجليزية*.
ru: ---Описание проблемы--- Укажите недостающую информацию *на английском языке*.
tr: ---Sorunun Açıklaması--- Lütfen eksik bölümleri *İngilizce* doldurun.

source: Please give a brief summary on the problem: ###Please fill in###
ar: الرجاء تقديم ملخص موجز للمشكلة: ###الرجاء ملء هذا الحقل###
ru: Кратко резюмируйте проблему: ###Укажите необходимую информацию###
tr: Lütfen sorunla ilgili kısa bir özet verin: ###Lütfen doldurun###

source: I encountered the error message quoted below. Additionally, I saw the following symptoms: ###Please fill in (if applicable)###
ar: صادفت رسالة الخطأ المقتبسة أدناه. بالإضافة إلى ذلك، رأيت الأعراض التالية: ###الرجاء ملء هذا الحقل (إذا انطبق)###
ru: Появилось приведённое ниже сообщение об ошибке. Кроме того, наблюдалось следующее: ###Укажите необходимую информацию (если применимо)###
tr: Aşağıda alıntılanan hata iletisiyle karşılaştım. Ayrıca şu belirtileri de gördüm: ###Lütfen doldurun (varsa)###

source: What - in detail - did you do directly before you encountered this problem? ###Please fill in###
ar: ماذا - بالتفصيل - فعلت قبل أن تصادف هذه المشكلة مباشرة؟ ###الرجاء ملء هذا الحقل###
ru: Что делалось непосредственно перед появлением проблемы (приведите подробности)? ###Укажите необходимую информацию###
tr: Bu sorunla karşılaşmadan önce ayrıntılı olarak ne yaptınız? ###Lütfen doldurun###

source: When you try to repeat the above, does the problem occur again (no, sometimes, always)? ###Please fill in###
ar: عندما تحاول تكرار ما سبق، هل تحدث المشكلة مرة أخرى (لا، أحيانًا، دائمًا)؟ ###الرجاء ملء هذا الحقل###
ru: Возникает ли проблема снова при попытке повторить вышеперечисленное (нет, иногда, всегда)? ###Укажите необходимую информацию###
tr: Yukarıdakileri yeniden yapmaya çalıştığınızda sorun yeniden mi oluşuyor (hayır, bazen, her zaman)? ###Lütfen doldurun###

source: If applicable: When doing the same thing in an R session outside of RKWard, do you see the same problem? ###Please fill in###
ar: إذا انطبق: عند القيام بالشيء نفسه في جلسة R خارج أر كي وارد، هل ترى المشكلة نفسها؟ ###الرجاء ملء هذا الحقل###
ru: Если применимо: возникает ли та же проблема при выполнении тех же действий в сеансе R вне RKWard? ###Укажите необходимую информацию###
tr: Geçerliyse: Aynı şeyi RKWard dışındaki bir R oturumunda yaparken de aynı sorunu görüyor musunuz? ###Lütfen doldurun###

source: Do you have any further information that might help us to track this problem down? In particular, if applicable, can you provide sample data and sample R code to reproduce this problem? ###Please fill in###
ar: هل لديك أي معلومات إضافية قد تساعدنا في تتبع هذه المشكلة؟ على وجه الخصوص، إذا انطبق، هل يمكنك توفير بيانات عينة ورمز R عينة لإعادة إنتاج هذه المشكلة؟ ###الرجاء ملء هذا الحقل###
ru: Имеется ли другая информация, которая может помочь в решении проблемы? В частности, образец данных и образец кода R для воспроизведения проблемы (если применимо)? ###Укажите необходимую информацию###
tr: Bu sorunun izini sürmemize yardımcı olabilecek başka bilginiz var mı? Özellikle, olanaklıysa bu sorunu yeniden oluşturmak için örnek veri ve örnek R kodu sağlayabilir misiniz? ###Lütfen doldurun###

source: RKWard is available in many different packagings, and sometimes problems are specific to one method of installation. How did you install RKWard (which file(s) did you download)? ###Please fill in###
ar: يتوفر أر كي وارد في العديد من التعبئات المختلفة، وأحيانًا تكون المشكلات خاصة بطريقة تثبيت واحدة. كيف ثبّت أر كي وارد (ما الملف(الملفات) التي نزّلتها)؟ ###الرجاء ملء هذا الحقل###
ru: Программа RKWard может работать на различных платформах на основе разных способов установки. Иногда проблемы касаются только одного из них. Как выполнялась установка RKWard (какие файлы были загружены)? ###Укажите необходимую информацию###
tr: RKWard birçok farklı pakette kullanılabilir ve bazen sorunlar tek bir kurulum yöntemine özgüdür. RKWard’ı nasıl kurdunuz (hangi dosyaları indirdiniz)? ###Lütfen doldurun###

source: Please stand by while gathering some information on your setup. In case the backend has died or hung up, you may want to press 'Cancel' to skip this step.
ar: الرجاء الانتظار أثناء جمع بعض المعلومات حول إعدادك. في حال توقف الواجهة الخلفية عن العمل أو تعطلها، قد ترغب في الضغط على 'إلغاء' لتخطي هذه الخطوة.
ru: Подождите, выполняется сбор сведений о вашей системе. Если серверное приложение прекратило работу или не отвечает, можно нажать кнопку «Отмена» для пропуска этого шага.
tr: Kurulumunuzla ilgili bazı bilgileri toplarken lütfen bekleyin. Arka ucun devre dışı kalması veya kapatılması durumunda bu adımı atlamak için “İptal”e basmak isteyebilirsiniz.

source: Gathering setup information
ar: يجمع معلومات الإعداد
ru: Сбор информации о настройке
tr: Kurulum Bilgileri Toplanıyor

source: Import Data Assistant
ar: مساعد استيراد البيانات
ru: Помощник по импорту данных
tr: Veri İçe Aktarma Yardımcısı

source: For certain formats, RKWard provides specialized import dialogs, and those generally provide the most options. Is the file you wish to import in one of the following formats?
ar: لبعض التنسيقات، يوفر أر كي وارد حوارات استيراد متخصصة، وتوفر تلك الحوارات عمومًا معظم الخيارات. هل الملف الذي ترغب في استيراده في أحد التنسيقات التالية؟
ru: Для некоторых форматов данных в RKWard предусмотрены особые диалоги импорта (обычно в них больше всего параметров настройки). Планируется импортировать данные в одном из указанных ниже форматов?
tr: Belirli biçimler için RKWard özel içe aktarma iletişim kutuları sağlar ve bunlar genellikle en fazla seçeneği sunarlar. İçe aktarmak istediğiniz dosya aşağıdaki biçimlerden birine mi ait?

source: RKWard comes with several import dialogs, but none seem to be loaded, at present. Check your settings.
ar: يأتي أر كي وارد بالعديد من حوارات الاستيراد، ولكن لا يبدو أن أيًا منها محمل الآن. راجع إعداداتك.
ru: В RKWard предусмотрены несколько диалогов импорта, но ни один из них сейчас не загружен. Проверьте параметры настройки.
tr: RKWard birkaç içe aktarma iletişim kutusuyla birlikte gelir; ancak şu anda hiçbiri yüklü görünmüyor. Ayarlarınızı denetleyin.

source: None of the above / try another method
ar: لا شيء مما سبق / جرب طريقة أخرى
ru: Не подходит ничего из вышеперечисленного / попробовать другой способ
tr: Yukarıdakilerden hiçbiri/Başka yöntem dene

source: Select format
ar: حدد التنسيق
ru: Выбрать формат
tr: Biçim seç

source: The 'rio' package offers generic support for importing many different file formats, but requires a number of additional R packages to be installed (you will be prompted for missing packages). Do you want to give that a try?
ar: توفر حزمة 'rio' دعمًا عامًا لاستيراد العديد من تنسيقات الملفات المختلفة، ولكنها تتطلب تثبيت عدد من حزم R الإضافية (ستطالب بالحزم المفقودة). هل تريد أن تجرب ذلك؟
ru: Пакет «rio» предоставляет общую поддержку импорта файлов в различных форматах, но для его установки требуется ряд дополнительных пакетов R (недостающие пакеты будет предложено установить). Попробовать этот пакет?
tr: “rio” paketi, birçok farklı dosya biçiminin içe aktarılması için genel destek sunar; ancak bir dizi ek R paketinin kurulmasını gerektirir (eksik paketler için uyarılacaksınız). Bunu denemek istiyor musunuz?

source: The generic import plugin (shipped with RKWard) is not presently loaded. Check your settings.
ar: إضافة الاستيراد العامة (المرفقة مع أر كي وارد) غير محملة الآن. راجع إعداداتك.
ru: Типовой модуль импорта (поставляется с RKWard) сейчас не загружен. Проверьте параметры настройки.
tr: Genel içe aktarma eklentisi (RKWard ile birlikte gelir) şu anda kurulu değil. Ayarlarınızı denetleyin.

source: Use 'rio'-based importer
ar: استخدم مستورد 'rio'
ru: Использовать средство импорта на основе rio
tr: “rio” tabanlı içe aktarıcıyı kullan

source: Try another method
ar: جرب طريقة أخرى
ru: Попробовать другой способ
tr: Başka bir yöntem dene

source: Generic 'rio'-based importer
ar: مستورد 'rio' العام
ru: Типовое средство импорта на основе rio
tr: Genel “rio” tabanlı içe aktarıcı

source: If your data is moderate in size, and you can open/view it in another application on your system, importing it from clipboard (copy and paste) may be viable.
ar: إذا كان حجم بياناتك معتدلاً، و يمكنك فتحها/عرضها في تطبيق آخر على نظامك، قد يكون استيرادها من الحافظة (انسخ والصق) قابلاً للتطبيق.
ru: Если размер данных не слишком велик и их можно открыть/просмотреть в другом установленном в системе приложении, то эти данные, возможно, получится импортировать из буфера обмена (скопировать и вставить).
tr: Verileriniz orta büyüklükteyse ve sisteminizdeki başka bir uygulamada açabiliyor/görüntüleyebiliyorsanız, panodan içe aktarmak (kopyala ve yapıştır) uygun olabilir.

source: Import from clipboard
ar: استورد من الحافظة
ru: Импорт из буфера обмена
tr: Panodan içe aktar

source: <b>Ready to go</b><p>Click "Finish" to start the selected import dialog, or "Back" to explore other options.</p>
ar: <b>جاهز للانطلاق</b><p>انقر على «إنهاء» لبدء حوار الاستيراد المحدد، أو «رجوع» لاستكشاف خيارات أخرى.</p>
ru: <b>Всё готово</b><p>Нажмите «Завершить» для запуска выбранного диалога импорта или «Назад» для просмотра других вариантов.</p>
tr: <b>Başlamaya hazırız</b><p>Seçili içe aktarma iletişim kutusunu başlatmak için “Son”a veya diğer seçenekleri keşfetmek için “Geri”ye tıklayın.</p>

source: Start import dialog
ar: ابدأ حوار الاستيراد
ru: Запустить диалог импорта
tr: İçe aktarma iletişim kutusunu başlat

source: No further import methods are available at this time. Things you can try, include: <ul><li>Check for the availability of additional import plugins</li><li>Save your data to a different format in the original application</li><li>Ask for advice on rkward@kde.org</li></ul>
ar: لا تتوفر طرق استيراد إضافية في هذا الوقت. الأشياء التي يمكنك تجربتها تتضمن: <ul><li>تحقق من توفر إضافات استيراد إضافية</li><li>احفظ بياناتك بتنسيق مختلف في التطبيق الأصلي</li><li>اطلب النصيحة على rkward@kde.org</li></ul>

source: No import method found
ar: لم يعثر على طريقة استيراد
ru: Не найден способ импорта
tr: İçe aktarma yöntemi bulunamadı

source: Configure Packages
ar: اضبط الحزم
ru: Настроить пакеты
tr: Paketleri Yapılandır

source: Load / Unload R packages
ar: حمّل / ألغِ تحميل حزم R
ru: Загрузить или выгрузить пакеты R
tr: R Paketlerini Yükle/Çıkar

source: Install / Update / Remove R packages
ar: ثبت / حدث / أزل حزم R
ru: Установка, обновление и удаление пакетов R
tr: R Paketlerini Kur/Güncelle/Kaldır

source: Manage RKWard Plugins
ar: أدر مكونات أر كي وارد الإضافية
ru: Настроить модули RKWard
tr: RKWard Eklentilerini Yönet

source: Closing will discard pending changes. Are you sure?
ar: الإغلاق سيلغي التغييرات المعلقة. هل أنت متأكد؟
ru: Закрытие приведёт к отмене ожидающих изменений. Продолжить?
tr: Kapatmak, bekleyen değişiklikleri silecektir. Emin misiniz?

source: Discard changes?
ar: ارفض التّغييرات
ru: Отменить изменения?
tr: Değişiklikleri At?

# @action:button
source: Do no close
ar: لا تغلق
ru: Не закрывать
tr: Kapatma

source: Package %1 at %2
ar: الحزمة %1 في %2
ru: Пакет %1 в %2
tr: %2 konumundaki %1 paketi

source: The following packages, which you have selected for removal, are essential to the operation of RKWard, and will not be removed. If you are absolutely sure, that you want to remove these packages, please do so on the R command line.
ar: الحزم التالية، التي حددتها للإزالة، ضرورية لعمل أر كي وارد، ولن تجرِ إزالتها. إذا كنت متأكدًا تمامًا من أنك تريد إزالة هذه الحزم، فالرجاء القيام بذلك على سطر أوامر R.
ru: Следующие пакеты, выбранные для удаления, необходимы для работы RKWard. Поэтому они не будут удалены. Если же эти пакеты абсолютно точно следует удалить, это можно сделать с помощью командной строки R.
tr: Kaldırmak üzere seçtiğiniz aşağıdaki paketler RKWard’ın çalışması için gereklidir ve kaldırılmayacaktır. Bu paketleri kaldırmak istediğinizden kesinlikle eminseniz lütfen bunu R komut satırından yapın.

source: Not removing certain packages
ar: لا يزيل حزمًا معينة
ru: Часть пакетов не будет удалена
tr: Bazı Paketler Kaldırılmıyor

source: Your current user permissions do not allow removing the following packages. These will be skipped.
ar: صلاحيات المستخدم الحالية لا تسمح بإزالة الحزم التالية. تجاهلها.
ru: С текущими правами пользователя удаление следующих пакетов невозможно. Они будут пропущены.
tr: Geçerli kullanıcı izinleriniz aşağıdaki paketlerin kaldırılmasına izin vermiyor. Bunlar atlanacak.

source: Insufficient user permissions
ar: أذونات مستخدم غير كافية
ru: У пользователя недостаточно прав
tr: Yetersiz Kullanıcı İzinleri

source: Your current user permissions do not allow removing the following packages. Do you want to skip these packages, or do you want to proceed with administrator privileges (you will be prompted for the password)?
ar: صلاحيات المستخدم الحالية لا تسمح بإزالة الحزم التالية. هل تريد تجاهلها، أم تريد المتابعة بصلاحيات المدير (سيُطلب منك كلمة السر)؟
ru: С текущими правами пользователя удаление следующих пакетов невозможно. Пропустить эти пакеты или продолжить с правами администратора (будет предложено ввести пароль)?
tr: Geçerli kullanıcı izinleriniz aşağıdaki paketlerin kaldırılmasına izin vermiyor. Bu paketleri atlamak mı istiyorsunuz yoksa yönetici ayrıcalıklarınızla sürdürmek mi istiyorsunuz (parola istenecektir)?

# @action:button
source: Become root
ar: كن جذر
ru: Работать от имени root
tr: Yetkili Kullanıcı Ol

# @action:button
source: Skip these packages
ar: تخطّ هذه الحزم
ru: Пропустить эти пакеты
tr: Bu Paketlera Atla

source: You are about to remove the following packages. Are you sure you want to proceed?
ar: أنت على وشك إزالة الحزم التالية. هل أنت متأكد من رغبتك في المتابعة؟
ru: Следующие пакеты будут удалены. Продолжить?
tr: Aşağıdaki paketleri kaldırmak üzeresiniz. Sürdürmek istediğinizden emin misiniz?

source: About to remove packages
ar: على وشك إزالة الحزم
ru: Удаление пакетов
tr: Paketler Kaldırılmak Üzere

source: Please stand by while removing selected packages
ar: انتظر ريثما تزيل الحزم المحددة
ru: Подождите, выполняется удаление выбранных пакетов
tr: Seçili paketler kaldırılırken lütfen bekleyin

source: Removing packages
ar: يزيل الحزم
ru: Удаление пакетов
tr: Paketler kaldırılıyor

source: Selected library location not writable
ar: موقع المكتبة المحدد غير قابل للكتابة
ru: Выбранное расположение библиотек недоступно для записи
tr: Seçili kitaplık konumu yazılabilir değil

source: <p>The directory you have selected for installation (%1) is not writable with your current user permissions.</p><p>Would you like to install to %2, instead (you can also press "Cancel" and use the "Configure Repositories"-button to set up a different directory)?</p>
ar: <p>المجلد الذي اخترته للتثبيت (%1) غير قابل للكتابة بصلاحيات المستخدم الحالية.</p><p>هل تريد التثبيت في %2، بدلاً من ذلك (يمكنك أيضًا الضغط على «إلغاء» واستخدام زر «اضبط المستودعات» لإعداد مجلد مختلف)؟</p>
ru: <p>Текущих прав пользователя недостаточно для записи в каталог, выбранный для установки (%1).</p><p>Выполнить установку в %2 (также можно нажать кнопку «Отмена» и воспользоваться кнопкой «Настроить репозитории» для указания другого каталога)?</p>
tr: <p>Kurulum için seçtiğiniz dizine (%1), şu anki kullanıcı izinlerinizle yazılamaz.</p><p>Bunun yerine %2 konumuna yüklemek ister misiniz (Ayrıca “İptal”e basıp “Depoları Yapılandır” seçeneğiyle başka bir dizin de ayarlanabilir)?</p>

source: <p>Alternatively, if you have access to an administrator account on this machine, you can use that to install the package(s), or you could change the permissions of '%1'. Sorry, automatic switching to Administrator is not yet supported in RKWard on Windows.</p>
ar: <p>بدلاً من ذلك، إذا كان لديك وصول إلى حساب مدير على هذا الحاسوب، يمكنك استخدامه لتثبيت الحزمة (الحزم)، أو يمكنك تغيير صلاحيات '%1'. عذرًا، التبديل الآلي إلى المدير غير مدعوم بعد في أر كي وارد على ويندوز.</p>
ru: <p>Либо, если у вас есть доступ к учётной записи администратора на этом компьютере, можно использовать её для установки пакетов (или измените права «%1»). К сожалению, автоматическое переключение на учётную запись администратора пока не поддерживается RKWard при работе в Windows.</p>
tr: <p>Alternatif olarak, bu makinede bir yönetici hesabına erişiminiz varsa paketleri kurmak için bunu kullanabilir veya “%1” izinlerini değiştirebilirsiniz. Ne yazık ki Windows’ta RKWard’da yönetici kipine geçiş henüz desteklenmiyor.</p>

source: Install to %1
ar: ثبّت في %1
ru: Установить в %1
tr: %1 Konumuna Kur

source: <p>Alternatively, if you are the administrator of this machine, you can try to install the packages as root (you'll be prompted for the root password).</p>
ar: <p>بدلاً من ذلك، إذا كنت مدير هذا الحاسوب، يمكنك محاولة تثبيت الحزم كجذر (root) (سيُطلب منك كلمة سر الجذر).</p>
ru: <p>Либо, если вы являетесь администратором этого компьютера, можно попробовать установить пакеты от имени root (будет предложено ввести пароль root).</p>
tr: <p>Alternatif olarak, eğer bu makinenin yöneticisiyseniz paketleri yönetici izinleriyle kurmayı deneyebilirsiniz (yönetici parolası istenecektir).</p>

source: Become root
ar: كن جذر
ru: Работать от имени root
tr: Yetkili Kullanıcı Ol

source: Please stand by while installing selected packages
ar: انتظر ريثما تثبت الحزم المحددة
ru: Подождите, выполняется установка выбранных пакетов
tr: Seçili paketler kurulurken lütfen bekleyin

source: Installing packages
ar: يثبّت الحزم
ru: Установка пакетов
tr: Paketler kuruluyor

source: Neither kdesu nor kdesudo could be found. To install as root, please install one of these packages.
ar: لم يعثر على kdesu ولا kdesudo. لتثبيت كجذر، ثبت إحدى هاتين الحزمتين.
ru: Не удалось найти ни kdesu, ни kdesudo. Для выполнения установки от имени root необходимо установить один из этих пакетов.
tr: Ne kdesu ne de kdesudo bulunamadı. Yönetici olarak kurulum yapmak için lütfen şu paketlerden birini kurun.

source: kdesu not found
ar: لم يعثر على kdesu
ru: Не удалось найти kdesu
tr: kdesu bulunamadı

source: Installed packages
ar: الحزم المثبّتة
ru: Установленные пакеты
tr: Kurulu paketler

source: Title
ar: العنوان
ru: Название
tr: Başlık

source: Version
ar: الإصدارة
ru: Версия
tr: Sürüm

source: Location
ar: المكان
ru: Расположение
tr: Konum

source: Load
ar: حمّل
ru: Загрузить
tr: Yükle

source: Unload
ar: لا تحمّل
ru: Выгрузить
tr: Çıkar

source: Loaded packages
ar: الحزم المحملة
ru: Загруженные пакеты
tr: Yüklü paketler

source: There has been an error while trying to load / unload packages. See transcript below for details
ar: حدث خطأ أثناء محاولة تحميل / إلغاء تحميل الحزم. انظر التسجيل أدناه للتفاصيل
ru: При попытке загрузки или выгрузки пакетов произошла ошибка (см. ниже)
tr: Paketleri yüklemeye/çıkarmaya çalışırken bir hata oluştu. Ayrıntılar için aşağıdaki yazıdökümüne bakın

source: Select all updates
ar: حدد جميع التحديثات
ru: Выбрать все обновления
tr: Tüm Güncellemeri Seç
