Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: <h1>Add-ons</h1><p>RKWard add-ons come in a variety of forms, each with their own configuration options:</p><h2>R packages</h2><p><a href="rkward://settings/rpackages">Add-ons to the R language itself</a>. These are usually downloaded from "CRAN". Some of these add-on packages may additionally contain RKWard plugins.</p><h2>RKWard plugins</h2><p><a href="rkward://settings/plugins">Graphical dialogs to R functionality</a>. These plugins are usually pre-installed with RKWard, or with an R package. However, they can be activated/deactivated to help keep the menus manageable. Note that it is relatively easy to <a href="https://api.kde.org/doc/rkwardplugins/">create your own custom dialogs as plugins</a>!</p><h2>Kate plugins</h2><p><a href="rkward://settings/kateplugins">Plugins developed for Kate / KTextEditor</a>. These provide shared functionality that is useful in the context of text editing and IDE applications. These plugins are usually found pre-installed on your system. You can configure to load the plugins that are useful to your own workflow.</p>
ar: <h1>الإضافات</h1><p>تأتي إضافات أر كي وارد في مجموعة متنوعة من الأشكال، لكل منها خيارات اضبط خاصة به:</p><h2>حزم R</h2><p><a href="rkward://settings/rpackages">إضافات إلى لغة R نفسها</a>. حمّلها عادة من "CRAN". قد تحتوي بعض حزم الإضافات هذه بشكل إضافي على ملحقات أر كي وارد.</p><h2>ملحقات أر كي وارد</h2><p><a href="rkward://settings/plugins">مربعات حوار رسومية لوظائف R</a>. ركّب هذه الملحقات عادة مسبقًا مع أر كي وارد، أو مع حزمة R. ومع ذلك، يمكن تفعيلها/إلغاء تفعيلها للمساعدة في الحفاظ على القوائم قابلة للإدارة. لاحظ أن إنشاء مربعات الحوار المخصصة الخاصة بك كملحقات سهل نسبيًا <a href="https://api.kde.org/doc/rkwardplugins/">إنشاء مربعات الحوار المخصصة الخاصة بك كملحقات</a>!</p><h2>ملحقات Kate</h2><p><a href="rkward://settings/kateplugins">ملحقات طوّرت لـ Kate / KTextEditor</a>. توفر هذه وظائف مشتركة مفيدة في سياق تحرير النصوص وتطبيقات بيئة التطوير المتكاملة. اعثر على هذه الملحقات عادة مركبة مسبقًا على نظامك. يمكنك اضبط لتحميل الملحقات المفيدة لسير عملك الخاص.</p>
ru: <h1>Дополнения</h1><p>Дополнения для RKWard представлены в различных формах, при этом для каждой из них предусмотрены свои параметры настройки:</p><h2>Пакеты R</h2><p><a href="rkward://settings/rpackages">Дополнения для самого языка R</a>. Они обычно загружаются из «CRAN». Некоторые из этих пакетов дополнений могут содержать также и модули RKWard.</p><h2>Модули RKWard</h2><p><a href="rkward://settings/plugins">Графические диалоги для расширения возможностей R</a>. Эти модули обычно устанавливаются вместе с RKWard или пакетом R. Но их можно включать или отключать, чтобы меню программы содержали только нужные пункты. Обратите внимание, что <a href="https://api.kde.org/doc/rkwardplugins/">создавать свои собственные диалоги в виде модулей</a> довольно просто!</p><h2>Модули Kate</h2><p><a href="rkward://settings/kateplugins">Модули, разработанные для Kate или KTextEditor</a>. В них реализованы общие функциональные возможности, которые полезны в контексте редактирования текста и интегрированных сред разработки. Эти модули обычно уже установлены в системе. Можно настроить программу на загрузку только тех модулей, которые нужны в личном рабочем процессе.</p>
tr: <h1>Eklentiler</h1><p>RKWard eklentileri, her biri kendi yapılandırma seçeneklerine sahip çeşitli biçimlerde gelir:</p><h2>R Paketleri</h2><p><a href="rkward://settings/rpackages">R dilinin kendisi için eklentiler</a>. Bunlar genellikle “CRAN”dan indirilir. Bu eklenti paketlerinden bazıları ayrıca RKWard eklentileri içerebilir.</p><h2>RKWard Eklentileri</h2><p><a href="rkward://settings/plugins">R işlevselliğine yönelik grafik iletişim kutuları</a>. Bu eklentiler genellikle RKWard veya bir R paketiyle önceden kurulur. Ancak menülerin fazla kalabalıklaşmaması adına etkinleştirilebilir/devre dışı bırakılabilirler. <a href="https://api.kde.org/doc/rkwardplugins/">Kendi özel iletişim kutularınızı eklenti türünde oluşturmanın</a> görece kolay olduğunu aklınızda bulundurun!</p><h2>Kate Eklentileri</h2><p><a href="rkward://settings/kateplugins">Kate/KTextEditor için geliştirilen eklentiler</a>. Bunlar, metin düzenleme ve tümleşik geliştirme ortamı uygulamaları bağlamında yararlı olan paylaşılan işlevsellikler sağlar. Bu eklentiler genellikle sisteminize önceden kurulu olarak bulunur. Kendi iş akışınız için yararlı olan eklentileri yükleyecek şekilde yapılandırabilirsiniz.</p>

source: Dependencies
ar: الاعتماديّات
ru: Зависимости
tr: Bağımlılıklar

source: Broken
ar: معطوبة
ru: Повреждено
tr: Bozuk

source: Loaded
ar: محمّل
ru: Загружено
tr: Yüklü

source: Quirky
ar: زائغ
ru: Специфично
tr: İlginç

source: Active
ar: نشط
ru: Активно
tr: Etkin

source: ID
ar: المعرّف
ru: Идентификатор
tr: Kimlik

source: Select .pluginmap-file
ar: اختر ملف .pluginmap
ru: Выбор файла .pluginmap
tr: .pluginmap Dosyası Seç

source: R-Backend
ar: خلفية R
ru: Серверное приложение R
tr: R Arka Ucu

source: The following settings mostly affect R behavior in the console. It is generally safe to keep these unchanged.
ar: الإعدادات التالية تؤثر في الغالب على سلوك R في الطرفية. من الآمن عمومًا الإبقاء عليها بلا تغيير.
ru: Следующие параметры в основном влияют на поведение R в консоли. Обычно можно спокойно оставлять их без изменений.
tr: Aşağıdaki ayarlar çoğunlukla konsoldaki R davranışını etkiler. Bunları değiştirmeden tutmak genellikle güvenlidir.

source: Display warnings
ar: اعرض التحذيرات
ru: Показывать предупреждения
tr: Uyarıları görüntüle

source: Suppress warnings
ar: امنع التحذيرات
ru: Подавлять предупреждения
tr: Uyarıları sustur

source: Print warnings later (default)
ar: اطبع التحذيرات لاحقًا (مبدئي)
ru: Выводить предупреждения потом (по умолчанию)
tr: Uyarıları sonra yazdır (öntanımlı)

source: Print warnings immediately
ar: اطبع التحذيرات فورًا
ru: Выводить предупреждения сразу
tr: Uyarıları anında yazdır

source: Convert warnings to errors
ar: حوّل التحذيرات إلى أخطاء
ru: Преобразовывать предупреждения в ошибки
tr: Uyarıları hatalara dönüştür

source: Decimal character (only for printing)
ar: حرف عشري (للطباعة فقط)
ru: Десятичный символ (только для вывода)
tr: Ondalık karakteri (yalnızca yazdırma için)

source: Output width (characters)
ar: عرض المخرج (بالأحرف)
ru: Ширина вывода (в символах)
tr: Çıktı genişliği (karakter)

source: Maximum number of elements shown in print
ar: الحد الأقصى لعدد العناصر المعروضة في الطباعة
ru: Максимальное количество элементов, показанных в выводе
tr: Baskıda görünecek azami öge sayısı

source: Maximum length of warnings/errors to print
ar: الحد الأقصى لطول التحذيرات/الأخطاء للطباعة
ru: Максимальная длина предупреждений и ошибок для вывода
tr: Baskı için uyarılar/hataların maksimum uzunluğu

source: Keep comments in functions
ar: أبقِ التعليقات في الدوال
ru: Сохранять комментарии в функциях
tr: Fonksiyonlardaki yorumları koru

source: TRUE (default)
ar: صحيح (مبدئي)
ru: TRUE (по умолчанию)
tr: DOĞRU (öntanımlı)

source: FALSE
ar: خطأ
tr: YANLIŞ

source: Keep comments in packages
ar: أبقِ التعليقات في الحزم
ru: Сохранять комментарии в пакетах
tr: Paketlerdeki yorumları koru

source: TRUE
ar: صحيح
tr: DOĞRU

source: FALSE (default)
ar: خاطئ (مبدئي)
ru: FALSE (по умолчанию)
tr: YANLIŞ(Öntanımlı)

source: Maximum level of nested expressions
ar: الحد الأقصى لمستوى التعبيرات المتداخلة
ru: Максимальный уровень вложенности выражений
tr: İç içe ifadelerin maksimum düzeyi

source: Default decimal precision in print ()
ar: الدقة العشرية مبدئي في print ()
ru: Стандартное количество знаков после запятой в print ()
tr: Baskıda öntanımlı ondalık hassasiyeti

source: Check vector bounds (warn)
ar: افحص حدود المتجه (حذّر)
ru: Проверять границы векторов (предупреждать)
tr: Vektör sınırlarını denetle (uyar)

source: Editor command
ar: أمر المحرّر
ru: Команда редактора
tr: Düzenleyici komutu

source: Pager command
ar: أمر المقلّب
ru: Команда деления на страницы
tr: Çağrı komutu

source: Further (option) commands to run in each session
ar: أوامر (خيارات) أخرى لتشغيلها في كل جلسة
ru: Другие (необязательные) команды для запуска в каждом сеансе
tr: Her oturumda çalıştırmak için daha fazla (seçenek) komut

source: Addition search paths for utilities used by R
ar: مسارات البحث الإضافية للمرافق المستخدمة من قبل R
ru: Добавление путей поиска для инструментов R
tr: R tarafından kullanılan izlenceler için ek arama yolları

source: Add System Path Directory
ar: أضف مجلد مسار النظام
ru: Добавление каталога системного пути
tr: Sistem Yolu Dizini Ekle

source: Specify or select directory to add to the system file path of the running R session
ar: حدد أو اختر مجلدًا لإضافته إلى مسار ملف النظام لجلسة R الجارية
ru: Укажите или выберите каталог, который следует добавить к системному файловому пути запущенного сеанса R
tr: Çalışan R oturumunun sistem dosya yoluna eklenecek dizini belirtin veya seçin

# Add directory to list
source: Add
ar: أضف
ru: Добавить
tr: Ekle

source: R-Packages
ar: حزم R
ru: Пакеты R
tr: R Paketleri

source: CRAN download mirror (leave empty to be prompted once each session):
ar: مرآة تحميل CRAN (اتركها فارغة لتسأل مرة واحدة في كل جلسة):
ru: Зеркало для загрузки CRAN (оставьте пустым, чтобы указывать во время каждого сеанса):
tr: CRAN indirme yansısı (her oturumda bir kez sorulması için boş bırakın):

source: Select mirror
ar: اختر مرآة
ru: Выбрать зеркало
tr: Yansı Seç

source: Select CRAN mirror
ar: اختر مرآة CRAN
ru: Выбор зеркала CRAN
tr: CRAN Yansısı Seç

source: Additional package repositories (where libraries are downloaded from)
ar: مستودعات حزم إضافية (حيث تحمل المكتبات منها)
ru: Дополнительные репозитории пакетов (откуда загружаются библиотеки)
tr: Ek paket depoları (kitaplıkların indirileceği yer)

source: Add repository
ar: إضافة مستودع
ru: Добавить репозиторий
tr: Depo Ekle

source: Add URL of new repository
ar: أضف رابط URL لمستودع جديد
ru: Добавить URL-адрес нового репозитория
tr: Yeni deponun URL’sini ekle

source: Archive downloaded packages
ar: أرشِف الحزم المحملة
ru: Архивировать загруженные пакеты
tr: İndirilen paketleri arşivle

source: Build packages from source
ar: ابنِ الحزم من المصدر
ru: Собрать пакеты из источника
tr: Paketleri kaynak kodundan derle

source: Build packages from source (not configurable on this platform)
ar: ابنِ الحزم من المصدر (غير قابلة للضبط على هذا النظام)
ru: Собрать пакеты из источника (не настраивается на этой платформе)
tr: Paketleri kaynak kodundan derleyin (bu platformda yapılandırılabilir değil)

source: Installing packages from pre-compiled binaries (if available) is generally faster, and does not require an installation of development tools and libraries. On the other hand, building packages from source provides best compatibility.
ar: تركيب الحزم من ثنائيات مسبقة التجميع (إذا توفرت) أسرع عمومًا، ولا تتطلب تركيب أدوات ومكتبات التطوير. من ناحية أخرى، بناء الحزم من المصدر يوفر أفضل توافق.
ru: Установка пакетов из предварительно скомпилированных бинарных файлов (если они доступны) обычно выполняется быстрее и не требует установки программ и библиотек для разработки. С другой стороны, сборка пакетов из исходного кода обеспечивает наилучшую совместимость.
tr: Paketlerin önceden derlenmiş ikili dosyalardan (varsa) kurulması genellikle daha hızlıdır ve geliştirme araçlarının ve kitaplıkların kurulmasını gerektirmez. Öte yandan, kaynaktan paket oluşturmak en iyi uyumluluğu sağlar.

source: Install from git
ar: ركّب من git
ru: Установить из git
tr: Git’ten Kur

source: Some add-on packages are not available in the CRAN repository, but can be installed from development repositories. Use the button "%1", to install such packages, comfortably.
ar: بعض حزم الإضافات غير متوفرة في مستودع CRAN، ولكن يمكن تركيبها من مستودعات التطوير. استخدم الزر "%1"، لتركيب هذه الحزم، براحة.
ru: Некоторые пакеты дополнений недоступны в репозитории CRAN, но их можно установить из репозиториев разработки. Воспользуйтесь кнопкой «%1» для комфортной установки таких пакетов.
tr: Bazı eklenti paketleri CRAN deposunda yoktur; ancak geliştirme depolarından kurulabilir. Bu tür paketleri rahatça kurmak için “%1” düğmesini kullanın.

source: R Library locations (where libraries get installed to, locally)
ar: مواقع مكتبة R (حيث تركّب المكتبات، محليًا)
ru: Расположение библиотек R (куда выполняется локальная установка библиотек)
tr: R kitaplığı konumu (kitaplıkların yerel olarak kurulduğu yer)

source: Add R Library Directory
ar: أضف مجلد مكتبة R
ru: Добавление каталога библиотек R
tr: R Kitaplık Dizini Ekle

source: Specify or select library location to add. Note that locations may contain a '%v', which will expand to the first two components of the R version number (e.g. to 3.5), automatically. Including this is recommended, because R packages compiled for one version of R will often fail to work correctly in a different version of R.
ar: حدد أو اختر موقع مكتبة للإضافة. لاحظ أن المواقع قد تحتوي على '%v'، الذي يتوسع إلى أول مكونين من رقم إصدار R (مثل إلى 3.5)، آليًا. ضم هذا موصى به، لأن حزم R المجمعة لإصدار واحد من R غالبًا ما تفشل في العمل بشكل صحيح في إصدار مختلف من R.
ru: Укажите или выберите расположение библиотек, которое следует добавить. Обратите внимание, что адреса могут содержать заменитель «%v», который соответствует первым двум составляющим номера версии R (например, 3.5). Рекомендуется использовать его, так как пакеты R, собранные для одной версии R, часто не работают надлежащим образом в других версиях R.
tr: Eklenecek kitaplık konumunu belirtin veya seçin. Konumların, R sürüm numarasının ilk iki bileşenine (örneğin 3.5’e) kendilğinden genişleyecek bir “%v” içerebileceğini unutmayın. Bunun içerilmesi önerilir; çünkü R’nin bir sürümü için derlenen R paketleri genellikle farklı bir R sürümünde düzgün çalışmaz.

# Add file to list
source: Add
ar: أضف
ru: Добавить
tr: Ekle

source: Note: The startup defaults will always be used in addition to the locations you specify in this list
ar: ملاحظة: تُستخدم إعدادات بدء التشغيل مبدئ دائمًا بالإضافة إلى المواقع التي تحددها في هذه القائمة
ru: Примечание: в дополнение к указанным в этом списке расположениям программа всегда использует стандартные параметры запуска
tr: Not: Bu listede belirttiğiniz konumlara ek olarak her zaman başlangıç öntanımlıları kullanılacaktır.

source: Unversioned library location
ar: موقع مكتبة غير مُصدّر
ru: Расположение библиотек без версий
tr: Sürümlendirilmemiş kitaplık konumu

source: The configured library locations (where R packages will be installed on this system) contains the directory '%1', which was suggested as a default library location in earlier versions of RKWard. Use of this directory is no longer recommended, as it is not accessible to R sessions outside of RKWard (unless configured, explicitly). Also due to the lack of an R version number in the directory name, it offers no protection against using packages built for an incompatible version of R.
ar: مواقع المكتبة المضبوطة (حيث تركّب حزم R على هذا النظام) تحتوي على المجلد '%1'، الذي اقترح كموقع مكتبة مبدئي في إصدارات سابقة من أر كي وارد. استخدام هذا المجلد لم يعد موصى به، لأنه غير قابل للوصول لجلسات R خارج أر كي وارد (ما لم يضبط، صراحة). أيضًا بسبب الافتقار إلى رقم إصدار R في اسم المجلد، لا يوفر حماية ضد استخدام الحزم المبنية لإصدار غير متوافق من R.
ru: Среди настроенных расположений библиотек (куда устанавливаются пакеты R в этой системе) есть каталог «%1», который предлагался в качестве стандартного расположения библиотек в предыдущих версиях RKWard. Использовать этот каталог более не рекомендуется, так как он недоступен для сеансов R вне RKWard (если только явным образом не настроено иное). Кроме того, в названии каталога отсутствует номер версии R, поэтому система не защищена от использования пакетов, собранных для несовместимой версии R.
tr: Yapılandırılmış kitaplık konumları (bu sistemde R paketlerinin kurulacağı yer), RKWard’ın önceki sürümlerinde öntanımlı kitaplık konumu olarak önerilen “%1” dizinini içerir. RKWard dışındaki R oturumları tarafından erişilemediğinden (açıkça yapılandırılmadıkça) bu dizinin kullanılması artık önerilmemektedir. Ayrıca dizin adında R sürüm numarasının bulunmaması nedeniyle, uyumsuz bir R sürümü için oluşturulmuş paketlerin kullanılmasına karşı koruma sağlamaz.

# verb
source: Rename
ar: غيّر الاسم
ru: Переименовать
tr: Yeniden Adlandır

source: Rename this location to include the version number of the currently running R. Packages will continue to work (if they are compatible with this version of R).
ar: أعد تسمية هذا الموقع لضم رقم إصدار R الجاري التشغيل حاليًا. تستمر الحزم في العمل (إذا توافقت مع هذا الإصدار من R).
ru: Переименовать это расположение, чтобы включить в название каталога номер версии текущего дистрибутива R. Пакеты продолжат работать (если они совместимы с этой версией R).
tr: Şu anda çalışmakta olan R’nin sürüm numarasını içerecek şekilde bu konumu yeniden adlandırın. Paketler çalışmayı sürdürecektir (eğer R’nin bu sürümüyle uyumlularsa).

# verb
source: Remove
ar: أزل
ru: Удалить
tr: Kaldır

source: Remove this location from the configuration (it will not be deleted on disk). You will have to re-install any packages that you want to keep.
ar: أزل هذا الموقع من الضبط (لن يحذف من القرص). عليك إعادة تركيب أي حزم تريد الاحتفاظ بها.
ru: Удалить это расположение из конфигурации (оно не будет удалено с диска). Потребуется переустановить те пакеты, которые нужно оставить.
tr: Bu konumu yapılandırmadan kaldırın (diskten silinmeyecektir). Tutmak istediğiniz paketleri yeniden kurmanız gerekecektir.

# verb
source: Keep
ar: أبقِ
ru: Оставить
tr: Tut

source: Keep this location (do not change anything)
ar: أبقِ هذا الموقع (لا تغيّر أي شيء)
ru: Оставить это расположение (ничего не менять)
tr: Bu konumu tut (bir şeyi değiştirme)

source: Command log
ar: سجل الأوامر
ru: Журнал команд
tr: Komut günlüğü

source: For now, settings only apply to new commands. All previous commands remain visible/invisible.
ar: في الوقت الحالي، الإعدادات تسري على الأوامر الجديدة فقط. تظل جميع الأوامر السابقة مرئية/غير مرئية.
ru: Значения параметров будут применены только к новым командам. Уже обработанные команды останутся видимыми или невидимыми.
tr: Şimdilik ayarlar yalnızca yeni komutlar için geçerlidir. Önceki komutların tümü görünür/görünmez kalır.

source: always show command
ar: اعرض الأمر دائمًا
ru: всегда показывать команду
tr: komutu her zaman göster

source: always show result
ar: اعرض النتيجة دائمًا
ru: всегда показывать результат
tr: sonucu her zaman göster

source: show errors
ar: أظهر الأخطاء
ru: показать ошибки
tr: hataları göster

source: show/raise window
ar: اعرض/ارفع النافذة
ru: показать или поднять окно
tr: pencereyi göster/yükselt

source: User commands
ar: أوامر المستخدم
ru: Команды пользователя
tr: Kullanıcı komutları

source: Plugin generated commands
ar: أوامر مولّدة من الملحق
ru: Команды, созданные модулями
tr: Eklentiyle üretilen komutlar

source: Application commands
ar: أوامر التطبيق
ru: Команды приложения
tr: Uygulama komutları

source: Synchronization commands
ar: أوامر التزامن
ru: Команды синхронизации
tr: Eşzamanlama komutları

source: Maximum number of paragraphs/lines to display in the Command Log (0 for no limit)
ar: الحد الأقصى لعدد الفقرات/السطور للعرض في سجل الأوامر (0 بلا حد)
ru: Максимальное количество абзацев/строк для показа в журнале команд (0 — без ограничений)
tr: Komut Günlüğünde görüntülenecek en çok paragraf/satır sayısı (sınırsız için 0)

source: Attach to main window
ar: أرفق بالنافذة الرئيسية
ru: Прикрепить к главному окну
tr: Ana pencereye iliştir

source: &Device
ar: ال&جهاز
ru: &Устройство
tr: &Aygıt

source: &History
ar: ال&تاريخ
ru: &Журнал
tr: &Geçmiş

source: &Window
ar: ال&نافذة
ru: &Окно
tr: &Pencere

# where to search
source: in Current Script
ar: في النص البرمجي الحالي
ru: в текущем сценарии
tr: Geçerli betikte

# where to search
source: in Open Scripts
ar: في النصوص البرمجية المفتوحة
ru: в открытых сценариях
tr: Açık betiklerde

source: Pause execution
ar: إيقاف التنفيذ مؤقتا
ru: Приостановить выполнение
tr: Yürütmeyi Duraklat

source: Cancel selected commands
ar: ألغِ الأوامر المختارة
ru: Отменить выбранные команды
tr: Seçili Komutları İptal Et

source: Some of the commands you were trying to cancel are marked as "sync" (letter 'S' in the type column). Cancelling such commands could lead to loss of data. These commands have _not_ been cancelled.
ar: بعض الأوامر التي حاولت إلغاءها معلمة كـ "مزامنة" (الحرف 'S' في عمود النوع). إلغاء هذه الأوامر قد يؤدي إلى فقدان البيانات. هذه الأوامر _لم_ تلغَ.
ru: Некоторые из отменяемых команд имеют отметку «sync» (буква «S» в столбце типа). Отмена таких команд может привести к потере данных, поэтому она _не_ была выполнена.
tr: İptal etmeye çalıştığınız komutlardan bazıları “sync” olarak imlendi (tür sütununda “S” harfi). Bu tür komutların iptal edilmesi veri kaybına neden olabilir. Bu komutlar iptal edilmedi.

source: Some commands not cancelled
ar: بعض الأوامر لم تلغَ
ru: Некоторые команды не отменены
tr: Bazı komutlar iptal edilmedi

source: Resume execution
ar: استأنف التنفيذ
ru: Продолжить выполнение
tr: Yürütmeyi Sürdür

source: <b>Active calls</b>
ar: <b>الاستدعاءات النشطة</b>
ru: <b>Активные вызовы</b>
tr: <b>Etkin çağrılar</b>

source: Not in a debugger context
ar: ليس في سياق مصحح الأخطاء
ru: Не в контексте отладчика
tr: Hata ayıklayıcısı bağlamında değil

source: <b>Current call:</b> %1<br><b>Environment:</b> %2<br><b>Local objects:</b> %3
ar: <b>الاستدعاء الحالي:</b> %1<br><b>البيئة:</b> %2<br><b>الكائنات المحلية:</b> %3
ru: <b>Текущий вызов:</b> %1<br><b>Окружение:</b> %2<br><b>Локальные объекты:</b> %3
tr: <b>Geçerli çağrı:</b> %1<br><b>Ortam:</b> %2<br><b>Yerel nesneler:</b> %3

source: Objects on search path
ar: الكائنات على مسار البحث
ru: Объекты по пути поиска
tr: Arama yolundaki nesneler

source: Function calls
ar: استدعاءات الدالة
ru: Вызовы функций
tr: İşlev çağrıları

source: Function arguments
ar: وسائط الدالة
ru: Аргументы функций
tr: İşlev argümanları

source: Local file names
ar: أسماء الملفات المحلية
ru: Имена локальных файлов
tr: Yerel dosya adları

source: Command 'S' is for R Markdown, only
ar: الأمر 'S' لـ R Markdown، فقط

source: Unknown command <tt><b>%1</b></tt>
ar: أمر غير معروف <tt><b>%1</b></tt>

# Keep this short
source: Search hit bottom.<br/><tt><b>c</b></tt> to move to next chunk.
ar: وصل البحث إلى القاع.<br/><tt><b>c</b></tt> للانتقال إلى المقطع التالي.

# Keep this short
source: Search hit top.<br/><tt><b>C</b></tt> to move to previous chunk.
ar: وصل البحث إلى القمة.<br/><tt><b>C</b></tt> للانتقال إلى المقطع السابق.

# Keep this short
source: Search hit bottom.<br/><tt><b>1</b></tt> to move to top.
ar: وصل البحث إلى القاع.<br/><tt><b>1</b></tt> للانتقال إلى القمة.

# Keep this short
source: Search hit top.<br/><tt><b>!</b></tt> to move to bottom.
ar: وصل البحث إلى القمة.<br/><tt><b>!</b></tt> للانتقال إلى القاع.

source: <b>Code Navigation</b> (<a href="rkward://page/rkward_code_navigation">Help</a>)
ar: <b>تصفح الرمز</b> (<a href="rkward://page/rkward_code_navigation">دليل</a>)

source: Enter command
ar: أدخِل أمرًا

source: Quick Code Navigation Mode
ar: نمط تصفح الرمز السريع

source: Step through your code using single keystrokes (<a href="rkward://page/rkward_code_navigation">more info</a>)
ar: انتقل خلال رمزك باستخدام ضغطات مفاتيح مفردة (<a href="rkward://page/rkward_code_navigation">مزيد من المعلومات</a>)

source: Step through your code based on its structure or enter <a href="rkward://page/rkward_code_navigation">Quick Code Navigation Mode</a>
ar: انتقل خلال رمزك بناءً على هيكله أو ادخل <a href="rkward://page/rkward_code_navigation">نمط تصفح الرمز السريع</a>

source: Code Navigation
ar: تصفح الرمز

# verb: To jump to a different place in the code
source: Go
ar: انتقل

source: Next statement
ar: العبارة التالية

source: Previous statement
ar: العبارة السابقة

source: Next (inner) statement
ar: العبارة الداخلية التالية

source: Previous (inner) statement
ar: العبارة الداخلية السابقة

source: Next outer statement
ar: العبارة الخارجية التالية
