Repository: KDE/rkward
Catalog: po/*/rkward__plots.po
Languages: ar, eo, ru

source: Select a numeric vector to estimate density for. For further options, see below.
ar: اختر متجهاً رقمياً لتقدير الكثافة له. للاطلاع على خيارات أخرى، انظر أدناه.
eo: Elektu nombran vektoron por taksi densecon. Por pliaj elektoj, vidu sube.
ru: Выберите числовой вектор для оценки плотности. Описание других параметров приводится ниже.

source: A numeric vector to estimate density for.
ar: متجه رقمي لتقدير الكثافة له.
eo: Nombra vektoro por taksi densecon por.
ru: Числовой вектор для оценки плотности.

source: Type of plot: Plain density curve, or density curve with highest density regions marked up. For the second option, only the gaussian smoothing kernel is available (see below).
ar: نوع الرسم: منحنى كثافة بسيط، أو منحنى كثافة مع وضع علامة على مناطق الكثافة العليا. للخيار الثاني، لا يتوفر إلا النواة الغاوسية للتنعيم (انظر أدناه).
eo: Speco de grafiko: Ebena denseckurbo, aŭ denseckurbo kun plej altaj densecaj regionoj markitaj. Por la dua elekteblo, nur la gaŭsa glatiga kerno estas disponebla (vidu sube).
ru: Тип графика: обычная кривая плотности или кривая плотности, на которой отмечены области наивысшей плотности. Для второго варианта доступно только гауссово ядро сглаживания (смотрите ниже).

source: Smoothing kernel to use. See <link href="rkward://rhelp/density"/> for details on the available kernels.
ar: نواة التنعيم المراد استخدامها. انظر <link href="rkward://rhelp/density"/> للاطلاع على تفاصيل حول النوى المتوفرة.
eo: Glatiga kerno por uzi. Vidu <link href="rkward://rhelp/density"/> por detaloj pri la disponeblaj kernoj.
ru: Ядро сглаживания, которое будет использоваться. Сведения о доступных ядрах: <link href="rkward://rhelp/density"/>.

source: Mode of choosing bandwidth. This is only applicable for gaussian smoothing kernels. This is the <i>bw</i> option of <link href="rkward://rhelp/density">density()</link>.
ar: نمط اختيار عرض النطاق. ينطبق هذا فقط على نوى التنعيم الغاوسية. هذا هو خيار <i>bw</i> لـ <link href="rkward://rhelp/density">density()</link>.
eo: Reĝimo elekti bandwidth. Ĉi tio validas nur por gaŭsaj glatigaj kernoj. Jen la <i>bw</i> elekteblo de <link href="rkward://rhelp/density">density()</link>.
ru: Режим выбора полосы пропускания. Применимо только для гауссовых ядер сглаживания. Это параметр <i>bw</i> функции <link href="rkward://rhelp/density">density()</link>.

source: Factor to adjust the bandwidth by.
ar: عامل لضبط عرض النطاق به.
eo: Faktoro por ĝustigi la bendolarĝon per.
ru: Фактор корректировки полосы пропускания.

source: Whether missing values should be removed. Otherwise missing values lead to an error during density estimation.
ar: هل يجب إزالة القيم المفقودة. وإلا فإن القيم المفقودة تؤدي إلى خطأ أثناء تقدير الكثافة.
eo: Ĉu mankantaj valoroj estu forigitaj. Alie mankantaj valoroj kondukas al eraro dum densectakso.
ru: Следует ли удалять отсутствующие значения. Если они не удаляются, возникнет ошибка при оценке плотности.

source: Resolution of the density estimation, i.e. the number of (equally spaced) points at which the density is estimated.
ar: دقة تقدير الكثافة، أي عدد النقاط (المتباعدة بالتساوي) التي تُقدَّر عندها الكثافة.
eo: Distingivo de la densectakso, t.e. la nombro da (same interspacigitaj) punktoj ĉe kiuj la denseco estas taksita.
ru: Разрешение оценки плотности, то есть количество (равномерно распределённых) точек, по которым оценивается плотность.

source: Should a rug be added to the plot?
ar: هل يجب إضافة سجادة (rug) إلى الرسم؟
eo: Ĉu oni devas aldoni tapiŝon al la grafiko?
ru: Следует ли добавить к графику дополнительный график?

source: Height of the rug ticks, where 1 corresponds to the height of the entire plot.
ar: ارتفاع علامات السجادة، حيث 1 يوافق ارتفاع الرسم بأكمله.
eo: Alteco de la tapiŝo tiktakos, kie 1 respondas al la alteco de la tuta grafiko.
ru: Высота делений дополнительного графика, где «1» соответствует высоте всего графика.

source: Line width of the rug.
ar: عرض خط السجادة.
eo: Liniolarĝo de la tapiŝo.
ru: Ширина строки дополнительного графика.

source: Should the rug be shown at the top or at the bottom of the plot?
ar: هل يجب إظهار السجادة في أعلى الرسم أم في أسفله؟
eo: Ĉu la tapiŝo estu montrata supre aŭ malsupre de la grafiko?
ru: Следует ли показывать дополнительный график над графиком или под ним?

source: Color to use for drawing the rug.
ar: اللون المراد استخدامه لرسم السجادة.
eo: Koloro por desegni la tapiŝon.
ru: Цвет для рисования дополнительного графика.

source: Further options regarding the look of the plot. See <link href="rkward://component/plot_options"/> for details.
ar: خيارات أخرى تتعلق بمظهر الرسم. انظر <link href="rkward://component/plot_options"/> للاطلاع على التفاصيل.
eo: Pliaj ebloj pri la aspekto de la grafiko. Vidu <link href="rkward://component/plot_options"/> por detaloj.
ru: Другие параметры внешнего вида графика. Подробнее здесь: <link href="rkward://component/plot_options"/>.

source: variable(s):
ar: المتغير(ات):
eo: variablo(j):
ru: переменные:

source: type of plot
ar: نوع الرسم
eo: speco de grafiko
ru: тип графика

source: plot normal density
ar: ارسم كثافة عادية
eo: grafiko normala denseco
ru: график нормальной плотности

source: plot highest density regions
ar: ارسم مناطق الكثافة العليا
eo: grafiku plej altan densecajn regionojn
ru: график областей наивысшей плотности

source: density estimation options
ar: خيارات تقدير الكثافة
eo: ebloj pri taksado de denseco
ru: параметры оценки плотности

source: Smoothing Kernel
ar: نواة التنعيم
eo: Glatiga Kerno
ru: Ядро сглаживания

source: gaussian (default)
ar: غاوسي (مبدئي)
eo: gaŭsa (defaŭlte)
ru: гауссово (по умолчанию)

source: rectangular
eo: rektangula
ru: прямоугольное

source: triangular
eo: triangula
ru: треугольное

source: epanechnikov
ru: Епанечникова

source: biweight
eo: dupezo
ru: бивзвешенное

source: cosine
eo: kosinuso
ru: косинусное

source: optcosine
ar: جيب التمام الأمثل
eo: optkozino
ru: опткосинусное

source: Bandwidth
ar: عرض النطاق
ru: Полоса пропускания

source: Adjust Bandwidth
ar: اضبط عرض النطاق
eo: Alĝustigu Bandwidth
ru: Корректировка полосы пропускания

source: Remove Missing Values
ar: أزل القيم المفقودة
eo: Forigu mankantajn valorojn
ru: Удалить отсутствующие значения

source: Resolution
ar: الدقة
eo: Difino
ru: Разрешение

source: Rug
ar: سجادة
eo: Tapiŝo
ru: Дополнительный график

source: Add rug
ar: أضف سجادة
eo: Aldonu tapiŝon
ru: Добавить дополнительный график

source: Ticksize
ar: حجم العلامة
eo: Tikgrando
ru: Размер деления

source: Line width of ticks
ar: عرض خط العلامات
eo: Liniolarĝo de iksodoj
ru: Ширина строки делений

source: Side of Rug
ar: جانب السجادة
eo: Flanko de Tapiŝo
ru: Сторона дополнительного графика

source: Rug on Bottom
ar: سجادة في الأسفل
eo: Tapiŝo sur la Malsupro
ru: Дополнительный график снизу

source: Rug on Top
ar: سجادة في الأعلى
eo: Tapiŝo sur Supre
ru: Дополнительный график сверху

source: Axis/Title
ar: محور/عنوان
eo: Akso/Titolo
ru: Ось/Заголовок

# R code comment
source: dotchart() is somewhat picky about data type
ar: دالة dotchart() دقيقة إلى حد ما بشأن نوع البيانات
eo: dotchart() estas iom elektema pri datumtipo
ru: Функция dotchart() довольно требовательна к типу данных

source: Data is not numeric, but proceeding as requested.\nDid you forget to check the tabulate option?
ar: البيانات ليست رقمية، ولكن استمر كما طلب. \nهل نسيت تحديد خيار الجدولة؟
eo: Datumoj ne estas nombraj, sed daŭrigas laŭ la peto.\nĈu vi forgesis marki la elekteblon de tabulado?
ru: Данные не являются числовыми, но обработка будет выполнена согласно запросу. По ошибке не установлен флажок табулирования?

source: Dot chart
ar: مخطط النقط
eo: Punkta diagramo
ru: Точечная диаграмма

source: Draw a dot chart
ar: ارسم مخطط نقاط
eo: Desegnu punkto-diagramon
ru: Нарисовать точечную диаграмму

source: If your data is already suitable for plotting, directly, specify it here. Otherwise, leave this empty, and check the <i><label id="tabulate"/></i> option, below.
ar: إذا كانت بياناتك مناسبة للرسم بالفعل، مباشرة، حددها هنا. وإلا، اترك هذا فارغًا، واختر خيار <i><label id="tabulate"/></i> أدناه.
eo: Se viaj datumoj jam taŭgas por grafikaĵo, rekte specifu ĝin ĉi tie. Alie, lasu ĉi tion malplena, kaj marku la elekteblon <i><label id="tabulate"/></i>, sube.
ru: Если данные уже подходят для непосредственного построения графика, укажите это здесь. Если это не так, ничего не указывайте и установите ниже флажок <i><label id="tabulate"/></i>.

source: Generic plot options. See <link href="rkward://component/plot_options"/>.
ar: خيارات الرسم العامة. انظر <link href="rkward://component/plot_options"/>.
eo: Ĝeneralaj grafiko-elektebloj. Vidu <link href="rkward://component/plot_options"/>.
ru: Универсальные параметры графика. Подробнее здесь: <link href="rkward://component/plot_options"/>.

source: Empirical Cumulative Distribution Function
ar: دالة التوزيع التراكمي التجريبية
eo: Empiria Akumula Distribua Funkcio
ru: Эмпирическая кумулятивная функция распределения

source: Minimum
ar: الأدنى
eo: Minimumo
ru: Минимум

source: Maximum
ar: الأقصى
eo: Maksimumo
ru: Максимум

source: Plot an empirical cumulative distribution function.
ar: ارسم دالة توزيع تراكمي تجريبية.
eo: Grafiku empirian akumulan distribuan funkcion.
ru: График эмпирической кумулятивной функции распределения.

source: Select a variable to plot an ECDF for. The theoretical normal distribution and a rug can be added to the plot.
ar: اختر متغيراً لترسم دالة التوزيع التراكمي التجريبية (ECDF) له. يمكن إضافة التوزيع النظري العادي وسجادة إلى الرسم.
eo: Elektu variablon por instigi ECDF. La teoria normala distribuo kaj tapiŝo povas esti aldonitaj al la grafiko.
ru: Выберите переменную для построения графика эмпирической кумулятивной функции распределения. К графику можно добавить теоретическое нормальное распределение и дополнительный график.

source: The variable to plot the ECDF
ar: المتغير المراد رسم دالة التوزيع التراكمي التجريبية (ECDF) له
eo: La variablo por grafiki la ECDF
ru: Переменная для построения графика эмпирической кумулятивной функции распределения

source: Options to change the look of the ECDF plot itself. Refer to <link href="rkward://component/plot_stepfun_options"/> for details.
ar: خيارات لتغيير مظهر رسم دالة التوزيع التراكمي التجريبية (ECDF) نفسه. ارجع إلى <link href="rkward://component/plot_stepfun_options"/> للاطلاع على التفاصيل.
eo: Elektebloj por ŝanĝi la aspekton de la ECDF-grafiko mem. Vidu al <link href="rkward://component/plot_stepfun_options"/> por detaloj.
ru: Параметры для изменения вида самого графика эмпирической кумулятивной функции распределения. Подробнее здесь: <link href="rkward://component/plot_stepfun_options"/>.

source: Should a theoretical normal distribution curve be added to the plot?
ar: هل يجب إضافة منحنى توزيع نظري عادي إلى الرسم؟
eo: Ĉu teoria normala distribua kurbo estu aldonita al la grafiko?
ru: Следует ли добавить к графику кривую теоретического нормального распределения?

source: Should the normal distribution curve be adjusted to match the mean and standard deviation of the plotted data? If this is not set a normal curve with mean 0 and sd 1 is drawn.
ar: هل يجب ضبط منحنى التوزيع العادي ليتطابق مع المتوسط والانحراف المعياري للبيانات المرسومة؟ إذا لم يُضبط هذا، سيرسم منحنى عادي بمتوسط 0 وانحراف معياري 1.
eo: Ĉu la normala distribua kurbo estu alĝustigita por kongrui kun la meznombro kaj norma devio de la grafikaj datumoj? Se ĉi tio ne estas agordita, normala kurbo kun meznombro 0 kaj sd 1 estas desegnita.
ru: Следует ли скорректировать кривую нормального распределения в соответствии со значениями среднего и стандартного отклонения данных на графике? Если этот флажок не установлен, будет нарисована обычная кривая со средним «0» и стандартным отклонением «1».

source: Color of the theoretical normal distribution curve.
ar: لون منحنى التوزيع النظري العادي.
eo: Koloro de la teoria normala distribua kurbo.
ru: Цвет кривой теоретического нормального распределения.

source: Should the rug be added above or below the plot?
ar: هل يجب إضافة السجادة فوق الرسم أم تحته؟
eo: Ĉu la tapiŝo devus esti aldonita super aŭ sub la grafiko?
ru: Следует ли добавить дополнительный график над графиком или под ним?

source: Height of the rug ticks
ar: ارتفاع علامات السجادة
eo: Alteco de la tapiŝo tiktakos
ru: Высота делений дополнительного графика

source: Line width of the rug ticks
ar: عرض خط علامات السجادة
eo: Liniolarĝo de la tapiŝo tiktakos
ru: Ширина строки делений дополнительного графика

source: Color of the rug
ar: لون السجادة
eo: Koloro de la tapiŝo
ru: Цвет дополнительного графика

source: Further generic plot options. Refer to <link href="rkward://component/plot_options"/> for details.
ar: خيارات الرسم العامة الأخرى. ارجع إلى <link href="rkward://component/plot_options"/> للاطلاع على التفاصيل.
eo: Pliaj ĝeneralaj grafiko-elektebloj. Vidu al <link href="rkward://component/plot_options"/> por detaloj.
ru: Другие универсальные параметры графика. Подробнее здесь: <link href="rkward://component/plot_options"/>.

source: Empirical Distribution Function
ar: دالة التوزيع التجريبية
eo: Empiria Distribua Funkcio
ru: Эмпирическая функция распределения

source: Step function options
ar: خيارات دالة الخطوة
eo: Paŝaj funkcio-opcioj
ru: Параметры ступенчатой функции

source: Step function plot options
ar: خيارات رسم دالة الخطوة
eo: Paŝaj funkcioj grafiko-opcioj
ru: Параметры графика ступенчатой функции

source: Further options
ar: خيارات إضافية
eo: Pliaj ebloj
ru: Другие параметры

source: Theoretical Normal Distribution
ar: التوزيع النظري العادي
eo: Teoria Normala Distribuo
ru: Теоретическое нормальное распределение

source: Draw Theoretical Normal Distribution
ar: ارسم التوزيع النظري العادي
eo: Desegnu Teoria Normala Distribuo
ru: Рисовать теоретическое нормальное распределение

source: Adjust to mean and sd of data
ar: اضبط للمتوسط والانحراف المعياري للبيانات
eo: Alĝustigu al meznombro kaj sd de datumoj
ru: Скорректировать в соответствии со средним и стандартным отклонением данных

source: Add rug to plot
ar: أضف سجادة إلى الرسم
eo: Aldonu tapiŝon al grafiko
ru: Добавить к графику дополнительный график

source: Rug on bottom
ar: سجادة في الأسفل
eo: Tapiŝo sur la fundo
ru: Дополнительный график снизу

source: Rug on top
ar: سجادة في الأعلى
eo: Tapiŝo supre
ru: Дополнительный график сверху

source: Title/Axis
ar: عنوان/محور
eo: Titolo/Akso
ru: Заголовок/Ось

source: Density curve
ar: منحنى الكثافة
eo: Denseckurbo
ru: Кривая плотности

source: Plot a histogram.
ar: ارسم المخطّط الدّرجيّ.
eo: Grafiku histogramon.
ru: График гистограммы.

source: Select a variable to plot a histogram. For available options, see below.
ar: اختر متغيراً لترسم مخططًا بيانيًا تكراريًا له. للاطلاع على الخيارات المتاحة، انظر أدناه.
eo: Elektu variablon por montri histogramon. Por disponeblaj opcioj, vidu sube.
ru: Выберите переменную для построения графика гистограммы. Описание доступных параметров приводится ниже.

source: The variable to plot the histogram for
ar: المتغير المراد رسم المخطط البياني التكراري له
eo: La variablo por prezenti la histogramon
ru: Переменная для построения графика гистограммы

source: Options concerning the calculation and look of the histogram. Refer to <link href="rkward://component/histogram_options"/> for details.
ar: خيارات تتعلق بحساب ومظهر المخطط البياني التكراري. ارجع إلى <link href="rkward://component/histogram_options"/> للاطلاع على التفاصيل.
eo: Elektebloj koncerne la kalkulon kaj aspekton de la histogramo. Vidu al <link href="rkward://component/histogram_options"/> por detaloj.
ru: Параметры, касающиеся расчёта и внешнего вида гистограммы. Подробнее здесь: <link href="rkward://component/histogram_options"/>.

source: Should a density curve be plotted over the histogram? This option is only available, if the histogram is density scaled.
ar: هل يجب رسم منحنى كثافة فوق المخطط البياني التكراري؟ هذا الخيار متاح فقط إذا نُسِبَ المخطط البياني التكراري إلى الكثافة.
eo: Ĉu denskurbo estu grafika super la histogramo? Ĉi tiu elekteblo disponeblas nur, se la histogramo estas denseca skalita.
ru: Следует ли строить кривую плотности поверх гистограммы? Этот параметр доступен только в том случае, когда гистограмма масштабируется по плотности.

source: Which color should the density line be drawn in?
ar: بأي لون يجب رسم خط الكثافة؟
eo: En kiu koloro estu desegnita la denseca linio?
ru: Каким цветом следует рисовать линию плотности?

source: The smoothing bandwidth used to calculate the density estimate. See <link href="rkward://rhelp/density"/> for details.
ar: عرض النطاق التنعيمي المستخدم لحساب تقدير الكثافة. انظر <link href="rkward://rhelp/density"/> للاطلاع على التفاصيل.
eo: La glatiga bendolarĝo uzata por kalkuli la densecan takson. Vidu <link href="rkward://rhelp/density"/> por detaloj.
ru: Полоса пропускания сглаживания, используемая для вычисления оценки плотности. Подробнее здесь: <link href="rkward://rhelp/density"/>.

source: Remove missing values? If not checked, missing values will cause an error.
ar: أزل القيم المفقودة؟ إذا لم تُختر، ستؤدي القيم المفقودة إلى خطأ.
eo: Ĉu forigi mankantajn valorojn? Se ne estas markita, mankantaj valoroj kaŭzos eraron.
ru: Удалить отсутствующие значения? Если флажок не установлен, наличие отсутствующих значений приведёт к возникновению ошибки.

source: Number of equally spaced points to estimate the density at.
ar: عدد النقاط المتباعدة بالتساوي لتقدير الكثافة عندها.
eo: Nombro de egale interspacigitaj punktoj por taksi la densecon je.
ru: Количество равномерно распределённых точек для оценки плотности.

source: Generic Plot Options
ar: خيارات الرسم العامة
eo: Ĝeneralaj Grafikaj Opcioj
ru: Универсальные параметры графика

source: Histogram Options
ar: خيارات المخطط البياني التكراري
eo: Histogramaj Opcioj
ru: Параметры гистограммы

source: Density
ar: الكثافة
eo: Denseco
ru: Плотность

source: Plot Density curve
ar: ارسم منحنى الكثافة
eo: Grafika Denseckurbo
ru: Построить кривую плотности

source: General options
ar: خيارات عامة
eo: Ĝeneralaj opcioj
ru: Общие параметры

source: resolution
ar: الدقة
eo: rezolucio
ru: разрешение

source: Bandwidth options
ar: خيارات عرض النطاق
eo: Opcioj de larĝa bando
ru: Параметры полосы пропускания

source: Pareto chart
ar: مخطط باريتو
eo: Pareto-diagramo
ru: Диаграмма Парето

source: Creates a pareto chart, and (optionally) prints the values.
ar: أنشئ مخطط باريتو، واطبع القيم (اختيارياً).
eo: Kreas pareto-diagramon, kaj (laŭvole) presas la valorojn.
ru: Создаёт диаграмму Парето и (необязательно) выводит значения.

source: Choose a vector or a factor to be plotted. The frequency, cumulative frequency, percentage and cumulative percentage will be printed under the plot.
ar: اختر متجهًا أو عاملًا لترسمه. ستطبع التكرار، والتكرار التراكمي، والنسبة المئوية، والنسبة المئوية التراكمية تحت الرسم.
eo: Elektu vektoron aŭ faktoron por esti grafika. La ofteco, akumula ofteco, procento kaj akumula procento estos presitaj sub la grafiko.
ru: Выберите вектор или фактор для построения графика. Частота, кумулятивная частота, процент и кумулятивный процент будут выведены под графиком.

source: If your data is already contains defect counts or defect costs, or other data suitable for direct display in a pareto chart, specify it here. Otherwise, leave this empty, and check the "Tabulate" option, above.
ar: إذا كانت بياناتك تحتوي بالفعل على عدد العيوب أو تكاليف العيوب، أو بيانات أخرى مناسبة للعرض المباشر في مخطط باريتو، فحددها هنا. وإلا، اترك هذا فارغًا، واختر خيار "الجدولة" أعلاه.
eo: Se viaj datumoj jam enhavas difektokalkulojn aŭ difektajn kostojn, aŭ aliajn datumojn taŭgajn por rekta montrado en pareto-diagramo, specifu ĝin ĉi tie. Alie, lasu ĉi tion malplena, kaj marku la elekteblon "Tabulado", supre.
ru: Если данные уже содержат количество дефектов, стоимость дефектов или другие данные, которые могут быть напрямую показаны на диаграмме Парето, укажите это здесь. Если это не так, ничего не указывайте и установите выше флажок «Табулировать».

source: Whether to print the frequency, cumulative frequency, percentage and cumulative percentage below the plot in the output window.
ar: هل تطبع التكرار، والتكرار التراكمي، والنسبة المئوية، والنسبة المئوية التراكمية أسفل الرسم في نافذة الإخراج.
eo: Ĉu presi la frekvencon, akumulan frekvencon, procenton kaj akumulan procenton sub la grafiko en la eligofenestro.
ru: Следует ли выводить частоту, кумулятивную частоту, процент и кумулятивный процент под графиком в окне вывода.

source: Further options for the plot. Refer to <link href="rkward://component/plot_options"/> for details.
ar: خيارات أخرى للرسم. ارجع إلى <link href="rkward://component/plot_options"/> للاطلاع على التفاصيل.
eo: Pliaj ebloj por la grafiko. Vidu al <link href="rkward://component/plot_options"/> por detaloj.
ru: Другие параметры графика. Подробнее здесь: <link href="rkward://component/plot_options"/>.

source: Raw vector to plot
ar: المتجه الخام للرسم
eo: Kruda vektoro por grafiki
ru: Необработанный вектор для построения графика

source: Print descriptives
ar: اطبع الأوصاف
eo: Presi priskribaĵoj
ru: Выводить описательные статистики

source: Orientation
ar: الاتّجاه
eo: Orientiĝo
ru: Ориентация

source: Clockwise
ar: مع عقارب السّاعة
eo: Dekstrume
ru: По часовой стрелке

source: Counter clockwise
ar: عكس اتجاه عقارب الساعة
eo: Kontraŭhorloĝe
ru: Против часовой стрелки

source: Pie chart
ar: مخطط دائري
eo: Tortdiagramo
ru: Круговая диаграмма

source: Draw a pie chart
ar: ارسم مخطط فطيرة
eo: Desegnu kukran diagramon
ru: Нарисовать круговую диаграмму

source: Draws a pie chart from numerical data, or from tabulated data. Further options are available on the second tab.
ar: ارسم مخطط فطيرة من بيانات رقمية، أو من بيانات مُجدوَلة. تتوفر خيارات أخرى في اللسان الثاني.
eo: Desegnas kuk-diagramon el nombraj datumoj aŭ el tabeligitaj datumoj. Pliaj ebloj haveblas sur la dua langeto.
ru: Рисует круговую диаграмму на основе числовых данных или табулированных данных. На второй вкладке доступны другие параметры.

source: Type of colors to use.
ar: نوع الألوان المراد استخدامها.
eo: Tipo de koloroj por uzi.
ru: Тип цветов для использования.

source: Define if slices should be drawn clockwise or counter clockwise.
ar: حدد ما إذا يجب رسم الشرائح في اتجاه عقارب الساعة أو عكس اتجاه عقارب الساعة.
eo: Difinu ĉu tranĉaĵoj devas esti desegnitaj dekstrume aŭ kontraŭhorloĝe.
ru: Укажите, как следует рисовать секторы: по часовой стрелке или против часовой стрелки.

source: Radius of the pie. For long labels it may be necessary to make the pie smaller than the default.
ar: نصف قطر الفطيرة. للصائق الطويلة قد يلزم جعل الفطيرة أصغر من المبدئي.
eo: Radiuso de la kukaĵo. Por longaj etikedoj eble necesas fari la kukaĵon pli malgranda ol la defaŭlta.
ru: Радиус круга. Если подписи длинные, может потребоваться сделать круг меньше, чем по умолчанию.

source: Density of shading lines (lines per inch). The default value of -1 means no shading lines are drawn.
ar: كثافة خطوط التظليل (خطوط لكل بوصة). القيمة المبدئية -1 تعني عدم رسم خطوط تظليل.
eo: Denso de ombraj linioj (linioj per colo). La defaŭlta valoro de -1 signifas ke neniuj ombraj linioj estas desegnitaj.
ru: Плотность линий штриховки (линий на дюйм). Значение по умолчанию «-1» означает, что рисование линий штриховки не выполняется.

source: The density of shading lines can be varied per pie slice. Set this to values other than 0 to get different densities of shading lines for each slice.
ar: يمكن تغيير كثافة خطوط التظليل لكل شريحة فطيرة. اضبط هذا على قيم غير 0 للحصول على كثافات مختلفة لخطوط التظليل لكل شريحة.
eo: La denseco de ombraj linioj povas esti variita per kukaĵotranĉaĵo. Agordu ĉi tion al valoroj krom 0 por akiri malsamajn densecojn de ombraj linioj por ĉiu tranĉaĵo.
ru: Плотность линий штриховки может быть разной для разных секторов круговой диаграммы. Установите отличные от нуля значения, чтобы плотность линий штриховки различалась в зависимости от сектора.
