Repository: KDE/rkward
Catalog: po/*/rkward__embedded.po
Languages: ar, eo, ru, tr

source: If you want to install from a subdirectory of the repository, define that here.
eo: Se vi volas instali el subdosierujo de la deponejo, difinu tion ĉi tie.
ru: Если следует выполнить установку из подкаталога репозитория, укажите это здесь.
tr: Deponun bir alt dizininden kurulum yapmak istiyorsanız bunu burada tanımlayın.

source: To install from a private repository, set your personal access token (PAT, GitHub and GitLab only).
eo: Por instali el privata deponejo, agordu vian personan alirĵetonon (nur PAT, GitHub kaj GitLab).
ru: Задайте персональный маркер доступа для выполнения установки из закрытого репозитория (PAT, только GitHub и GitLab).
tr: Özel bir depodan kurulum yapmak için kişisel erişim jetonunuzu ayarlayın (Yalnızca PAT, GitHub ve GitLab).

source: To install from a private repository, set the user name (Bitbucket only).
eo: Por instali de privata deponejo, agordu la uzantnomon (nur Bitbucket).
ru: Задайте имя пользователя для выполнения установки из закрытого репозитория (только Bitbucket).
tr: Özel bir depodan kurulum yapmak için kullanıcı adını ayarlayın (Yalnızca Bitbucket).

source: To install from a private repository, set the password (Bitbucket only).
eo: Por instali el privata deponejo, agordu la pasvorton (nur Bitbucket).
ru: Задайте пароль для выполнения установки из закрытого репозитория (только Bitbucket).
tr: Özel bir depodan kurulum yapmak için parolanızı ayarlayın (Yalnızca Bitbucket).

source: Install from git/svn
eo: Instalu de git/svn
ru: Установка из git/svn
tr: Git/SVN’den kur

source: Package source
eo: Paka fonto
ru: Источник пакетов
tr: Paket kaynağı

source: git (generic)
eo: git (genera)
ru: git (типовой)
tr: Git (genel)

source: subversion (generic)
eo: subversio (genera)
ru: subversion (типовой)
tr: Subversion (Genel)

source: Package repository
eo: Pakaĵdeponejo
ru: Репозиторий пакетов
tr: Paket deposu

source: Git user name
eo: Git uzantnomo
ru: Имя пользователя Git
tr: Git kullanıcı adı

source: Repository
eo: Deponejo
ru: Репозиторий
tr: Depo

source: URL to repository
eo: URL al deponejo
ru: URL-адрес репозитория
tr: Depo URL’si

source: Commit/tag/branch
eo: Faru/etikedon/branĉon
ru: Фиксация/метка/ветвь
tr: İşleme/Etiket/Dal

source: Subdirectory
eo: Subdosierujo
ru: Подкаталог
tr: Alt dizin

source: Private repository
eo: Privata deponejo
ru: Закрытый репозиторий
tr: Özel depo

source: Personal access token (PAT)
eo: Persona alirĵetono (PAT)
ru: Персональный маркер доступа
tr: Kişisel erişim jetonu (PAT)

source: User
eo: Uzanto
ru: Пользователь
tr: Kullanıcı

source: Password
eo: Pasvorto
ru: Пароль
tr: Parola

source: Menu structure definition
ar: تعريف هيكل القائمة
eo: Difino de menua strukturo
ru: Определение структуры меню
tr: Menü yapısı tanımı

source: Not for direct use: Defines the names and order of top level menus. Part of the official RKWard distribution
ar: ليس للاستعمال المباشر: يعرّف أسماء وترتيب القوائم ذات المستوى الأعلى. جزء من توزيع أر كي وارد الرسمي
eo: Ne por rekta uzo: Difinas la nomojn kaj ordon de supranivelaj menuoj. Parto de la oficiala RKWard-distribuo
ru: Не для непосредственного использования: определяет названия и порядок меню верхнего уровня. Часть официального дистрибутива RKWard
tr: Doğrudan kullanım için değildir: Üst düzey menülerin adlarını ve sırasını tanımlar. Resmi RKWard dağıtımının bir parçası

source: Data
ar: البيانات
eo: Datumoj
ru: Данные
tr: Veri

source: Analysis
ar: التحليل
eo: Analizo
ru: Анализ
tr: Çözümleme

source: Plots
ar: الرسوم البيانية
eo: Grafikoj
ru: Графики
tr: Grafikler

source: Distributions
ar: التوزيعات
eo: Distribuoj
ru: Распределения
tr: Dağıtımlar

source: empty
ar: فارغ
eo: malplena
ru: пусто
tr: boş

# R code comment
source: adjust the range so that the labels will fit
ar: اضبِط المدى بحيث تتلاءم لصائق
eo: ĝustigu la gamon por ke la etikedoj konvenu
ru: скорректировать диапазон, чтобы подписи помещались
tr: etiketlerin sığması için erimi ayarlayın

source: Options applicable to bar plots
ar: الخيارات المطبَّقة على الرسوم البيانية الشريطية
eo: Opcioj aplikeblaj al ortogramoj
ru: Параметры, применимые к столбчатым графикам
tr: Bar grafikleri için kullanılabilir seçenekler

source: Choose if you want stacked bars, legend, and rainbow colors. Also you can choose if you want to display or not bar values (labels) and in what place.
ar: اختر إذا أردت أشرطة مكدسة، ووسيلة إيضاح، وألوان قوس قزح. كذلك يمكنك اختيار إذا أردت عرض أو عدم عرض قيم الشريط (لصائق) وفي أي موضع.
eo: Elektu ĉu vi volas staplitajn stangojn, legendojn kaj ĉielarkajn kolorojn. Ankaŭ vi povas elekti ĉu vi volas montri aŭ ne trinkvalorojn (etikedoj) kaj en kiu loko.
ru: Укажите, нужны ли составные столбцы, легенда и цвета радуги. Также можно указать, следует ли показывать значения столбцов (подписи) и где они должны располагаться.
tr: Yığılmış çubuklar, göstergeler ve gökkuşağı renkleri isteyip istemediğinizi seçin. Ayrıca çubuk değerlerinin (etiketlerin) nerelerde görüntülenip görüntülenmeyeceğini de seçebilirsiniz.

source: Should a legend be added to the barplot? The row names of the data will be used to construct the legend, so this option has no effect, if the rows are not named.
ar: هل يجب إضافة وسيلة إيضاح إلى الرسم البياني الشريطي؟ أسماء صفوف البيانات تُستعمَل لبناء وسيلة الإيضاح، لذا ليس لهذا الخيار أي تأثير، إذا لم تُسمَّ الصفوف.
eo: Ĉu legendo estu aldonita al la barploto? La vicnomoj de la datumoj estos uzataj por konstrui la legendon, do ĉi tiu elekteblo ne efikas, se la vicoj ne estas nomitaj.
ru: Следует ли добавить к столбчатому графику легенду? Для создания легенды используются названия строк данных; этот параметр не будет работать, если у строк нет названий.
tr: Bar grafiğine bir gösterge eklenmeli mi? Açıklamayı oluşturmak için verinin satır adları kullanılacaktır, dolayısıyla satırlar adlandırılmamışsa bu seçeneğin hiçbir etkisi yoktur.

source: Select between grey and rainbow colors.
ar: اختر بين الألوان الرمادية وألوان قوس قزح.
eo: Elektu inter grizaj kaj ĉielarkaj koloroj.
ru: Выбор между оттенками серого и цветами радуги.
tr: Gri ve gökkuşağı renkleri arasında seçim yapın.

source: Select a type between juxtaposed bars and stacked bars. This setting is only meaningful for two-dimensional data. If you choose stacked bars you can not display bar values, below.
ar: اختر نوعًا بين الأشرطة المتجاورة والأشرطة المكدسة. هذا الإعداد ذو مغزى فقط للبيانات ثنائية الأبعاد. إذا اخترت أشرطة مكدسة فلا يمكنك عرض قيم الشريط، في الأسفل.
eo: Elektu tipon inter apudmetitaj stangoj kaj stakitaj stangoj. Ĉi tiu agordo estas signifa nur por dudimensiaj datumoj. Se vi elektas staplitajn stangojn vi ne povas montri stangajn valorojn, sube.
ru: Выбор типа: расположенные рядом столбцы или составные столбцы. Этот параметр касается только двухмерных данных. Если выбрать составные столбцы, то показ значений столбцов ниже будет невозможен.
tr: Yan yana çubuklar ve yığılmış çubuklar arasından bir tür seçin. Bu ayar yalnızca iki boyutlu veriler için anlamlıdır. Yığılmış çubukları seçerseniz aşağıdaki çubuk değerlerini görüntüleyemezsiniz.

source: Select if you want to display bar values (labels).
ar: اختر إذا أردت عرض قيم الشريط (لصائق).
eo: Elektu se vi volas montri strekvalorojn (etikedojn).
ru: Укажите, следует ли показывать значения столбцов (подписи).
tr: Çubuk değerlerini (etiketleri) görüntülemek istiyorsanız seçin.

source: If you have selected to display bar values (labels) you can select where should they be displayed:
ar: إذا اخترت عرض قيم الشريط (لصائق) يمكنك اختيار أين يجب عرضها:
eo: Se vi elektis montri strekvalorojn (etikedojn), vi povas elekti kie ili estu montrataj:
ru: Если отображение значений столбцов (подписей) включено, можно выбрать, где они будут показаны:
tr: Çubuk değerlerini (etiketleri) görüntülemeyi seçtiyseniz bunların nerede görüntüleneceğini seçebilirsiniz:

source: Above the bars
ar: فوق الأشرطة
eo: Super la stangoj
ru: Над столбцами
tr: Çubukların üstünde

source: Beside the bars
ar: بجانب الأشرطة
eo: Apud la stangoj
ru: Рядом со столбцами
tr: Çubukların yanında

source: Inside the bars
ar: داخل الأشرطة
eo: Ene de la kradoj
ru: Внутри столбцов
tr: Çubukların içinde

source: Generic plot options. See <link href="rkward://component/plot_options"/>.
ar: خيارات الرسم البياني العامة. انظر <link href="rkward://component/plot_options"/>.
eo: Ĝeneralaj grafiko-elektebloj. Vidu <link href="rkward://component/plot_options"/>.
ru: Универсальные параметры графика. Подробнее здесь: <link href="rkward://component/plot_options"/>.
tr: Genel grafik seçenekleri. <link href="rkward://component/plot_options"/> bölümüne bakın.

source: This plugin is meant to be embedded in other plugins. It does not by itself provide a means to select input data. When embedding this plugin, you will be interested in the following properties:
ar: القصد من هذه الإضافة هو تضمينها في إضافات أخرى. لا توفِّر بحد ذاتها وسيلة لاختيار بيانات الإدخال. عند تضمين هذه الإضافة، ستهتم بالخصائص التالية:
eo: Ĉi tiu kromaĵo estas intencita esti enigita en aliaj kromprogramoj. Ĝi per si mem ne provizas rimedon por elekti enigajn datumojn. Enkorpigante ĉi tiun kromaĵon, vi interesiĝos pri la jenaj propraĵoj:
ru: Этот модуль предназначен для встраивания в другие модули. Сам по себе он не предоставляет средство выбора входных данных. При встраивании этого модуля важны следующие свойства:
tr: Bu eklentinin diğer eklentilere gömülmesi amaçlanmaktadır. Tek başına girdi verilerini seçmek için bir araç sağlamaz. Bu eklentiyi gömerken aşağıdaki özellikler ilginizi çekecektir:

source: <i>xvar</i>: The name of the data variable. You can connect this to a varslot, or set it to a fixed string such as "x". This is required.
ar: <i>xvar</i>: اسم متغير البيانات. يمكنك توصيله بموضع متغير، أو اضبِطه على سلسلة نصية ثابتة مثل "x". هذا مطلوب.
eo: <i>xvar</i>: La nomo de la datuma variablo. Vi povas konekti ĉi tion al varslot, aŭ agordi ĝin al fiksa ĉeno kiel "x". Ĉi tio estas postulata.
ru: <i>xvar</i>: имя переменной данных (является обязательным). Можно связать со слотом переменной (varslot) или установить в значение фиксированной строки (например, «x»).
tr: <i>xvar</i>: Veri değişkeninin adı. Bunu bir varslot’a bağlayabilir veya ‘x’ gibi sabit bir diziye ayarlayabilirsiniz. Bu gereklidir.

source: <i>code.preprocess</i>: Provides a summary of parameters to be used in a call to <b>rk.header()</b>, if you have a use for it.
ar: <i>code.preprocess</i>: يوفر ملخصًا للوسائط التي يجب استعمالها في استدعاء لـ <b>rk.header()</b>، إذا كان لديك استعمال له.
eo: <i>code.preprocess</i>: Provizas resumon de parametroj uzeblaj en voko al <b>rk.header()</b>, se vi havas uzon por ĝi.
ru: <i>code.preprocess</i>: предоставляет сводку параметров для использования в вызове функции <b>rk.header()</b>, если в этом есть необходимость.
tr: <i>code.preprocess</i>: Eğer bir kullanımınız varsa <b>rk.header()</b> çağrısında kullanılacak parametrelerin bir özetini sağlar.

source: <i>code.printout</i>: The actual commands needed to construct the barplot.
ar: <i>code.printout</i>: الأوامر الفعلية المطلوبة لبناء الرسم البياني الشريطي.
eo: <i>code.printout</i>: La realaj ordonoj necesaj por konstrui la barploton.
ru: <i>code.printout</i>: фактические команды, необходимые для построения столбчатого графика.
tr: <i>code.printout</i>: Bar grafiğini oluşturmak için gereken gerçek komutlar.

source: Draw Legend
ar: ارسم وسيلة الإيضاح
eo: Desegnu Legendon
ru: Рисовать легенду
tr: Göstergeyi çiz

source: Colors
ar: الألوان
eo: Koloroj
ru: Цвета
tr: Renkler

source: Default (grayscale)
ar: مبدئي (تدرج رمادي)
eo: Defaŭlta (grizskalo)
ru: По умолчанию (оттенки серого)
tr: Öntanımlı (Gri tonlu)

source: Rainbow colors
ar: ألوان قوس قزح
eo: Ĉielarkaj koloroj
ru: Цвета радуги
tr: Gökkuşağı renkleri

source: Type
ar: النوع
eo: Tipo
ru: Тип
tr: Tür

source: Juxtaposed
ar: متجاور
eo: Juntametita
ru: Расположенные рядом столбцы
tr: Yan yana

source: Stacked
ar: مكدس
eo: Stakitaj
ru: Составные столбцы
tr: Yığılmış

source: Display values
ar: اعرض القيم
eo: Montru valorojn
ru: Показать значения
tr: Değerleri görüntüle

source: Placement
ar: الموضع
eo: Lokigo
ru: Расположение
tr: Yerleştirme

source: Above Bars
ar: فوق الأشرطة
eo: Supraj Stangoj
ru: Над столбцами
tr: Çubukların üstünde

source: Beside Bars
ar: بجانب الأشرطة
eo: Apudaj Stangoj
ru: Рядом со столбцами
tr: Çubukların yanında

source: Inside Bars
ar: داخل الأشرطة
eo: Enaj Stangoj
ru: Внутри столбцов
tr: Çubukların içinde

source: Simple color picker.
ar: منتقي ألوان بسيط.
eo: Simpla kolorelektilo.
ru: Простое средство выбора цвета.
tr: Yalın renk seçicisi.

source: Pick a color.
ar: اختر لونًا.
eo: Elektu koloron.
ru: Выбор цвета.
tr: Bir renk seçin.

source: This plugin is meant to be used embedded, and you should not really ever see this help page.
ar: القصد من هذه الإضافة هو تضمينها للاستعمال، ويجب ألا ترى صفحة المساعدة هذه أبدًا.
eo: Ĉi tiu kromaĵo estas destinita por esti uzata enigita, kaj vi neniam devus vidi ĉi tiun helppaĝon.
ru: Этот модуль предназначен для использования во встроенном виде, поэтому эта страница справки не должна отображаться.
tr: Bu eklenti gömülü olarak kullanılmak üzere tasarlanmıştır ve bu yardım sayfasını asla görmemelisiniz.

source: The color to use.
ar: اللون الذي يجب استعماله.
eo: La koloro por uzi.
ru: Цвет для использования.
tr: Kullanılacak renk.

source: Choose color
ar: اختر لونًا
eo: Elektu koloron
ru: Выбор цвета
tr: Renk seç

source: Color
ar: اللون
eo: Koloro
ru: Цвет
tr: Renk

source: default
ar: مبدئي
eo: norma
ru: по умолчанию
tr: Öntanımlı

source: Azure
ar: سماوي
eo: Lazuro
ru: Лазурный
tr: Azur Mavisi

source: Black
ar: أسود
eo: Nigra
ru: Чёрный
tr: Siyah

source: Blue
ar: أزرق
eo: Blua
ru: Синий
tr: Mavi

source: Blue1
ar: أزرق1
eo: Blua1
ru: Синий 1
tr: Mavi1

source: Blue2
ar: أزرق2
eo: Blua2
ru: Синий 2
tr: Mavi2

source: Blue3
ar: أزرق3
eo: Blua3
ru: Синий 3
tr: Mavi3

source: Blue4
ar: أزرق4
eo: Blua4
ru: Синий 4
tr: Mavi4

source: Brown
ar: بنّيّ
eo: Bruna
ru: Коричневый
tr: Kahverengi

source: Cyan
ar: سماوي
eo: Cejana
ru: Бирюзовый
tr: Turkuaz

source: Darkviolet
ar: بنفسجي داكن
eo: Malhelvioleto
ru: Тёмно-фиолетовый
tr: Koyu Mor

source: Gold
ar: ذهبي
eo: Oro
ru: Золотой
tr: Altın

source: Gray
ar: رمادي
eo: Griza
ru: Серый
tr: Boz

source: Gray1
ar: رمادي1
eo: Griza1
ru: Серый 1
tr: Boz1

source: Gray2
ar: رمادي2
eo: Griza2
ru: Серый 2
tr: Boz2

source: Gray3
ar: رمادي3
eo: Griza3
ru: Серый 3
tr: Boz3

source: Gray4
ar: رمادي4
eo: Griza4
ru: Серый 4
tr: Boz4

source: Green
ar: أخضر
eo: Verda
ru: Зелёный
tr: Yeşil

source: Green1
ar: أخضر1
eo: Verda1
ru: Зелёный 1
tr: Yeşil1

source: Green2
ar: أخضر2
eo: Verda2
ru: Зелёный 2
tr: Yeşil2

source: Green3
ar: أخضر3
eo: Verda3
ru: Зелёный 3
tr: Yeşil3

source: Green4
ar: أخضر4
eo: Verda4
ru: Зелёный 4
tr: Yeşil4

source: Grey
ar: رمادي
eo: Griza
ru: Серый
tr: Gri

source: Grey1
ar: رمادي1
eo: Griza 1
ru: Серый 1
tr: Gri1

source: Grey2
ar: رمادي2
eo: Griza2
ru: Серый 2
tr: Gri2

source: Grey3
ar: رمادي3
eo: Griza3
ru: Серый 3
tr: Gri3

source: Grey4
ar: رمادي4
eo: Griza4
ru: Серый 4
tr: Gri4

source: Lawngreen
ar: أخضر عشبي
eo: Gazonverda
ru: Травяной зелёный
tr: Çim Yeşili

source: Limegreen
ar: أخضر ليموني
ru: Лаймовый зелёный
tr: Limon Yeşili

source: Linen
ar: كتاني
eo: Tolaĵo
ru: Светло-бежевый
tr: Keten

source: Magenta
ar: أرجواني
eo: Malva
ru: Пурпурный
tr: Mor

source: Magenta1
ar: أرجواني1
eo: Magento1
ru: Пурпурный 1
tr: Mor1

source: Magenta2
ar: أرجواني2
eo: Magento2
ru: Пурпурный 2
tr: Mor2

source: Magenta3
ar: أرجواني3
eo: Magento3
ru: Пурпурный 3
tr: Mor3

source: Magenta4
ar: أرجواني4
eo: Magento4
ru: Пурпурный 4
tr: Mor4

source: Mintcream
ar: كريم النعناع
eo: Mentkremo
ru: Мятно-кремовый
tr: Nane Kreması

source: Mistyrose
ar: وردي ضبابي
ru: Бледно-розовый
tr: Puslu Gül

source: Navajowhite
ar: أبيض نافاجو
eo: Navajoblanka
ru: Грязно-серый
tr: Navaho Beyazı

source: Orange
ar: برتقالي
eo: Oranĝa
ru: Оранжевый
tr: Turuncu

source: Orchid
ar: أرجواني زاهٍ
eo: Orkideo
ru: Светло-лиловый
tr: Orkide

source: Palegreen
ar: أخضر شاحب
eo: Paleverda
ru: Бледно-зелёный
tr: Soluk Yeşil

source: Papayawhip
ar: أبيض البابايا
eo: Papajavipo
ru: Жёлто-оранжевый
tr: Papaya Kırbacı

source: Peachpuff
ar: نفخة الخوخ
ru: Светло-розовый
tr: Şeftali Pufu

source: Pink
ar: وردي
eo: Rozkolora
ru: Розовый
tr: Pembe

source: Red
ar: أحمر
eo: Ruĝa
ru: Красный
tr: Kırmızı

source: Red1
ar: أحمر1
eo: Ruĝa1
ru: Красный 1
tr: Kırmızı1

source: Red2
ar: أحمر2
eo: Ruĝa2
ru: Красный 2
tr: Kırmızı2

source: Red3
ar: أحمر3
eo: Ruĝa3
ru: Красный 3
tr: Kırmızı3

source: Red4
ar: أحمر4
eo: Ruĝa4
ru: Красный 4
tr: Kırmızı4

source: Royalblue
ar: أزرق ملكي
eo: Reĝbluo
ru: Королевский синий
tr: Kraliyet Mavisi

source: Salmon
ar: سلموني
ru: Оранжево-розовый
tr: Somon

source: Sandybrown
ar: بني رملي
eo: Sablobruna
ru: Рыже-коричневый
tr: Kumlu Kahverengi

source: Seagreen
ar: أخضر بحري
eo: Marverda
ru: Сине-зелёный
tr: Deniz Yeşili

source: Sienna
ar: بني محمر
ru: Оранжево-жёлтый
tr: Koyu Kahverengi

source: Skyblue
ar: أزرق سماوي
eo: Ĉielblua
ru: Небесно-голубой
tr: Gök Mavisi

source: Slategrey
ar: رمادي أردوازي
eo: Ardezgrizo
ru: Сизый
tr: Arduvaz Grisi

source: Snow
ar: ثلجي
eo: Neĝo
ru: Снежно-белый
tr: Kar

source: Springgreen
ar: أخضر ربيعي
ru: Светло-зелёный
tr: İlkyaz Yeşili

source: Steelblue
ar: أزرق صلب
eo: Ŝtalbluo
ru: Голубовато-стальной
tr: Çelik Mavisi

source: Tan
ar: أسمر
ru: Светло-коричневый
tr: Taba Rengi

source: Thistle
ar: بنفسجي رمادي
eo: Kardo
ru: Светло-пурпурный
tr: Devedikeni

source: Tomato
ar: أحمر بندورة
ru: Тёмно-красный
tr: Domates

source: Violet
ar: بنفسجي
eo: Viola
ru: Фиолетовый
tr: Menekşe

source: Violetred1
ar: أحمر بنفسجي 1
ru: Фиолетово-красный 1
tr: Menekşe Kırmızısı 1

source: Violetred2
ar: أحمر بنفسجي 2
ru: Фиолетово-красный 2
tr: Menekşe Kırmızısı 2

source: Violetred3
ar: أحمر بنفسجي 3
ru: Фиолетово-красный 3
tr: Menekşe Kırmızısı 3

source: Violetred4
ar: أحمر بنفسجي 4
ru: Фиолетово-красный 4
tr: Menekşe Kırmızısı 4

source: Wheat
ar: حنطي
eo: Tritiko
ru: Тёплый бежевый
tr: Buğday

source: White
ar: أبيض
eo: Blanka
ru: Белый
tr: Beyaz

source: Yellow
ar: أصفر
eo: Flava
ru: Жёлтый
tr: Sarı

source: Yellow1
ar: أصفر1
eo: Flava1
ru: Жёлтый 1
tr: Sarı1

source: Yellow2
ar: أصفر2
eo: Flava2
ru: Жёлтый 2
tr: Sarı2

source: Yellow3
ar: أصفر3
eo: Flava3
ru: Жёлтый 3
tr: Sarı3

source: Yellow4
ar: أصفر4
eo: Flava4
ru: Жёлтый 4
tr: Sarı4

source: Yellowgreen
ar: أخضر مصفر
eo: Flavverda
ru: Жёлто-зелёный
tr: Sarı Yeşil

source: Break points
ar: نقاط التوقف
eo: Rompopunktoj
ru: Точки разрыва
tr: Kesme noktaları

source: Approximately %1 cells
ar: حوالي %1 خلية
eo: Proksimume %1 ĉeloj
ru: Приблизительно %1 ячеек
tr: Yaklaşık olarak %1 hücre

source: Integers
ar: أعداد صحيحة
eo: Entjeroj
ru: Целые числа
tr: Tamsayılar

source: Equally spaced vector of length %1
ar: متجه متباعد بالتساوي طوله %1
eo: Egale interspacigita vektoro de longo %1
ru: Вектор равноотстоящих значений с длиной %1
tr: %1 uzunluğunda eşit aralıklı vektör

source: Scale
ar: المقاس
eo: Skali
ru: Масштаб
tr: Ölçek

source: Density
ar: الكثافة
eo: Denseco
ru: Плотность
tr: Yoğunluk

source: This plugin provides various options for <b>hist</b> or <b>plot.histogram</b>.
ar: توفر هذه الإضافة خيارات مختلفة لـ <b>hist</b> أو <b>plot.histogram</b>.
eo: Ĉi tiu kromaĵo provizas diversajn elekteblojn por <b>hist</b> aŭ <b>plot.histogram</b>.
ru: Этот модуль предоставляет различные параметры для <b>hist</b> или <b>plot.histogram</b>.
tr: Bu eklenti, <b>hist</b> veya <b>plot.histogram</b> için çeşitli seçenekler sunar.

source: This plugin is mostly used as an embedded plugin. All the GUI elements here set various parameters to either hist or plot.histogram functions. For parameter specific help see the respective R references. Few parameter combinations might not produce any sensible plot, so read the R references to make a judicious choice of parameters.
ar: تُستعمَل هذه الإضافة غالبًا كإضافة مضمنة. تضبِط جميع عناصر الواجهة الرسومية هنا وسائط مختلفة إما لدالتي hist أو plot.histogram. للمساعدة الخاصة بالوسيط، انظر المراجع الخاصة بـ R. قد لا تُنتِج مجموعات قليلة من الوسائط أي رسم بياني معقول، لذا اقرأ مراجع R لاتخاذ خيار حصيف من الوسائط.
eo: Ĉi tiu kromaĵo estas plejparte uzata kiel enigita kromaĵo. Ĉiuj GUI-elementoj ĉi tie starigas diversajn parametrojn al aŭ hist aŭ plot.histogram-funkcioj. Por parametra specifa helpo vidu la respektivajn R-referencojn. Malmultaj parametraj kombinaĵoj eble ne produktas ajnan senchavan grafikon, do legu la R-referencojn por fari prudentan elekton de parametroj.
ru: Этот модуль чаще всего используется в качестве встроенного. Все элементы графического интерфейса пользователя здесь устанавливают различные параметры функции «hist» или «plot.histogram». Информация о конкретных параметрах доступна в соответствующих разделах справки R. При некоторых сочетаниях параметров будет невозможно получить полезный график, поэтому внимательно выбирайте их (обращайтесь к справке R).
tr: Bu eklenti çoğunlukla gömülü eklenti olarak kullanılır. Buradaki tüm kullanıcı arayüzü ögeleri, hist veya arsa.histogram işlevlerine çeşitli parametreler ayarlar. Parametreye özel yardım için ilgili R başvurusuna bakın. Birkaç parametre kombinasyonu anlamlı bir grafik oluşturmayabilir; bu nedenle, mantıklı bir parametre seçimi yapmak için R başvurularını okuyun.

source: Check this box if the histogram is to be added to the current plot. This is the <i>add</i> parameter.
ar: نشِّط هذا المربع إذا أُرِيدَ إضافة المدرج التكراري إلى الرسم البياني الحالي. هذا هو الوسيط <i>add</i>.
eo: Marku ĉi tiun skatolon se la histogramo estas aldonota al la nuna grafikaĵo. Ĉi tio estas la parametro <i>aldoni</i>.
ru: Установите этот флажок, если гистограмму следует добавить к текущему графику. Это параметр <i>add</i>.
tr: Histogramın geçerli grafiğe eklenmesi gerekiyorsa bu kutuyu işaretleyin. Bu, <i>add</i> parametresidir.

source: This is the <i>freq</i> parameter.
ar: هذا هو الوسيط <i>freq</i>.
eo: Ĉi tio estas la parametro <i>freq</i>.
ru: Это параметр <i>freq</i>.
tr: Bu, <i>freq</i> parametresidir.

source: This is the <i>label</i> parameter.
ar: هذا هو الوسيط <i>label</i>.
eo: Ĉi tio estas la parametro <i>etikedo</i>.
ru: Это параметр <i>label</i>.
tr: Bu, <i>label</i> parametresidir.

source: This is the <i>right</i> parameter.
ar: هذا هو الوسيط <i>right</i>.
eo: Ĉi tio estas la <i>dekstra</i> parametro.
ru: Это параметр <i>right</i>.
tr: Bu, <i>right</i> parametresidir.

source: This is the <i>include.lowest</i> parameter.
ar: هذا هو الوسيط <i>include.lowest</i>.
eo: Ĉi tiu estas la parametro <i>include.lowest</i>.
ru: Это параметр <i>include.lowest</i>.
tr: Bu, <i>include.lowest</i> parametresidir.
