Repository: KDE/rkward
Catalog: po/*/rkward__graphics_device.po
Languages: ar, eo, tr

source: Select "Other" in the option above to use this setting. Specify the device identifier as used by ghostscript. Running "ghostscript --help" (or "gs --help") in a terminal should give a list of available devices.
ar: اختر "أخرى" في الخيار أعلاه لـتستخدم هذا الإعداد. حدّد معرف الجهاز كما يستخدمه ghostscript. تشغيل "ghostscript --help" (أو "gs --help") في طرفية ينبغي أن يوفر قائمة بالأجهزة المتوفرة.
eo: Elektu "Aliaj" en la supra opcio por uzi ĉi tiun agordon. Indiku la aparato-identigilon kiel uzatan de ghostscript. Ruli "ghostscript --help" (aŭ "gs --help") en terminalo devus doni liston de disponeblaj aparatoj.
tr: Bu ayarı kullanmak için yukarıdaki seçenekte ‘Diğer’i seçin. Ghostscript tarafından kullanılan aygıt tanımlayıcısını belirtin. Bir uçbirimde ‘ghostscript --help’ (veya ‘gs --help’) komutunu çalıştırmak, kullanılabilir aygıtların bir listesini vermelidir.

source: Export contents of graphics device to various formats
ar: صدّر محتويات جهاز الرسوميات إلى صيغ مختلفة
eo: Eksportu enhavon de grafika aparato al diversaj formatoj
tr: Grafik aygıtın içeriğini çeşitli biçimlere aktar

source: Filename and Generic options
ar: اسم الملف والخيارات العامة
eo: Dosiernomo kaj Ĝeneralaj opcioj
tr: Dosya adı ve genel seçenekler

source: File name
ar: اسم الملف
eo: Dosiernomo
tr: Dosya adı

source: Automatic File extension
ar: امتداد الملف الآلي
eo: Aŭtomata Dosiera etendo
tr: Otomatik dosya uzantısı

source: Dimensions
ar: الأبعاد
eo: Dimensioj
tr: Boyutlar

source: Automatic Width
ar: العرض الآلي
eo: Aŭtomata Larĝo
tr: Otomatik genişlik

source: Width in inches
ar: العرض بالبوصة
eo: Larĝo en coloj
tr: İnç türünden genişlik

source: Automatic Height
ar: الارتفاع الآلي
eo: Aŭtomata Alteco
tr: Otomatik yükseklik

source: Height in inches
ar: الارتفاع بالبوصة
eo: Alteco en coloj
tr: İnç türünden yükseklik

source: Output format
ar: صيغة الخرج
eo: Formato de eligo
tr: Çıktı biçimi

source: Postscript
eo: Postskribo

source: via Ghostscript
ar: عبر Ghostscript
eo: per Ghostscript
tr: Ghostscript aracılığıyla

source: EPS compatible
ar: متوافق مع EPS
eo: EPS kongrua
tr: EPS uyumlu

source: Generic Export Options
ar: خيارات التصدير العامة
eo: Ĝeneralaj Eksportaj Opcioj
tr: Genel Dışa Aktarma Seçenekleri

source: Default pointsize
ar: حجم النقطة المبدئيّ
eo: Defaŭlta punktodimension
tr: Öntanımlı nokta boyutu

source: Point size
ar: حجم النقطة
eo: Punkta grandeco
tr: Nokta boyutu

source: Default Resolution
ar: الدقة المبدئية
eo: Defaŭlta Rezolucio
tr: Öntanımlı Çözünürlük

source: Resolution (dpi)
ar: الدقة (نقطة في البوصة)
eo: Rezolucio (dpi)
tr: Çözünürlük (DPI)

source: Default Quality
ar: الجودة المبدئية
eo: Defaŭlta Kvalito
tr: Öntanımlı Kalite

source: JPEG Quality
ar: جودة JPEG
eo: JPEG Kvalito
tr: JPEG Kalitesi

source: Postscript/PDF/Ghostscript Options
ar: خيارات Postscript/PDF/Ghostscript
eo: Postscript/PDF/Ghostscript Opcioj
tr: Postscript/PDF/Ghostscript Seçenekleri

source: Paper properties
ar: خصائص الورقة
eo: Paperaj propraĵoj
tr: Kağıt Özellikleri

source: Paper Size
ar: حجم الورقة
eo: Papera Grandeco
tr: Kağıt Boyutu

source: Default
ar: المبدئيّ
eo: Defaŭlta
tr: Öntanımlı

source: Letter
eo: Litero (Letero)
tr: Mektup

source: Legal
eo: Laŭleĝa
tr: Resmi

source: Executive
eo: Plenuma
tr: Yönetim

source: Special
ar: خاص
eo: Speciala
tr: Özel

source: Pagecentre
ar: تمركز الصفحة
eo: Paĝcentro
tr: Sayfa merkezi

source: Horizontal (ps/gs)
ar: أفقي (ps/gs)
eo: Horizontala (ps/gs)
tr: Yatay (ps/gs)

source: Font properties
ar: خصائص الخط
eo: Tiparaj propraĵoj
tr: Yazıtipi özellikleri

source: Font family
ar: عائلة الخط
eo: Tipara familio
tr: Yazıtipi ailesi

source: AvantGarde
eo: Avangardo

source: Courier
eo: Kuriero

source: Helvetica
eo: Helvetika

source: Helvetica Narrow
eo: Helvetica Mallarĝa

source: New Century Schoolbook
eo: Novjarcenta Lernejlibro

source: Serif
eo: Serifa

source: Symbol
eo: Simbolo

source: Times
eo: Tempoj

source: Font Encoding
ar: ترميز الخط
eo: Tipara Kodado
tr: Yazıtipi Kodlaması

source: ISOLatin1
eo: ISOlatino1

source: ISOLatin2
eo: ISOLatino2

source: ISOLatin7
eo: ISOlatino7

source: ISOLatin9
eo: ISOLatino9

source: Title embedded in file
ar: عنوان مضمن في الملف
eo: Titolo enigita en dosiero
tr: Dosyada gömülü başlık

source: Default Title
ar: العنوان المبدئيّ
eo: Defaŭlta Titolo
tr: Öntanımlı Başlık

source: Ghostscript specific options
ar: خيارات Ghostscript الخاصة
eo: Ghostscript specifaj opcioj
tr: Ghostscript’e özel seçenekler

source: GS Output device
ar: جهاز خرج GS
eo: GS Eliga aparato
tr: GS çıktı aygıtı

source: PNG (grayscale)
ar: PNG (تدرج رمادي)
eo: PNG (grizskalo)
tr: PNG (gri tonlu)

source: PNG (256 colors)
ar: PNG (256 لونًا)
eo: PNG (256 koloroj)
tr: PNG (256 renk)

source: PNG (16M colors)
ar: PNG (16 مليون لون)
eo: PNG (16M koloroj)
tr: PNG (16 M renk)

source: Other (specify here):
ar: أخرى (حدد هنا):
eo: Aliaj (specifi ĉi tie):
tr: Diğer (burada belirtin):

source: Other Ghostscript device
ar: جهاز Ghostscript آخر
eo: Alia Ghostscript-aparato
tr: Başka Ghostscript aygıtı

source: PNG (b/w)
ar: PNG (أبيض/أسود)
tr: PNG (s/b)

source: PDF
ar: بي دي اف

source: LaTeX/TikZ
ar: لاتخ/TikZ
