Repository: KDE/rkward
Catalog: po/*/rkward__import_export.po
Languages: eo

source: Text / Comma Separated Values
eo: Teksto/Komo Apartigitaj Valoroj

source: Stata data files
eo: Stataj datumdosieroj

source: Import Excel files (Perl based)
eo: Importi Excel-dosierojn (bazitaj en Perl)

source: Microsoft Excel files (Perl)
eo: Microsoft Excel-dosieroj (Perl)

source: Import Excel files (Java based)
eo: Importi Excel-dosierojn (bazitaj en Java)

source: Microsoft Excel files (Java)
eo: Microsoft Excel-dosieroj (Java)

source: Generic import (rio-based)
eo: Senmarka importo (rio-bazita)

source: Set Working Directory
eo: Agordu Laboran Adresaron

source: Import
eo: Importi

source: Import format
eo: Import formato

source: Export
eo: Eksporti

source: Workspace
eo: Laborspaco

# Author name
source: RKWard Team
eo: RKWard Teamo
