Repository: KDE/rkward
Catalog: po/*/rkward__distributions.po
Languages: ru

source: See RKWard help on <link href="rkward://component/plot_wilcoxon_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_wilcoxon_distribution"/>.

source: Wilcoxon Parameters
ru: Вилкоксона — параметры

source: Number of Observations in first sample (m)
ru: Количество наблюдений в первой выборке (m)

source: Number of Observations in second sample (n)
ru: Количество наблюдений во второй выборке (n)

# Distribution name
source: Wilcoxon
ru: Вилкоксона

source: Central Limit Theorem: Wilcoxon to Normal
ru: Центральная предельная теорема: от распределения Вилкоксона к нормальному распределению

source: Generic settings
ru: Общие параметры

source: Specify the quantity to be calculated (probabilities, densities, or quantiles), and the quantity given (probabilities or quantiles)
ru: Укажите количество, которое следует рассчитать (вероятности, плотности или квантили), и заданное количество (вероятности или квантили)

source: When calculating densities or probabilities, specify the number of evenly spaces quantiles to show. Alternatively, use the setting above.
ru: При расчёте плотностей или вероятностей укажите количество равноотстоящих квантилей для отображения. Альтернативный вариант — использовать параметр выше.

source: When calculating densities or probabilities, specify one or more quantiles. Alternatively, leave this empty to use the setting above, instead.
ru: При расчёте плотностей или вероятностей укажите один или несколько квантилей. Альтернативный вариант — не указывать значение этого параметра (тогда вместо него будет использован параметр выше).

source: When calculating quantiles, specify the number of evenly spaced probabilities (optionally logarithmic) to show. Alternatively, use the setting below.
ru: При расчёте квантилей укажите количество равноотстоящих вероятностей (необязательно логарифмических) для отображения. Альтернативный вариант — использовать параметр ниже.

source: When calculating quantiles, specify one or more probabilities, optionally logarithmic (see below). If this setting is left empty, the setting above is used, instead.
ru: При расчёте квантилей укажите одну или несколько вероятностей, необязательно логарифмических (смотрите ниже). Если значение этого параметра не указано, вместо него будет использоваться параметр выше.

source: When calculating probabilities, return these as log (p). When specifying probabilities, these are supplied as log (p).
ru: При расчёте вероятностей возвращать их как log (p). При указании вероятностей передавать их как log (p).

source: When calculating densities, return these as log (d).
ru: При расчёте плотностей возвращать их как log (d).

source: If checked (the default) probabilities are P[X ≤ x]. Otherwise (upper tail) probabilities are P[X &gt; x]
ru: Если флажок установлен, вероятности (по умолчанию) рассчитываются как P[X ≤ x]. В ином случае (верхний хвост) вероятности рассчитываются как P[X &gt; x]

source: Show a preview of the result.
ru: Предварительный просмотр результата.

source: Distribution specific settings
ru: Параметры, зависящие от распределения

source: Select the desired mode of operation, then specify the values of interest. The input values (quantiles or probabilities) can be left empty, in which case a short sequence of evenly spaced values will be filled in, automatically.
ru: Выберите желаемый режим работы, затем укажите интересующие значения. Входные значения (квантили или вероятности) можно не указывать, тогда автоматически появится короткая последовательность равноотстоящих значений.

source: Mode
ru: Режим

source: Calculate probabilities for given quantiles
ru: Рассчитать вероятности для указанных квантилей

source: Calculate densities at given quantiles
ru: Рассчитать плотности для указанных квантилей

source: Calculate quantiles for given probabilities
ru: Рассчитать квантили для указанных вероятностей

source: Number of quantiles
ru: Количество квантилей

source: Number of probabilities
ru: Количество вероятностей

source: - or -
ru: - или -

source: Specify Quantiles (optional)
ru: Указание квантилей (необязательно)

source: Specify Probabilities (optional)
ru: Указание вероятностей (необязательно)

source: Logarithmic probabilities
ru: Логарифмические вероятности

source: Logarithmic densities
ru: Логарифмические плотности

source: Lower tail
ru: Нижний хвост

source: Exponential distribution
ru: Экспоненциальное распределение

source: Provides a calculator for probabilities, quantiles, and densities in the Exponential distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в экспоненциальном распределении.

source: Rate parameter λ (1/mean)
ru: Интенсивность с параметром λ (1/среднее)

source: <link href="rkward://component/rkward/gamma_probabilities"/> (of which the exponential distribution is a special case)
ru: <link href="rkward://component/rkward/gamma_probabilities"/> (особым случаем является экспоненциальное распределение)

source: F distribution
ru: F-распределение

source: Provides a calculator for probabilities, quantiles, and densities in the F distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в бета-распределении.

source: Numerator degrees of Freedom
ru: Степени свободы числителя

source: Denominator degrees of Freedom
ru: Степени свободы знаменателя

source: Gamma distribution
ru: Гамма-распределение

source: Provides a calculator for probabilities, quantiles, and densities in the gamma distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в гамма-распределении.

source: Shape parameter (k)
ru: Параметр формы (k)

source: Rate parameter β (inverse of scale parameter)
ru: Интенсивность с параметром β (обратный параметр масштаба)

source: <link href="rkward://component/rkward/exponential_probabilities"/> (a special case of the gamma distribution with shape=1)
ru: <link href="rkward://component/rkward/exponential_probabilities"/> (особый случай гамма-распределения с равным единице значением параметра формы)

source: <link href="rkward://rhelp/GammaDist">R help on Gamma Distribution functions</link>
ru: <link href="rkward://rhelp/GammaDist">Справка R по функциям гамма-распределения</link>

source: Geometric distribution
ru: Геометрическое распределение

source: Provides a calculator for probabilities, quantiles, and densities in the Geometric distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в геометрическом распределении.

source: Quantiles in the geometric distribution represent the number of failures in a sequence of Bernoulli trials before the first success.
ru: Квантили в геометрической прогрессии представляют количество неудач в последовательности испытаний Бернулли до первого успеха.

source: Probability of success in each trial. Note that this setting is <b>not</b> affected by the "log probabilities" setting, i.e. always specify the plain probability,
ru: Вероятность успеха в каждом испытании. Обратите внимание: на этот параметр <b>не</b> влияет значение параметра «логарифмических вероятностей», поэтому всегда указывайте здесь обычную вероятность.

source: Quantiles represent the number of failures in a sequence of Bernoulli trials before the first success.
ru: Квантили представляют количество неудач в последовательности испытаний Бернулли до первого успеха.

source: probability of success in each trial
ru: Вероятность успеха в каждом испытании

source: Gumbel distribution
ru: Распределение Гамбела

source: Provides a calculator for probabilities, quantiles, and densities in the Gumbel distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в распределении Гамбела.

source: Location parameter.
ru: Параметр расположения.

source: Scale parameter.
ru: Параметр масштаба.

source: <link href="rkward://rhelp/pgumgel">R help on the gumbel distribution functions from package FAdist</link>
ru: <link href="rkward://rhelp/pgumgel">Справка R по функциям распределения Гамбела из пакета FAdist</link>

source: Hypergeometric distribution
ru: Гипергеометрическое распределение

source: Provides a calculator for probabilities, quantiles, and densities in the Hypergeometric distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в гипергеометрическом распределении.

source: Quantiles represent the number of white balls drawn in k draws without replacement from an urn containing m white and n black balls.
ru: Квантили представляют количество белых шаров, которые были за k попыток без возвращения извлечены из корзины, содержащей m белых и n чёрных шаров.

source: m (Number of white balls in the urn)
ru: m (количество белых шаров в корзине)

source: n (Number of black balls in the urn)
ru: n (количество чёрных шаров в корзине)

source: k (Number of draws from the urn)
ru: k (количество попыток извлечения из корзины)

source: k (Number of balls drawn from the urn)
ru: k (количество шаров, извлечённых из корзины)

source: Log Normal distribution
ru: Логнормальное распределение

source: Provides a calculator for probabilities, quantiles, and densities in the Log-Normal distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в логнормальном распределении.

source: meanlog (mean of the distribution on the log scale)
ru: meanlog (средне распределения по логарифмической шкале)

source: sdlog (standard deviation of the distribution on the log scale)
ru: sdlog (стандартное отклонение распределения по логарифмической шкале)

source: meanlog (mean on log scale)
ru: meanlog (среднее по логарифмической шкале)

source: sdlog (standard deviation on log scale)
ru: sdlog (стандартное отклонение по логарифмической шкале)

source: Logistic distribution
ru: Логистическое распределение

source: Provides a calculator for probabilities, quantiles, and densities in the logistic distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в логистическом распределении.

source: Location parameter μ (corresponds to the mean).
ru: Параметр расположения μ (соответствует среднему).

source: Negative Binomial distribution
ru: Отрицательное биномиальное распределение

source: Provides a calculator for probabilities, quantiles, and densities in the Negative Binomial distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в отрицательном биномиальном распределении.

source: Note: Quantiles represents the number of failures in a sequence of Bernoulli trials before the target number of successes is reached.
ru: Примечание: квантили представляют количество неудач в последовательности испытаний Бернулли до достижения целевого количества успехов.

source: Target number of successes. This need not be an integer.
ru: Целевое количество успехов. Оно необязательно должно быть целым числом.

source: Probability of success in each trial. Note that this setting is <b>not</b> affected by the "log probabilities" setting, i.e. always specify the plain probability.
ru: Вероятность успеха в каждом испытании. Обратите внимание: на этот параметр <b>не</b> влияет значение параметра «логарифмических вероятностей», поэтому всегда указывайте здесь обычную вероятность.

source: Quantiles represent the number of failures in a sequence of Bernoulli trials before the target number of successes is reached.
ru: Квантили представляют количество неудач в последовательности испытаний Бернулли до достижения целевого количества успехов.

source: Probability of success in each trial
ru: Вероятность успеха в каждом испытании

source: Normal distribution
ru: Нормальное распределение

source: Provides a calculator for probabilities, quantiles, and densities in the Normal distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в нормальном распределении.

source: Mean.
ru: Среднее.

source: Standard deviation.
ru: Стандартное отклонение.

source: Various tests for normality of observed measures are available, for instance <link href="rkward://component/rkward/jb_test"/>.
ru: Доступны различные тесты на нормальность наблюдаемых показателей, например: <link href="rkward://component/rkward/jb_test"/>.

source: mu (mean)
ru: мю (среднее)

source: sigma (standard deviation)
ru: сигма (стандартное отклонение)

# Beta distribution
source: Beta
ru: Бета

source: Density and distribution function plots for the Beta distribution.
ru: Графики функций плотности и распределения для бета-распределения.

source: shape1 parameter of the Beta distribution.
ru: Первый параметр формы бета-распределения.

source: shape2 parameter of the Beta distribution.
ru: Второй параметр формы бета-распределения.

source: Non-centrality parameter of the Beta distribution.
ru: Параметр нецентральности бета-распределения.

source: Range
ru: Диапазон

source: Lower quantile
ru: Нижний квантиль

source: Upper quantile
ru: Верхний квантиль

source: Non-centrality parameter (ncp)
ru: Параметр нецентральности (ncp)

source: Plot Beta probabilities
ru: График вероятностей бета-распределения

# Binomial distribution
source: Binomial
ru: Биномиальное

source: Density and distribution function plots for the Binomial distribution.
ru: Графики функций плотности и распределения для биномиального распределения.

source: Plot binomial probabilities
ru: График вероятностей биномиального распределения

# Cauchy distribution
source: Cauchy
ru: Коши

source: Density and distribution function plots for the Cauchy distribution.
ru: Графики функций плотности и распределения для распределения Коши.

source: Plot Cauchy probabilities
ru: График вероятностей распределения Коши

# Chi-square distribution
source: Chi-square
ru: Хи-квадрат

source: Density and distribution function plots for the Chi-squared distribution.
ru: Графики функций плотности и распределения для распределения хи-квадрат.

source: See R reference on Chi-squared distribution.
ru: Смотрите справку R по распределению хи-квадрат.

source: Plot Chi-squared probabilities
ru: График вероятностей распределения хи-квадрат

source: Plot density function
ru: График функции плотности

source: Plot distribution
ru: График распределения

source: Logarithmic
ru: Логарифмический

source: Lower Tail
ru: Нижний хвост

source: Check this box if log of the function values are to be plotted.
ru: Установите этот флажок, если следует построить график логарифма значений функции.

source: This option is valid only for plotting the distribution function. Uncheck this box if the upper tail of the distribution function (P[X > x]) is to be plotted.
ru: Этот параметр действителен только для построения графика функции распределения. Снимите этот флажок, если следует построить верхний хвост функции распределения (P[X > x]).

source: Check this box for previewing the function plot. A new graphics window will pop up and it will be dynamically updated based on the choice of parameters. It may take a while for the window to show up. Sometimes, only an empty graphics device may get displayed, in which case, close the device (dev.off() or may be even graphics.off()), uncheck the box, wait for a while and try again. If it still persists, use only the "Submit" button to view the exported plot in the Output window.
ru: Установите этот флажок для предварительного просмотра графика функции. Появится новое графическое окно, содержимое которого будет динамически обновляться на основе выбранных параметров. На открытие этого окна может потребоваться некоторое время. Иногда программа может показать только пустое окно графического устройства; в этом случае следует закрыть устройство (dev.off() или даже graphics.off()), снять флажок, немного подождать и повторить попытку. Если это не поможет, воспользуйтесь кнопкой «Отправить» для просмотра экспортированного графика в окне вывода.

source: Various plotting parameter settings for the plot. See the help page of "Plot Options" for more details.
ru: Различные параметры построения графика. Более подробные сведения доступны на странице справки раздела «Параметры графика».

source: Choose appropriate values for the various parameters of the distribution and select the type of function. The "Submit" button will export the plot to the "Output" window. To dynamically visualize the plot check the "Preview" box.
ru: Выберите подходящие значения различных параметров распределения, а также тип функции. При нажатии кнопки «Отправить» график будет экспортирован в окно «Вывод». Для выполнения динамической визуализации графика установите флажок «Предварительный просмотр».

source: Density Function, or
ru: Функция плотности

source: Distribution Function
ru: Функция распределения

source: Number of observations (points) for constructing the plot (n).
ru: Количество наблюдений (точек) для построения графика (n).

source: Smallest value at which the function is to be plotted.
ru: Наименьшее значение для построения графика функции.

source: Largest value at which the function is to be plotted. So, the function will be evaluated at 'n' equally spaced points between the lower quantile and the upper quantile (inclusive of end points).
ru: Наибольшее значение для построения графика функции. Таким образом, значение функции будет вычисляться в «n» равноотстоящих точек между нижним квантилем и верхним квантилем (включая конечные точки).

source: Largest value at which the function is to be plotted. Since this is a discrete distribution the function will be evaluated at all the integers between the lower quantile and the upper quantile (inclusive of the end points).
ru: Наибольшее значение для построения графика функции. Так как это дискретное распределение, значение функции будет вычисляться во всех целых числах между нижним квантилем и верхним квантилем (включая конечные точки).

source: Number of Observations
ru: Количество наблюдений

# Exponential distribution
source: Exponential
ru: Экспоненциальное

source: Density and distribution function plots for the Exponential distribution.
ru: Графики функций плотности и распределения для экспоненциального распределения.

source: See R reference on Exponential distribution.
ru: Смотрите справку R по экспоненциальному распределению.

source: Plot Exponential probabilities
ru: График вероятностей экспоненциального распределения

source: Density and distribution function plots for the F distribution.
ru: Графики функций плотности и распределения для F-распределения.

source: See R reference on F distribution.
ru: Смотрите справку R по F-распределению.

source: Plot F probabilities
ru: График вероятностей F-распределения

# Gamma distribution
source: Gamma
ru: Гамма

source: Density and distribution function plots for the Gamma distribution.
ru: Графики функций плотности и распределения для гамма-распределения.

source: See R reference on Gamma distribution.
ru: Смотрите справку R по гамма-распределению.

source: Plot Gamma probabilities
ru: График вероятностей гамма-распределения

# Geometric distribution
source: Geometric
ru: Геометрическое

source: Density and distribution function plots for the Geometric distribution.
ru: Графики функций плотности и распределения для геометрического распределения.

source: See R reference on Geometric distribution.
ru: Смотрите справку R по геометрическому распределению.

source: Plot geometric probabilities
ru: График вероятностей геометрического распределения

# Hypergeometric distribution
source: Hypergeometric
ru: Гипергеометрическое

source: Density and distribution function plots for the Hypergeometric distribution.
ru: Графики функций плотности и распределения для гипергеометрического распределения.

source: See R reference on Hypergeometric distribution.
ru: Смотрите справку R по гипергеометрическому распределению.

source: Upper quantile (at most k)
ru: Верхний квантиль (не больше k)

source: Plot hypergeometric probabilities
ru: График вероятностей гипергеометрического распределения

# Logistic distribution
source: Logistic
ru: Логистическое

source: Density and distribution function plots for the Logistic distribution.
ru: Графики функций плотности и распределения для логистического распределения.

source: See R reference on Logistic distribution.
ru: Смотрите справку R по логистическому распределению.

source: Plot Logistic probabilities
ru: График вероятностей логистического распределения

# Log-Normal distribution
source: Log-Normal
ru: Логнормальное

source: Density and distribution function plots for the Lognormal distribution.
ru: Графики функций плотности и распределения для логнормального распределения.

source: See R reference on Lognormal distribution.
ru: Смотрите справку R по логнормальному распределению.

source: Parameters (on log scale)
ru: Параметры (по логарифмической шкале)

source: Plot Lognormal probabilities
ru: График вероятностей логнормального распределения

# Negative Binomial distribution
source: Negative Binomial
ru: Отрицательное биномиальное

source: Density and distribution function plots for the Negative Binomial distribution.
ru: Графики функций плотности и распределения для отрицательного биномиального распределения.

source: This is the <i>size</i> parameter when the 'probability' form of the parametrization is used. This is always a non-negative integer. See R reference on Negative Binomial distribution.
ru: Это параметр <i>size</i>, когда используется форма параметризации «вероятность». Значением всегда является неотрицательное целое число. Смотрите справку R по отрицательному биномиальному распределению.

source: This is the <i>size</i> parameter when the 'mu' form of the parametrization is used. This is a non-negative real number. See R reference on Negative Binomial distribution.
ru: Это параметр <i>size</i>, когда используется форма параметризации «мю». Значением является неотрицательное вещественное число. Смотрите справку R по отрицательному биномиальному распределению.

source: See R reference on Negative Binomial distribution.
ru: Смотрите справку R по отрицательному биномиальному распределению.

source: The type of the parametrization to be used. See R reference on Negative Binomial distribution.
ru: Тип параметризации, который будет использоваться. Смотрите справку R по отрицательному биномиальному распределению.

source: Dispersion (Size)
ru: Разброс (размер)

source: Mean (alternate parameter, mu)
ru: Среднее (альтернативный параметр, мю)

source: Plot negative binomial probabilities
ru: График вероятностей отрицательного биномиального распределения

# Normal distribution
source: Normal
ru: Нормальное

source: Density and distribution function plots for the Normal distribution.
ru: Графики функций плотности и распределения для нормального распределения.

source: See R reference on Normal distribution.
ru: Смотрите справку R по нормальному распределению.

source: Plot Normal probabilities
ru: График вероятностей нормального распределения

# Poisson distribution
source: Poisson
ru: Пуассона

source: Density and distribution function plots for the Poisson distribution.
ru: Графики функций плотности и распределения для распределения Пуассона.

source: See R reference on Poisson distribution.
ru: Смотрите справку R по распределению Пуассона.

source: Plot Poisson probabilities
ru: График вероятностей распределения Пуассона

# t distribution
source: Student t
ru: t Стьюдента

source: Density and distribution function plots for the t distribution.
ru: Графики функций плотности и распределения для t-распределения.

source: See R reference on t distribution.
ru: Смотрите справку R по t-распределению.

source: Plot Student T probabilities
ru: График вероятностей t-распределения Стьюдента

# Tukey distribution
source: Studentized Range (Tukey)
ru: Стьюдентизированный диапазон (Тьюки)

source: Distribution function plot for the Studentized Range (Tukey) distribution.
ru: График функции распределения для распределения стьюдентизированного диапазона (Тьюки)
