Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: <i>Note:</i> Debug output is written to %1
ar: <i>ملاحظة:</i> مخرجات التصحيح اكتبها إلى %1
ru: <i>Примечание:</i> вывод отладки записывается в %1
tr: <i>Not:</i> Hata ayıklama çıktısı %1 konumuna yazıldı

source: General
ar: عامّ
ru: Основное
tr: Genel

source: Directory where rkward may store files (setting takes effect after restarting RKWard)
ar: مجلد يخزّن فيه أر كي وارد الملفات (يسري الإعداد بعد إعادة تشغيل أر كي وارد)
ru: Каталог, где rkward может хранить файлы (параметр вступает в силу после перезапуска RKWard)
tr: RKWard’ın dosyaları depolayabileceği dizin (ayar, RKWard yeniden başlatıldıktan sonra etkili olur)

source: Startup behavior
ar: سلوك الإقلاع
ru: Поведение при запуске
tr: Başlangıç davranışı

source: Load .RData-file from startup directory, if available (R option '--restore')
ar: حمّل ملف .RData من مجلد بدء التشغيل، إذا توفر (خيار R '--restore')
ru: Загрузить файл .RData из каталога запуска, если он имеется (параметр R «--restore»)
tr: Varsa başlangıç dizininden .RData dosyasını yükle (“--restore” R seçeneği)

source: Show RKWard Help on Startup
ar: اعرض دليل أر كي وارد عند بدء التشغيل
ru: Показать справку по RKWard при запуске
tr: Başlangıçta RKWard yardımını göster

source: Initial working directory
ar: مجلد العمل مبدئي
ru: Начальный рабочий каталог
tr: Başlangıç çalışma dizini

source: Do not change current directory on startup
ar: لا تغيّر المجلد الحالي عند بدء التشغيل
ru: Не менять текущий каталог при запуске
tr: Başlangıçta geçerli dizini değiştirme

source: RKWard files directory (as specified, above)
ar: مجلد ملفات أر كي وارد (كما هو محدد، أعلاه)
ru: Каталог файлов RKWard (как указано выше)
tr: RKWard dosyaları dizini (aşağıda belirtildiği gibi)

source: User home directory
ar: مجلد منزل المستخدم
ru: Домашний каталог пользователя
tr: Kullanıcı ana dizini

source: Last used directory
ar: آخر مجلد اُستخدم
ru: Последний использовавшийся каталог
tr: Son kullanılan dizin

source: The following directory (please specify):
ar: المجلد التالي (حدد من فضلك):
ru: Следующий каталог (необходимо указать):
tr: Aşağdıaki dizinler (lütfen belirtin):

source: <p>The initial working directory to use. Note that if you are loading a workspace on startup, and you have configured RKWard to change to the directory of loaded workspaces, that directory will take precedence.</p>
ar: <p>مجلد العمل المبدئي للاستخدام. لاحظ أنه إذا كنت تحمل مساحة عمل عند البدء، و ضبط أر كي وارد للتغيير إلى مجلد مساحات العمل المحملة، سيعطى هذا المجلد الأولوية.</p>
ru: <p>Начальный рабочий каталог, который следует использовать программе. Обратите внимание: когда при запуске выполняется загрузка рабочей области, а программа RKWard настроена на смену каталога на каталог загруженных рабочих областей, такой каталог будет иметь приоритет.</p>
tr: <p>Kullanılacak ilk çalışma dizini. Başlangıçta bir çalışma alanı yüklüyorsanız ve RKWard’ı yüklenen çalışma alanlarının dizinine geçecek şekilde yapılandırdıysanız bu dizinin öncelikli olacağını unutmayın.</p>

source: <p>The number of recent files to remember (in the Open Recent R Script File menu).</p>
ar: <p>عدد الملفات الحديثة لتذكرها (في قائمة افتح ملف نص R البرمجي الحديث).</p>
ru: <p>Количество сохраняемых последних файлов (в меню «Последние сценарии R»).</p>
tr: <p>Anımsanacak en son dosyaların sayısı (Son Kullanılan R Betiği Dosyasını Aç menüsünde).</p>

source: Maximum number of recently used files to remember per category
ar: الحد الأقصى لعدد الملفات المستخدمة حديثًا لتذكرها لكل فئة
ru: Максимальное количество сохраняемых последних файлов на категорию
tr: Kategori başına anımsanacak en çok son kullanılan dosya sayısı

source: The workplace layout (i.e. which script-, data-, help-windows are open) may be saved (and loaded) per R workspace, or independent of the R workspace. Which do you prefer?
ar: قد يحفظ (ويحمّل) تخطيط مكان العمل (أي أيّ نوافذ نص برمجي، بيانات، دليل مفتوحة) لكل مساحة عمل R، أو مستقلة عن مساحة عمل R. أيّ تفضل؟
ru: Компоновку рабочей зоны (то, какие окна сценариев, данных и справки открыты) можно сохранить (и загрузить) либо для каждой отдельной рабочей области R, либо независимо от рабочей области R. Какой вариант следует выбрать?
tr: Çalışma alanı yerleşimi (yani hangi betik, veri ve yardım pencerelerinin açık olduğu), R çalışma alanı başına veya R çalışma alanından bağımsız olarak kaydedilebilir (ve yüklenebilir). Hangisini tercih edersiniz?

source: Save/restore with R workspace, when saving/loading R workspace
ar: احفظ/استعد مع مساحة عمل R، عند حفظ/تحميل مساحة عمل R
ru: Выполнять сохранение и восстановление с рабочей областью R при её сохранении и загрузке
tr: R çalışma alanını kaydederken/yüklerken R çalışma alanıyla kaydedin/geri yükle

source: Save/restore independent of R workspace (save at end of RKWard session, restore at next start)
ar: احفظ/استعد مستقلًا عن مساحة عمل R (احفظ في نهاية جلسة أر كي وارد، استعد عند البدء التالي)
ru: Выполнять сохранение и восстановление независимо от рабочей области R (сохранить в конце сеанса RKWard, восстановить при следующем запуске)
tr: R çalışma alanından bağımsız olarak kaydet/geri yükle (RKWard oturumunun sonunda kaydedip bir sonraki başlangıçta geri yükle)

source: Do not save/restore workplace layout
ar: لا تحفظ/تستعد تخطيط مكان العمل
ru: Не сохранять и не восстанавливать компоновку рабочей зоны
tr: Çalışma alanı yerleşimini kaydetme/geri yükleme

source: When loading a workspace, change to the corresponding directory.
ar: عند تحميل مساحة عمل، غيّر إلى المجلد الموافق.
ru: При загрузке рабочей области сменить каталог на указанный.
tr: Bir çalışma alanını yüklerken ilgili dizine geçin.

source: Warn when editing objects with more than this number of fields (0 for no limit):
ar: حذّر عند تحرير الكائنات بأكثر من هذا العدد من الحقول (0 بلا حد):
ru: Предупреждать при редактировании объектов, количество полей которых превышает указанное (0 — без ограничений):
tr: Bu sayıdan daha çok alana sahip nesneleri düzenlerken uyar (sınırsız için 0):

source: MDI window focus behavior
ar: سلوك تركيز نافذة MDI
ru: Фокус в окне многодокументного интерфейса
tr: MDI penceresi odak davranışı

source: Click to focus
ar: انقر للتركيز
ru: Фокус по щелчку
tr: Odak için tıkla

source: Focus follows mouse
ar: التركيز يتبع الفأرة
ru: Фокус следует за мышью
tr: Odak fareyi takip eder

source: Onscreen Graphics
ar: رسومات على الشاشة
ru: Экранная графика
tr: Ekran Grafikleri

source: Default graphics device
ar: جهاز الرسومات مبدئي
ru: Графическое устройство по умолчанию
tr: Öntanımlı grafik aygıtı

source: RKWard native device
ar: جهاز أر كي وارد الأصيل
ru: Собственное устройство RKWard
tr: RKWard yerel aygıtı

source: Platform default device
ar: جهاز النظام مبدئي
ru: Устройство платформы по умолчанию
tr: Platform öntanımlı aygıtı

source: <p>The default device to be used for plotting, i.e. when new plot is created, while no graphics device is active (see <i>options("device")</i>).</p><p>The RKWard native device is the recommended choice for most users. This corresponds to the R command <i>RK()</i>.</p><p>The 'Platform default device' corresponds to one of <i>X11()</i>, <i>windows()</i>, or <i>quartz()</i>, depending on the platform.</p><p>You can also specify the name of a function such as <i>Cairo</i>.</p>
ar: <p>الجهاز مبدئي للاستخدام في الرسم، أي عندما تنشأ رسمة جديدة، بينما لا يكون أي جهاز رسومات فعالًا (انظر <i>options("device")</i>).</p><p>جهاز أر كي وارد الأصيل هو الخيار الموصى به لمعظم المستخدمين. هذا يوافق أمر R <i>RK()</i>.</p><p>'جهاز النظام مبدئي' يوافق أحد <i>X11()</i>، <i>windows()</i>، أو <i>quartz()</i>، اعتمادًا على النظام.</p><p>يمكنك أيضًا تحديد اسم دالة مثل <i>Cairo</i>.</p>
ru: <p>Устройство по умолчанию для построения графиков, то есть устройство, которое будет использоваться при создании нового графика, когда нет активного графического устройства (смотрите <i>options("device")</i>).</p><p>Большинству пользователей подойдёт собственное устройство RKWard. Оно назначается с помощью команды R <i>RK()</i>.</p><p>«Устройство платформы по умолчанию» соответствует одному из следующих вариантов: <i>X11()</i>, <i>windows()</i> или <i>quartz()</i> (в зависимости от платформы).</p><p>Также можно указать имя функции, например <i>Cairo</i>.</p>
tr: <p>Grafik için kullanılacak öntanımlı aygıt, yani hiçbir grafik aygıtı etkin değilken yeni grafik oluşturulduğunda (bkz. <i>options("aygıt")</i>).</p><p>RKWard yerel aygıtı, çoğu kullanıcı için önerilen seçimdir. Bu, <i>RK()</i> R komutuna karşılık gelir.</p><p>“Platform öntanımlı aygıtı”, platforma bağlı olarak <i>X11()</i>, <i>windows()</i> veya <i>quartz()</i>’dan birine karşılık gelir.</p><p>Ayrıca <i>Cairo</i> gibi bir işlevin adını da belirtebilirsiniz.</p>

source: Other device:
ar: جهاز آخر:
ru: Другое устройство:
tr: Diğer aygıt:

source: Integration of R standard devices
ar: إدماج أجهزة R القياسية
ru: Интеграция стандартных устройств R
tr: R standart aygıtlarının tümleşimi

source: Replace with RKWard device
ar: استبدل بجهاز أر كي وارد
ru: Заменить на устройство RKWard
tr: RKWard aygıtı ile değiştir

source: Embed original device
ar: اغرس الجهاز الأصلي
ru: Встроить исходное устройство
tr: Özgün aygıtı göm

source: No device integration
ar: لا إدماج للجهاز
ru: Без интеграции устройств
tr: Aygıt tümleşimi yok

source: <p>Many scripts use calls to platform specific standard devices (<i>X11()</i>, <i>windows()</i>, <i>quartz()</i>), although any on-screen device could be used at these places. RKWard provides overloads for these standard device functions, which can change their behavior when used in user code:</p><ul><li>The calls can be re-directed to the RKWard native device (<i>RK()</i>). Some, but not all function arguments will be matched, others will be ignored.</li><li>The original platform specific devices can be used, but embedded into RKWard windows. This option is not available on MacOS X.</li><li>The original platform specific devices can be used unchanged, without the addition of RKWard specific features.</li></ul><p>Regardless of this setting, the original devices are always accessible as <i>grDevices::X11()</i>, etc.</p><p>Using a device on a platform where it is not defined (e.g. <i>Windows()</i> on Mac OS X) will always fall back to the <i>RK()</i> device.</p>
ar: <p>تستخدم العديد من السكربتات استدعاءات لأجهزة قياسية خاصة بالمنصة (<i>X11()</i>، <i>windows()</i>، <i>quartz()</i>)، على الرغم من أنه يمكن استخدام أي جهاز على الشاشة في هذه الأماكن. يوفر أر كي وارد تحميلات زائدة لدوال الجهاز القياسية هذه، والتي يمكن أن تغير سلوكها عند استخدامها في رمز المستخدم:</p><ul><li>يمكن إعادة توجيه الاستدعاءات إلى جهاز أر كي وارد الأصلي (<i>RK()</i>). ستطابق بعض وسائط الدالة، وليس كلها، وستتجاهل أخرى.</li><li>يمكن استخدام الأجهزة الأصلية الخاصة بالمنصة، ولكن تضمن في نوافذ أر كي وارد. هذا الخيار غير متاح على ماك أو إس إكس.</li><li>يمكن استخدام الأجهزة الأصلية الخاصة بالمنصة بدون تغيير، بدون إضافة ميزات أر كي وارد الخاصة.</li></ul><p>بغض النظر عن هذا الإعداد، فإن الأجهزة الأصلية متاحة دائمًا كـ <i>grDevices::X11()</i>، إلخ.</p><p>استخدام جهاز على منصة غير محددة عليه (مثل <i>Windows()</i> على ماك أو إس إكس) سيرجع دائمًا إلى جهاز <i>RK()</i>.</p>
ru: <p>Во многих сценариях используются вызовы специфичных для платформы стандартных устройств (<i>X11()</i>, <i>windows()</i>, <i>quartz()</i>), хотя там можно использовать любые экранные устройства. В RKWard предусмотрено переназначение таких функций стандартных устройств, которое может изменить их поведение при использовании в коде пользователя:</p><ul><li>Вызовы можно перенаправлять собственному устройству RKWard (<i>RK()</i>). Для некоторых (но не всех) аргументов функций будет установлено соответствие, остальные будут пропущены.</li><li>Можно воспользоваться исходными специфичными для платформы устройствами, встроенными в окна RKWard. Этот вариант недоступен в MacOS X.</li><li>Исходные специфичные для платформы устройства можно использовать без изменений, без добавления специфичных для RKWard возможностей.</li></ul><p>Каким бы ни было значение этого параметра, исходные устройства всегда доступны как <i>grDevices::X11()</i> и так далее.</p><p>Использование устройства на той платформе, где оно не определено (например, <i>Windows()</i> в Mac OS X), всегда приводит к использованию устройства <i>RK()</i>.</p>
tr: <p>Çoğu betik, platforma özgü standart aygıtlara (<i>X11()</i>, <i>windows()</i>, <i>quartz()</i>) yapılan çağrıları kullanır; ancak ekrandaki herhangi bir aygıt bile buralarda kullanılabilir. RKWard, kullanıcı kodunda kullanıldığında davranışlarını değiştirebilen bu standart aygıt işlevleri için aşırı yüklemeler sağlar:</p><ul><li>Çağrılar RKWard yerel aygıtına (<i>RK()</i>) yeniden yönlendirilebilir. İşlev argümanlarının tümü olmasa da bazıları eşleştirilecek, diğerleri yok sayılacaktır.</li><li>Özgün platforma özel aygıtlar RKWard pencerelerine yerleştirilip kullanılabilir. Bu seçenek macOS’te kullanılamaz.</li><li>Özgün platforma özel aygıtlar, RKWard’a özgü özellikler eklenmeden değiştirilmeden kullanılabilir.</li></ul><p>Bu ayardan bağımsız olarak, özgün aygıtlara her zaman <i>grDevices::X11()</i> vb. olarak erişilebilir.</p><p>Bir aygıtı tanımlanmamış bir platformda kullanmak (örneğin, macOS’te <i>Windows()</i>) her zaman <i>RK()</i> aygıtına geri dönecektir.</p>

source: Default window size (for RK(), or embedded device windows)
ar: حجم النافذة مبدئي (لـ RK()، أو نوافذ الجهاز المغروس)
ru: Стандартный размер окна (для RK() или встроенных окон устройств)
tr: Öntanımlı pencere boyutu (RK() veya gömülü aygıt penceresi için)

source: Default width (inches):
ar: العرض مبدئي (بالبوصة):
ru: Ширина по умолчанию (в дюймах):
tr: Öntanımlı genişlik (inç):

source: Default height (inches)
ar: الارتفاع مبدئي (بالبوصة)
ru: Высота по умолчанию (в дюймах):
tr: Öntanımlı yükseklik (inç)

source: Use KDE printer dialog for printing devices (if available)
ar: استخدم مربع حوار طابعة KDE لأجهزة الطباعة (إذا توفر)
ru: Использовать окно KDE для устройств печати (при доступности)
tr: Yazdırma aygıtları için (varsa) KDE yazıcı iletişim kutusunu kullan

source: Screen device history
ar: سجل جهاز الشاشة
ru: Журнал экранных устройств
tr: Ekran aygıtı geçmişi

source: Maximum number of recorded plots:
ar: الحد الأقصى لعدد المخططات المسجلة:
ru: Максимальное количество записанных графиков:
tr: En çok kayıtlı grafik sayısı:

source: Maximum size of a single recorded plot (in KB):
ar: الحد الأقصى لحجم مخطط مسجل واحد (بالكيلو بايت):
ru: Максимальный размер одного записанного графика (в КБ):
tr: Bir kayıtlı grafiğin en büyük boyutu (KB):

source: Kate Plugins
ar: ملحقات Kate
ru: Модули Kate
tr: Kate Eklentileri

source: <p>Kate plugins to load in RKWard. Note that some loaded plugins will not become visible until certain conditions are met, e.g. you are loading a version controlled file for the <i>Project</i> plugin.</p><p>The plugins listed here have not been developed specifically for RKWard, and several do not make a whole lot of sense in the context of RKWard. Plugins shown in <b>bold</b> have been reported as "useful" by RKWard users.</p>
ar: <p>ملحقات Kate لتحميلها في أر كي وارد. لاحظ أن بعض الملحقات المحملة لا تصبح مرئية حتى تلبي شروط معينة، مثل تحميلك ملفًا متحكمًا في إصداره لملحق <i>المشروع</i>.</p><p>الملحقات المدرجة هنا لم تطور خصيصًا لـ أر كي وارد، والعديد منها لا معنى له في سياق أر كي وارد. الملحقات المعروضة بـ <b>الخط الغامق</b> أبلغ مستخدمو أر كي وارد عنها بأنها "مفيدة".</p>
ru: <p>Модули Kate для загрузки в RKWard. Обратите внимание, что некоторые из загруженных модулей будут отображаться только при соблюдении определённых условий (например, когда загружается находящийся под управлением системы контроля версий файл для модуля <i>Проект</i>).</p><p>Перечисленные здесь модули не разрабатывались специально для RKWard, некоторые из них не принесут особой пользы при работе с программой. Пункты модулей, которые пользователи RKWard считают полезными, обозначены <b>полужирным</b> шрифтом.</p>
tr: <p>RKWard içinde yüklenecek Kate eklentileri. Yüklenen bazı eklentilerin belirli koşullar karşılanana kadar görünür hale gelmeyeceğini unutmayın; örneğin, <i>Proje</i> eklentisi için sürüm denetimli bir dosya yüklerken.</p><p>Burada listelenen eklentiler özel olarak RKWard için geliştirilmemiştir ve birçoğu RKWard bağlamında pek bir anlam ifade etmemektedir. <b>Koyu</b> ile gösterilen eklentiler, RKWard kullanıcıları tarafından “yararlı” olarak rapor edilmiştir.</p>

source: Never fetch the structure of these packages:
ar: لا تجلب أبدًا بنية هذه الحزم:
ru: Никогда не получать структуру этих пакетов:
tr: Bu paketlerin yapısını hiçbir zaman getirme:

source: Add exclusion
ar: أضف استثناء
ru: Добавить исключение
tr: İstisna Ekle

source: Add the name of the package that no structure should be fetched for
ar: أضف اسم الحزمة التي لا يجب جلب هيكلها
ru: Добавить имя пакета, для которого не следует получать структуру
tr: Hiçbir yapının getirilmemesi gereken paketin adını ekle

source: Carbon copy commands to output
ar: انسخ الأوامر إلى المخرجات
ru: Копирование команд в вывод
tr: Komutları çıktıya karbon kopyala

source: Commands entered in the console
ar: الأوامر المدخلة في الطرفية
ru: Команды, введённые в консоли
tr: Konsola girilen komutlar

source: Commands run via the 'Run' menu
ar: الأوامر المشغلة عبر قائمة 'تشغيل'
ru: Команды, запущенные через меню «Запуск»
tr: “Çalıştır” menüsü ile çalıştırılan komutlar

source: Commands originating from dialogs and plugins
ar: الأوامر الصادرة من مربعات الحوار والملحقات
ru: Команды, исходящие от диалогов и модулей
tr: İletişim kutuları ve eklentiler kaynaklı komutlar

source: Also carbon copy the command output
ar: انسخ أيضًا مخرجات الأوامر
ru: Также скопировать данные, выведенные в ответ на команды
tr: Ayrıca komut çıktısını karbon kopyala

source: Output Window options
ar: خيارات نافذة المخرجات
ru: Параметры окна вывода
tr: Çıktı Penceresi Seçenekleri

source: show window on new output
ar: اعرض النافذة عند مخرج جديد
ru: показать окно при новом выводе
tr: yeni çıktıda pencereyi göster

source: raise window on new output
ar: ارفع النافذة عند مخرج جديد
ru: поднять окно при новом выводе
tr: yeni çıktıda pencereyi yükselt

source: Default output (used, while no other output has been set, explicitly) is shared across workspaces(*).
ar: المخرج مبدئي (المستخدم، بينما لا يحدد مخرج آخر، صراحة) مشترك عبر مساحات العمل(*).
ru: Стандартный вывод (используется, если другой вывод не был задан явным образом) является общим для всех рабочих областей (*).
tr: Öntanımlı çıktı (açıkça başka bir çıktı ayarlanmamışken kullanılır) çalışma alanları arasında paylaşılır(*).

source: CSS file to use for output (leave empty for default)
ar: ملف CSS للاستخدام للإخراج (اتركه فارغًا للمبدئي)
ru: Файл CSS, который будет использоваться для вывода (оставьте пустым, чтобы использовать файл по умолчанию)
tr: Çıktı için kullanılacak olan CSS dosyası (öntanımlı için boş bırakın)

source: Select CSS file
ar: اختر ملف CSS
ru: Выбор файла CSS
tr: CSS Dosyası Seç

source: Select a CSS file for custom formatting of the output window. Leave empty to use the default CSS file shipped with RKWard. Note that this setting takes effect, when initializing an output file (e.g. after flushing the output), only.
ar: اختر ملف CSS لتنسيق مخصص لنافذة المخرجات. اتركه فارغًا لاستخدام ملف CSS مبدئي المرفق مع أر كي وارد. لاحظ أن هذا الإعداد يسري، عند تهيئة ملف مخرج (مثل بعد مسح المخرج)، فقط.
ru: Выберите файл CSS для пользовательского форматирования окна вывода. Оставьте пустым, чтобы использовать стандартный поставляемый с RKWard файл CSS. Обратите внимание, что этот параметр вступает в силу только при инициализации файла вывода (например, после сброса буфера вывода).
tr: Çıktı penceresinin özel biçimlendirilmesi için bir CSS dosyası seçin. RKWard ile birlikte gönderilen öntanımlı CSS dosyasını kullanmak için boş bırakın. Bu ayarın yalnızca bir çıktı dosyası başlatılırken (örneğin çıktı temizlendikten sonra) etkili olacağını unutmayın.

source: Graphics
ar: الرسوميات
ru: Графика
tr: Grafikler

source: File format
ar: صيغة ملف
ru: Формат файлов:
tr: Dosya biçimi

source: <Default>
ar: <مبدئي>
ru: <по умолчанию>
tr: <Öntanımlı>

source: JPG quality
ar: جودة JPG
ru: Качество JPEG:
tr: JPG kalitesi

source: Width:
ar: العرض:
ru: Ширина:
tr: Genişlik:

source: Height:
ar: الارتفاع:
ru: Высота:
tr: Yükseklik:

source: RKWard Plugins
ar: ملحقات أر كي وارد
ru: Модули RKWard
tr: RKWard Eklentileri

source: Some plugins are available with both, a wizard-like interface and a traditional dialog interface. If both are available, which mode of presentation do you prefer?
ar: تتوفر بعض الملحقات بكليهما، واجهة تشبه المعالج وواجهة حوار تقليدية. إذا توفر كلاهما، أي نمط عرض تفضل؟
ru: Некоторые модули доступны как с мастероподобным интерфейсом, так и с традиционным диалоговым. Какой вариант следует выбирать в таких случаях?
tr: Bazı eklentiler hem sihirbaz benzeri bir arayüz hem de geleneksel bir iletişim kutusu arayüzü ile kullanılabilir. Her ikisi de varsa hangi sunum kipini tercih edersiniz?

source: Always prefer dialogs
ar: فضل مربعات الحوار دائمًا
ru: Всегда предпочитать диалог
tr: Her zaman iletişim kutularını tercih et

source: Prefer recommended interface
ar: فضل الواجهة الموصى بها
ru: Предпочитать рекомендуемый интерфейс
tr: Her zaman önerilen arayüzü tercih et

source: Always prefer wizards
ar: فضل المعالجات دائمًا
ru: Всегда предпочитать мастер
tr: Her zaman sihirbazları tercih et

source: Configure Active Plugins
ar: اضبط الملحقات النشطة
ru: Настроить активные модули
tr: Etkin Eklentileri Yapılandır

source: Add-ons
ar: الإضافات
ru: Дополнения
tr: Eklentiler
