Repository: KDE/rkward
Catalog: po/*/rkward__import_export.po
Languages: eo

# NAME OF TRANSLATORS
source: Your names
eo: Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
eo: olivermkellogg@gmail.com

source: Encoding
eo: Kodoprezento

source: Convert string encoding
eo: Konverti ĉenkodigon

source: Convert from:
eo: Konverti de:

source: Latin 1
eo: latina 1

source: ISO8859-1 Latin-1 Western European
eo: ISO8859-1 Latin-1 Okcidenteŭropa

source: ISO8859-2 Latin-2 Central European
eo: ISO8859-2 Latin-2 Mezeŭropa

source: ISO8859-3 Latin-3 South European
eo: ISO8859-3 Latin-3 Sudeŭropa

source: ISO8859-4 Latin-4 North European
eo: ISO8859-4 Latin-4 Nordeŭropa

source: ISO8859-5 Latin/Cyrillic
eo: ISO8859-5 latina/cirila

source: ISO8859-6 Latin/Arabic
eo: ISO8859-6 latina/araba

source: ISO8859-7 Latin/Greek
eo: ISO8859-7 latina/greka

source: MS-GREEK
eo: MS-GREKA

source: ISO8859-8 Latin/Hebrew
eo: ISO8859-8 latina/hebrea

source: ISO8859-9 Latin-5 Turkish
eo: ISO8859-9 latina-5 turka

source: ISO8859-10 Latin-6 Nordic
eo: ISO8859-10 latina-6 nordia

source: ISO8859-11 Latin/Thai
eo: ISO8859-11 latina/tajlanda

source: ISO8859-13 Latin-7 Baltic Rim
eo: ISO8859-13 Latin-7 Balta Rando

source: ISO8859-14 Latin-8 Celtic
eo: ISO8859-14 Latin-8 Kelta

source: ISO8859-15 Latin-9 Western European (EUR)
eo: ISO8859-15 Latin-9 Okcidenteŭropa (EUR)

source: ISO8859-16 Latin-10 South-Eastern European
eo: ISO8859-16 Latin-10 Sudorienta Eŭropo

source: Other (specify below)
eo: Aliaj (specifu sube)

source: Other encoding
eo: Alia kodado

source: If special character (e.g. umlauts) do not show up correctly, the data file probably uses a different locale than your R session. In this case, check this option, and specify the correct character encoding below.
eo: Se speciala signo (ekz. umlauts) ne aperas ĝuste, la datumdosiero probable uzas malsaman lokaĵon ol via R-seanco. En ĉi tiu kazo, marku ĉi tiun elekteblon, kaj specifu la ĝustan signokodigon sube.

source: Select character encoding to convert from. The option above needs to be checked, for this to be enabled.
eo: Elektu signan kodigon por konverti. La supra elekteblo devas esti markita, por ke ĉi tio estu ebligita.

source: If none of the encodings above matches, you can specify an encoding here. Note that the available encodings may differ from platform to platform. See <link href="rkward://rhelp/iconvlist"/> for a list of available encodings.
eo: Se neniu el la ĉi-supraj kodigoj kongruas, vi povas specifi ĉi tie kodigon. Notu, ke la disponeblaj kodigoj povas malsami de platformo al platformo. Vidu <link href="rkward://rhelp/iconvlist"/> por listo de disponeblaj kodigoj.

# R code comment
source: copy from the local environment to globalenv()
eo: kopiu de la loka medio al globalenv ()

source: Import text / csv data
eo: Importu tekston/csv-datumojn

source: Import Comma Separated Value files (other delimiters besides comma are supported).
eo: Importu dosierojn kun disigitaj valoroj por komoj (aliaj limigiloj krom komo estas subtenataj).

source: Choose the CSV file to import. An R object containing the data will be created. See <link href="rkward://rhelp/read.table"/>.
eo: Elektu la CSV-dosieron por importi. R-objekto enhavanta la datumojn estos kreita. Vidu <link href="rkward://rhelp/read.table"/>.

source: The filename of the file to import
eo: La dosiernomo de la importota dosiero

source: Select from one of the predefined (most common formats). This setting affects several of the other settings, importantly <i><label id="dec"/></i> and <i><label id="sep"/></i>.
eo: Elektu el unu el la antaŭdifinitaj (plej oftaj formatoj). Ĉi tiu agordo influas plurajn el la aliaj agordoj, grave <i><label id="dec"/></i> kaj <i><label id="sep"/></i>.

source: Whether the first row of the file contains should be interpreted as column names
eo: Ĉu la unua vico de la dosiero enhavas devus esti interpretita kiel kolonnomoj

source: Decimal character used in the imported file
eo: Decimala signo uzata en la importita dosiero

source: If you selected "other" above, specify the character, here.
eo: Se vi elektis "alia" supre, specifu la signon, ĉi tie.

source: The separator character used in the imported file
eo: La apartiga signo uzata en la importita dosiero

source: The name of an R object to store the imported data in. If you choose an existing symbol name, you will be prompted, whether to overwrite this object.
eo: La nomo de R-objekto en kiu stoki la importitajn datumojn. Se vi elektas ekzistantan simbolnomon, oni petos vin, ĉu anstataŭi ĉi tiun objekton.

source: Whether the object should be opened for editing after it was imported
eo: Ĉu la objekto devus esti malfermita por redaktado post kiam ĝi estis importita

source: Show a preview of the imported data. At most the first 50 rows and columns will be shown.
eo: Montru antaŭrigardon de la importitaj datumoj. Maksimume la unuaj 50 vicoj kaj kolumnoj estos montritaj.

source: How to determine row names? Either the rows can be numbered 1...n. Or you can specify a single column containing the row names (typically the first). Or you can provide a character vector of names.
eo: Kiel determini vicnomojn? Aŭ la vicoj povas esti numeritaj 1...n. Aŭ vi povas specifi ununuran kolumnon enhavantan la vicnomojn (tipe la unua). Aŭ vi povas provizi signan vektoron de nomoj.

source: See above. The column containing the row names, given either as a number, or as a column name (in the latter case, make sure to quote the name)
eo: Vidu supre. La kolumno enhavanta la vicnomojn, donitaj aŭ kiel nombro, aŭ kiel kolumnonomo (en ĉi-lasta kazo, nepre citi la nomon)

source: See above. A vector of row names (e.g. c ("row1", "row2", ..., "rown"), but you can also specify the name of an R object containing the names to use)
eo: Vidu supre. Vektoro de vicnomoj (ekz. c ("row1", "row2", ..., "rown"), sed vi povas ankaŭ specifi la nomon de R-objekto enhavanta la nomojn por uzi)

source: Use automatic column names (possibly read from first row of file), or use manually specified names?
eo: Ĉu uzi aŭtomatajn kolonnomojn (eble legitaj de la unua vico de dosiero), aŭ uzi permane specifitajn nomojn?

source: See above. Specify a character vector of column names (e.g. c ("col1", "col2", ..., "coln"), but you can also specify the name of an R object containing the names to use)
eo: Vidu supre. Specifu signan vektoron de kolonnomoj (ekz. c ("col1", "col2", ..., "coln"), sed vi povas ankaŭ specifi la nomon de R-objekto enhavanta la nomojn por uzi )

source: Should column names be checked for validity?
eo: Ĉu kolumnomoj estu kontrolitaj por valideco?

source: Should be class of each column be determined automatically, or specified?
eo: Ĉu klaso de ĉiu kolumno estu aŭtomate aŭ specifita?

source: See above. Specify a character vector with the names of the classes to use for each column.
eo: Vidu supre. Indiku signan vektoron kun la nomoj de la klasoj por uzi por ĉiu kolumno.

source: Should additional columns (not specified above, and not within the first five rows of input) be skipped? See parameter flush in <link href="rkward://rhelp/read.table"/>.
eo: Ĉu pliaj kolumnoj (ne specifitaj supre, kaj ne ene de la unuaj kvin vicoj de enigo) estu preterlasitaj? Vidu parametron flui en <link href="rkward://rhelp/read.table"/>.

source: If checked, and the rows have differing length, they will be padded with empty values in the imported data.
eo: Se markite, kaj la vicoj havas malsaman longon, ili estos plenigitaj kun malplenaj valoroj en la importitaj datumoj.

source: Should a backslash ('\') followed by a character be treated as an escaped character? Otherwise the sequence is read literally.
eo: Ĉu malantaŭa oblikvo ('\') sekvata de signo estu traktata kiel eskapinta signo? Alie la sinsekvo estas legita laŭvorte.

source: Should leading and trailing white space be removed from character fields?
eo: Ĉu gvida kaj malantaŭa blanka spaco estu forigitaj de signokampoj?

source: Should columns containing character data be converted to factors in R, or should they be read as character vectors?
eo: Ĉu kolumnoj enhavantaj signodatenojn estu konvertitaj al faktoroj en R, aŭ ĉu ili estu legitaj kiel signovektoroj?

source: How are missing values (NAs) written in the file to be imported? (Blank fields are also interpreted as NAs in columns that are not strings.)
eo: Kiel mankantaj valoroj (NAoj) estas skribitaj en la dosiero importota? (Malplenaj kampoj ankaŭ estas interpretitaj kiel NAoj en kolumnoj kiuj ne estas ĉenoj.)

source: String delimiter character(s) used in the file
eo: Ĉenaj limsignoj uzata(j) en la dosiero

source: If you selected "other" above, you can specify which quoting character to use, here. Simply enter all character to use (without spaces or comma, e.g. "'@ to use ", ', and @ as string delimiters).
eo: Se vi elektis "alia" supre, vi povas specifi kian citan signon uzi ĉi tie. Simple enigu ĉiun uzontan signon (sen spacoj aŭ komo, ekz. "'@ por uzi ", ', kaj @ kiel ĉenlimilojn).

source: This many rows will be skipped at the start of the file. Use, for instance, if the file contains a text header.
eo: Ĉi tiuj multaj vicoj estos preterlasitaj ĉe la komenco de la dosiero. Uzu, ekzemple, se la dosiero enhavas tekstan kaplinion.

source: Maximum number of rows to read (-1 to read all lines)
eo: Maksimuma nombro da vicoj por legi (-1 por legi ĉiujn liniojn)

source: If you enter a single character, here, everything after that character in a line will be ignored. Leave blank to disable detection of comments.
eo: Se vi enigas ununuran signon, ĉi tie, ĉio post tiu signo en linio estos ignorita. Lasu malplena por malebligi detekton de komentoj.

source: Should blank lines be ignored?
eo: Ĉu malplenaj linioj estu ignoritaj?

source: Import Text / CSV data
eo: Importu Tekstojn/CSV-datumojn

source: General
eo: Ĝenerala

source: File name
eo: Dosiernomo

source: Data format
eo: Formato de datumoj

source: Comma separated values (CSV)
eo: Komo apartigitaj valoroj (CSV)

source: Semicolon separated values, comma as decimal separator (CSV2)
eo: Punktokomo apartigitaj valoroj, komo kiel dekuma apartigilo (CSV2)

source: Tab separated values (TAB)
eo: Tabetaj apartigitaj valoroj (TAB)

source: Tab separated values, comma as decimal separator (TAB2)
eo: Tabetaj apartigitaj valoroj, komo kiel dekuma apartigilo (TAB2)

source: read.table() default (whitespace separated values)
eo: read.table () defaŭlta (blankspacoj apartigitaj valoroj)

source: Custom
eo: Propra

source: Use first row as column names
eo: Uzu la unuan vicon kiel kolonnomojn

source: Decimal point character
eo: Decimalpunkta signo

source: '.' (Period)
eo: '.' (Periodo)

source: ',' (Comma)
eo: ',' (Komo)

source: Specify decimal point character
eo: Indiku dekumpunkta signo

source: Field separator character
eo: Signo disigilo de kampo

source: Tab
eo: Langeto

source: ';' (Semicolon)
eo: ';' (Puntokomo)

source: Single space
eo: Ununura spaco

source: Any whitespace
eo: Ajna blankspaco

source: Specify field separator character
eo: Indiku kampan apartigilon

source: Object to save to
eo: Objekto por konservi

source: Open imported data for editing
eo: Malfermu importitajn datumojn por redaktado

source: Preview
eo: Antaŭrigardo

source: Rows and Columns
eo: Vicoj kaj Kolumnoj

source: Row Specifications
eo: Vico Specifoj

source: Row names
eo: Vicnomoj

source: Automatic
eo: Aŭtomate

source: Numeric row names
eo: Nombraj vicnomoj

source: As specified in column x:
eo: Kiel specifite en kolumno x:

source: Use a vector
eo: Uzu vektoron

source: Column number or variable name
eo: Kolumna nombro aŭ variablo nomo

source: Vector of row names (quoted)
eo: Vektoro de vicnomoj (citita)

source: Column Specifications
eo: Kolumnaj Specifoj

source: Column names
eo: Nomoj de kolumnoj

source: Use a character vector
eo: Uzu signan vektoron

source: Vector of column names (quoted)
eo: Vektoro de kolonnomoj (citita)

source: Check syntax of column names
eo: Kontrolu sintakson de kolonnomoj

source: Classes of columns
eo: Klasoj de kolumnoj

source: Vector of column classes (quoted)
eo: Vektoro de kolonklasoj (citita)

source: Skip trailing fields
eo: Preterpasi malantaŭajn kampojn

source: Pad rows if unequal length
eo: Kusenetaj vicoj se neegala longo

source: Further Options
eo: Pliaj Opcioj

source: String handling
eo: Kordomanipulado

source: Allow escaped characters
eo: Permesu eskapitajn signojn

source: Strip leading and trailing whitespace
eo: Forigi gvidan kaj malantaŭan blankspacon

source: Convert character columns to factors
eo: Konverti signajn kolumnojn al faktoroj

source: Convert to factor
eo: Konverti al faktoro

source: Default
eo: Defaŭlta

source: Do not convert
eo: Ne konvertiĝu

source: Missing value string
eo: Mankas valorĉeno

source: String delimiter
eo: Limigilo de ĉenoj

source: " only
eo: " nur

source: ' only
eo: ' nur

source: " and '
eo: " kaj '

source: None / disabled
eo: Neniu / malebligita

source: Specify quoting character(s)
eo: Indiku citan(j)n signo(j)n

source: Skip
eo: Preterlasi

source: Skip x lines at the start of the file
eo: Saltu x liniojn ĉe la komenco de la dosiero

source: Max number of lines to read (-1 for no limit)
eo: Maksimuma nombro da linioj por legi (-1 por neniu limo)

source: Character for comments
eo: Signo por komentoj

source: Skip blank lines
eo: Saltu malplenajn liniojn

# R code comment
source: assign to globalenv()
eo: asigni al globalenv()

source: Generic data import
eo: Importado de ĝeneralaj datumoj

source: Import a variety of formats. This is a generic approach based on the "rio" R package, which in turn depends on a variety of further packages. If there is a dedicated plugin for the format you wish to import, using that will usually be preferable, as it will provide more specific options, and with less packages to install.
eo: Importu diversajn formatojn. Ĉi tio estas ĝenerala aliro bazita sur la pakaĵo "rio" R, kiu siavice dependas de diversaj pliaj pakaĵoj. Se ekzistas dediĉita kromaĵo por la formato kiun vi volas importi, uzi tion kutime estos preferinda, ĉar ĝi provizos pli specifajn elekteblojn, kaj kun malpli da pakaĵoj por instali.

source: Select the data file to import. An R object containing the data will be created. This will usually be a data.frame, or a list.
eo: Elektu la datumdosieron por importi. R-objekto enhavanta la datumojn estos kreita. Ĉi tio kutime estos data.frame, aŭ listo.

source: Whether the object should be opened for editing after it was imported. Currently, this is only possible, if the object is saved as a data.frame (see next option).
eo: Ĉu la objekto devus esti malfermita por redaktado post kiam ĝi estis importita. Nuntempe, tio nur eblas, se la objekto estas konservita kiel data.frame (vidu sekvan elekteblon).

source: Some data files may contain more than one set of data (e.g. several sheets inside one excel file). Check this option to import all datasets as a list.
eo: Iuj datumdosieroj povas enhavi pli ol unu aron da datumoj (ekz. pluraj folioj ene de unu excel-dosiero). Marku ĉi tiun elekteblon por importi ĉiujn datumarojn kiel liston.

source: For datasets containing more than one set of data, specify which set to import (this will usually be a name or a number).
eo: Por datumaroj enhavantaj pli ol unu aron da datumoj, specifu kiun aron importi (tio kutime estos nomo aŭ nombro).

source: Preview imported data. Only the first 50 rows and columns are shown, for performance reasons (and only the first dataset in case of multiple sets in the file).
eo: Antaŭrigardu importitajn datumojn. Nur la unuaj 50 vicoj kaj kolumnoj estas montritaj, pro agado-kialoj (kaj nur la unua datumaro en kazo de pluraj aroj en la dosiero).

source: Edit Object
eo: Redaktu Objekton

source: If the file contains more than one dataset
eo: Se la dosiero enhavas pli ol unu datumaron

source: Import a list of all datasets
eo: Importu liston de ĉiuj datumaroj

source: Import specific sub-set
eo: Importi specifan subaron

# R code comment
source: set variable labels for use in RKWard
eo: starigu variajn etikedojn por uzi en RKWard

source: Import SPSS data
eo: Importu SPSS-datumojn

source: Import SPSS data files.
eo: Importu SPSS-datumdosierojn.

source: Choose the SPSS data file to import. Usually those files have the ending '*.sav'. An R object containing the SPSS data will be created. This can either be a data.frame, or a list. Several options deal with handling labels and character encoding. See <link href="rkward://rhelp/read.spss"/>. Other SPSS files than data files (i. e.:*.por, *.jnl, *.cht, *.spo, *.sps) are not supported. For issues related to handling of time/dates please refere to <link href="http://cran.r-project.org/doc/Rnews/Rnews_2004-1.pdf">R News 4/1 p30-31</link>.
eo: Elektu la SPSS-datumdosieron por importi. Kutime tiuj dosieroj havas la finaĵon '*.sav'. R-objekto enhavanta la SPSS-datenojn estos kreita. Ĉi tio povas aŭ esti data.frame, aŭ listo. Pluraj elektebloj traktas pritraktado de etikedoj kaj signokodigado. Vidu <link href="rkward://rhelp/read.spss"/>. Aliaj SPSS-dosieroj ol datumdosieroj (t.e.:*.por, *.jnl, *.cht, *.spo, *.sps) ne estas subtenataj. Por aferoj rilataj al pritraktado de tempo/datoj bonvolu raporti al <link href="http://cran.r-project.org/doc/Rnews/Rnews_2004-1.pdf">R News 4/1 p30-31 </link>.

source: Whether to save the data as a data.frame. The alternative is saving as a list (useful, if the columns in your SPSS data have different lengths)
eo: Ĉu konservi la datumojn kiel data.frame. La alternativo estas konservi kiel listo (utila, se la kolumnoj en viaj SPSS-datumoj havas malsamajn longojn)

source: RKWard can display SPSS like variable labels. Check this option, if you would like to convert the SPSS variable labels to RKWard format. If you leave the option unchecked, the SPSS variable labels will still be available as an attribute "variable.labels" (see <link href="rkward://rhelp/read.spss"/>)
eo: RKWard povas montri SPSS kiel variajn etikedojn. Marku ĉi tiun elekteblon, se vi ŝatus konverti la SPSS-variablan etikedojn al formato RKWard. Se vi lasas la elekteblon nemarkita, la SPSS-variablaj etikedoj ankoraŭ estos disponeblaj kiel atributo "variable.labels" (vidu <link href="rkward://rhelp/read.spss"/>)

source: Should SPSS variables with value labels be converted to R factors with those levels?
eo: Ĉu SPSS-variabloj kun valoraj etikedoj estu konvertitaj al R-faktoroj kun tiuj niveloj?

source: Maximum number of factor levels to use (see <link href="rkward://rhelp/read.spss"/>)
eo: Maksimuma nombro da faktoraj niveloj por uzi (vidu <link href="rkward://rhelp/read.spss"/>)

source: Trim trailing white space from labels?
eo: Ĉu tranĉi malantaŭan blankan spacon de etikedoj?

source: Preview imported data. Only the first 50 rows and columns are shown, for performance reasons. Internally, the preview uses a data.frame, even if <label id="data_frame"/> is not checked.
eo: Antaŭrigardu importitajn datumojn. Nur la unuaj 50 vicoj kaj kolumnoj estas montritaj, pro agado-kialoj. Interne, la antaŭrigardo uzas data.frame, eĉ se <label id="data_frame"/> ne estas markita.

source: Import SPSS file
eo: Importu SPSS-dosieron

source: Import as a data.frame
eo: Importi kiel data.frame

source: Labels
eo: Etikedoj

source: Convert Variable labels to RKWard format
eo: Konverti Variajn etikedojn al formato RKWard

source: Use value labels
eo: Uzu valorajn etikedojn

source: Maximum number of labels per object
eo: Maksimuma nombro da etikedoj per objekto

source: Trim white space
eo: Tondi blankan spacon

source: Import Stata File
eo: Importu Stata Dosiero

source: Import STATA data files.
eo: Importu STATA-datumdosierojn.

source: Choose the STATA data file to import. Usually those files have the ending '*.dta'. An R object containing the STATA data will be created. STATA files other than data files (i. e.:*.log, *.smcl, *.do, *.ado) are not supported.
eo: Elektu la STATA-datumdosieron por importi. Kutime tiuj dosieroj havas la finaĵon '*.dta'. R-objekto enhavanta la STATA-datenojn estos kreita. STATA-dosieroj krom datumdosieroj (t.e.:*.log, *.smcl, *.do, *.ado) ne estas subtenataj.

source: The filename of the file to import. This may also be a URL (http://, http:// and ftp:// are supported).
eo: La dosiernomo de la importota dosiero. Ĉi tio ankaŭ povas esti URL (http://, http:// kaj ftp:// estas subtenataj).

source: Whether the object should be opened for editing after it was imported.
eo: Ĉu la objekto devus esti malfermita por redaktado post kiam ĝi estis importita.

source: Convert Stata dates to R 'Date' class (see <link href="rkward://rhelp/read.dta"/>, <link href="rkward://rhelp/Dates"/>).
eo: Konverti Stata-datojn al R 'Dato' klaso (vidu <link href="rkward://rhelp/read.dta"/>, <link href="rkward://rhelp/Dates"/>).

source: R uses value labels only for factors. Should Stata variable with value labels be converted to factors?
eo: R uzas valoretikedojn nur por faktoroj. Ĉu Stata-variablo kun valoraj etikedoj estu konvertita al faktoroj?

source: Stata version 8 and above differentiates various different type of missing values. If this option is set, this information is stored in an attribute of the imported data. See <link href="rkward://rhelp/read.dta"/> for details.
eo: Stata versio 8 kaj supre diferencigas diversajn malsamajn specojn de mankantaj valoroj. Se ĉi tiu elekteblo estas agordita, ĉi tiu informo estas konservita en atributo de la importitaj datumoj. Vidu <link href="rkward://rhelp/read.dta"/> por detaloj.

source: The underscore ('_') is usually not used in R variable names, and may cause problems in some (rare) situations. Should underscore characters be converted to dots ('.')?
eo: La substreko ('_') kutime ne estas uzata en R-variablonomoj, kaj povas kaŭzi problemojn en kelkaj (maloftaj) situacioj. Ĉu substrekaj signoj estu konvertitaj al punktoj ('.')?

source: Preview imported data. Only the first 50 rows and columns are shown, for performance reasons.
eo: Antaŭrigardu importitajn datumojn. Nur la unuaj 50 vicoj kaj kolumnoj estas montritaj, pro agado-kialoj.

source: Import STATA file
eo: Importu STATA-dosieron

source: Options
eo: Elektebloj

source: Convert Stata dates to 'Date' class
eo: Konverti Stata-datojn al 'Data' klaso

source: Use Stata value labels to create factors?
eo: Ĉu uzi Stata-valorajn etikedojn por krei faktorojn?

source: For version 8 or later, store information about different types of missing data?
eo: Por versio 8 aŭ posta, ĉu konservi informojn pri malsamaj specoj de mankantaj datumoj?

source: Convert '_' in Stata variable names to '.' in R names
eo: Konverti '_' en Stata variablonomoj al '.' en R-nomoj

source: Preview not available, because package gdata is not installed or cannot be loaded.
eo: Antaŭrigardo ne havebla, ĉar pako gdata ne estas instalita aŭ ne estas ŝargita.

source: Import Microsoft EXCEL sheet
eo: Importu Microsoft-EXCEL-folion

source: Import a sheet of a Microsoft Excel file into a data frame.
eo: Importu folion de Microsoft Excel-dosiero en datumkadron.

source: Choose the Microsoft Excel file to import a sheet from. An R object containing the data will be created. This method of importing Excel sheets is based on R package "gdata", and requires a working Perl setup. In case this does not work on your system, or does not produce the expected results, you may want to try the Java-based alternative <link href="rkward://component/import_xls_xlconnect"/>.
eo: Elektu la Microsoft Excel-dosieron por importi folion. R-objekto enhavanta la datumojn estos kreita. Ĉi tiu metodo por importi Excel-foliojn baziĝas sur R-pakaĵo "gdata", kaj postulas funkciantan Perl-agordon. Se tio ne funkcias en via sistemo, aŭ ne produktas la atendatajn rezultojn, vi eble volas provi la Java-bazitan alternativon <link href="rkward://component/import_xls_xlconnect"/>.

source: Specifies the sheet to be imported
eo: Specifas la folion importon
