Repository: KDE/rkward
Catalog: po/*/rkward__data.po
Languages: ar, eo, eu, ru, tr

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Oliver Kellogg
eu: Iñigo Salvador Azurmendi
ru: Олеся Герасименко
tr: Emir SARI

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: olivermkellogg@gmail.com
eu: xalba@ni.eus
ru: translation-team@basealt.ru
tr: emir_sari@icloud.com

source: Data transformation and conversion
ar: تحويل البيانات ومعالجتها
eo: Transformo kaj konvertiĝo de datumoj
eu: Datuak eraldatzea eta bihurtzea
ru: Преобразование и перекодировка данных
tr: Veri dönüşümleri

source: Plugins for transforming, subsetting, recoding, etc. of data. Part of the official RKWard distribution
ar: ملحقات لتحويل البيانات، واختيار مجموعات فرعية، وإعادة ترميزها، وما إلى ذلك. جزء من توزيع أر كي وارد الرسمي
eo: Kromaĵoj por transformado, subagordo, rekodigo ktp de datumoj. Parto de la oficiala RKWard-distribuo
eu: Datuak eraldatzeko, azpimultzokatzeko, birkodetzeko eta abarrerako pluginak. RKWard banaketa ofizialaren zatia
ru: Модули для преобразования, выделения подмножеств, перекодирования и других операций над данными. Часть официального дистрибутива RKWard
tr: Verileri dönüştürmek, alt kümelemek, yeniden kodlamak vb. için eklentiler. Resmi RKWard dağıtımının bir parçasıdır

source: Generate random data
ar: ولّد بيانات عشوائية
eo: Generu hazardajn datumojn
eu: Sortu ausazko datuak
ru: Генерация случайных данных
tr: Rastgele veri oluştur

source: Sort data
ar: افرُز البيانات
eo: Ordigi datumojn
eu: Sailkatu datuak
ru: Сортировка данных
tr: Veriyi sırala

source: Subset data.frame
ar: مجموعة فرعية من إطار البيانات
eo: Subaro datumoj.kadro
eu: Azpimultzo «data.frame»
ru: Подмножество data.frame
tr: data.frame’i alt kümele

source: Recode categorical data
ar: أعد ترميز البيانات الفئوية
eo: Rekodi kategoriajn datumojn
eu: Datu kategorikoak birkodetzea
ru: Перекодирование категориальных данных
tr: Kategorik verileri yeniden kodla

source: Data
ar: بيانات
eo: Datumoj
eu: Datuak
ru: Данные
tr: Veri

source: Generate random data (normal distribution)
ar: ولّد بيانات عشوائية (توزيع طبيعي)
eo: Generu hazardajn datumojn (normala distribuo)
eu: Ausazko datuak sortu (banaketa normala)
ru: Генерация случайных данных (нормальное распределение)
tr: Rastgele veriler üret (normal dağılım)

source: mu (mean)
ar: الوسط (mu)
eo: mu (signifo)
eu: mu (batezbestekoa)
ru: мю (математическое ожидание)
tr: mu (ortalama)

source: sigma (standard deviation)
ar: الانحراف المعياري (sigma)
eo: sigma (norma devio)
eu: sigma (desbideratze estandarra)
ru: сигма (стандартное отклонение)
tr: sigma (standart sapma)

source: Length of generated sequence
ar: طول التسلسل المولّد
eo: Longo de generita sekvenco
eu: Sortutako sekuentziaren luzera
ru: Длина генерируемой последовательности
tr: Üretilen dizinin uzunluğu

source: Save as
ar: احفظ ك‍
eo: Konservi kiel
eu: Gorde honela
ru: Сохранить как
tr: Farklı Kaydet

# R code comment
source: Use as.character() as intermediate data format, to support adding and dropping levels
ar: استخدِم as.character() كشكل بيانات وسيط، لدعم إضافة وإسقاط المستويات
eo: Uzu as.character() kiel meza datumformato, por subteni aldonadon kaj forigon de niveloj
eu: Erabili «as.character()» datuen bitarteko formatu gisa, mailak gehitzeko eta kentzeko euskarria emateko
ru: Используйте as.character() как промежуточный формат данных (для поддержки добавления и сбрасывания уровней)
tr: Düzeyi eklemeyi ve bırakmayı desteklemek için as.character()’ı ara veri biçimi olarak kullan

source: Some input values were specified more than once:
ar: حُدِّدت بعض قيم الإدخال أكثر من مرة:
eo: Kelkaj enigvaloroj estis specifitaj pli ol unufoje:
eu: Sarrerako balio batzuk behin baino gehiago zehaztu dira:
ru: Некоторые входные значения указаны более одного раза:
tr: Bazı girdi değerleri birden fazla belirtildi:

source: Input variable
ar: المتغير المدخل
eo: Eniga variablo
eu: Sarrerako aldagaia
ru: Входная переменная
tr: Girdi değişkeni

source: Output variable
ar: المتغير المخرج
eo: Eliga variablo
eu: Irteerako aldagaia
ru: Выходная переменная
tr: Çıktı değişkeni

source: Number of differences after recoding
ar: عدد الاختلافات بعد إعادة الترميز
eo: Nombro de diferencoj post rekodigo
eu: Birkodetu ondoren ezberdintasun kopurua
ru: Количество отличий после перекодирования
tr: Yeniden kodlamadan sonraki farkların sayısı

source: Allows you to recode a vector with categorical data. This plugin also allows to recode vectors that are coded numerically, but this only makes sense for numeric vectors with only a limited number of unique values.
ar: اسمح بإعادة ترميز متّجه ببيانات فئوية. تسمح هذه الملحقة أيضاً بإعادة ترميز المتّجهات المرمّزة عددياً، ولكن هذا منطقي فقط للمتّجهات العددية ذات العدد المحدود من القيم الفريدة.
eo: Permesas al vi rekodi vektoron kun kategoriaj datumoj. Ĉi tiu kromaĵo ankaŭ permesas rekondigi vektorojn, kiuj estas kodigitaj cifere, sed tio nur havas sencon por nombraj vektoroj kun nur limigita nombro da unikaj valoroj.
ru: Позволяет перекодировать вектор с категориальными данными. Этот модуль также позволяет перекодировать векторы с числовым кодированием, но это будет иметь смысл только для числовых векторов с ограниченным количеством уникальных значений.
tr: Bir vektörü kategorik verilerle yeniden kodlamanıza olanak tanır. Bu eklenti aynı zamanda sayısal olarak kodlanmış vektörlerin yeniden kodlanmasına da olanak tanır; ancak bu yalnızca sınırlı sayıda benzersiz değere sahip sayısal vektörler için anlamlıdır.

source: Select the vector to recode, and where to store the recoded data. Select the storage mode of the resulting data. Then, on the second tab, specify the recodings to make.
ar: حدّد المتّجه الذي يجب إعادة ترميزه، ومكان تخزين البيانات المعاد ترميزها. حدّد وضع تخزين البيانات الناتجة. ثم، في اللِّسَان الثاني، حدّد عمليات إعادة الترميز التي يجب القيام بها.
eo: Elektu la vektoron por rekondigi, kaj kie konservi la recodigitajn datumojn. Elektu la konservan reĝimon de la rezultaj datumoj. Poste, sur la dua langeto, specifu la kodadojn por fari.
ru: Выберите вектор для перекодирования и место для сохранения перекодированных данных. Выберите режим сохранения результатов. Затем (на второй вкладке) укажите перекодирования, которые следует выполнить.
tr: Yeniden kodlanacak vektörü ve yeniden kodlanan verilerin nerede depolanacağını seçin. Ortaya çıkan verilerin depolama kipini seçin. Daha sonra ikinci sekmede yapılacak kodlamaları belirtin.

source: Select the vector to recode
ar: حدّد المتّجه الذي يجب إعادة ترميزه
eo: Elektu la vektoron por rekondigi
eu: Hautatu birkodetu beharreko bektorea
ru: Выберите вектор для перекодирования
tr: Yeniden kodlanacak vektörü seç

source: Select whether to overwrite/replace the input vector with the recoded data, or save to a different vector.
ar: حدّد ما إذا كنت تريد الكتابة فوق/استبدال المتّجه المدخل بالبيانات المعاد ترميزها، أو الحفظ في متّجه مختلف.
eo: Elektu ĉu anstataŭi/anstataŭigi la enigvektoron per la rekoditaj datumoj, aŭ konservi al alia vektoro.
eu: Hautatu, sarrerako bektorea birkodetutako datuekin gainidatzi/ordezkatu, edo beste bektore batean gorde behar den.
ru: Выберите, следует ли перезаписать или заменить входной вектор перекодированными данными или выполнить сохранение в другой вектор.
tr: Kaydedilen verilerle girdi vektörünün üzerine yazılmayı/değiştirilmeyi veya farklı bir vektöre kaydedilip kaydedilmeyeceğini seçin.

source: Pick a name (and optionally a container) for the recoded data.
ar: اختر اسماً (ويمكنك اختيار حاوية) للبيانات المعاد ترميزها.
eo: Elektu nomon (kaj laŭvole ujon) por la rekoditaj datumoj.
eu: Aukeratu birkodetutako datuetarako izen bat (eta aukeran, edukiontzi bat).
ru: Выберите имя (а также — необязательно — контейнер) для перекодированных данных.
tr: Yeniden kodlanan veriler için bir ad (ve isteğe bağlı olarak bir kapsayıcı) seçin.

source: Storage mode of the recoded data.
ar: وضع تخزين البيانات المعاد ترميزها.
eo: Konserva reĝimo de la rekoditaj datumoj.
eu: Birkodetutako datuak biltegiratzeko modua.
ru: Режим сохранения перекодированных данных.
tr: Kaydedilen verilerin depolama kipi.

source: Show a preview of the recoding, as a table with two columns for old and new values. The preview is limited to the first 500 rows of data, for performance reasons.
ar: اعرض معاينة لعملية إعادة الترميز، كجدول بعمودين للقيم القديمة والجديدة. المعاينة محدودة بأول 500 صف من البيانات، لأسباب تتعلق بالأداء.
eo: Montru antaŭrigardon de la rekodigo, kiel tabelo kun du kolumnoj por malnovaj kaj novaj valoroj. La antaŭvido estas limigita al la unuaj 500 vicoj da datumoj, pro agado-kialoj.
eu: Erakutsi birkodetzearen aurreikuspegi bat, balio zahar eta berrietarako bi zutabeko taula bat gisa. Errendimendu-arrazoiak direla eta, aurreikuspegia datuen aurreneko 500 errenkadatara mugatuta dago.
ru: Предварительный просмотр перекодирования в виде таблицы с двумя столбцами (для старых и новых значений). Для повышения производительности предварительный просмотр ограничен первыми 500 строками данных.
tr: Eski ve yeni değerler için iki sütunlu bir tablo olarak yeniden kodlamanın önizlemesini gösterin. Önizleme, başarım nedenleriyle ilk 500 veri satırıyla sınırlıdır.

source: The upper half of this tab allows you to specify recodings for individual input values. To add more recodings, click the "add/+"-button. To remove recodings, click the "remove/x"-button. For each recoding, select the following:
ar: يسمح لك النصف العلوي من هذا اللِّسَان بتحديد عمليات إعادة ترميز لقيم الإدخال الفردية. لإضافة المزيد من عمليات إعادة الترميز، انقر على زر "إضافة/+". لإزالة عمليات إعادة الترميز، انقر على زر "إزالة/x". لكل عملية إعادة ترميز، حدّد ما يلي:
eo: La supra duono de ĉi tiu langeto permesas al vi specifi rekodigojn por individuaj enigvaloroj. Por aldoni pliajn kodadojn, alklaku la butonon "aldoni/+". Por forigi rekodigojn, alklaku la butonon "forigi/x". Por ĉiu rekodigo, elektu la jenon:
ru: Верхняя половина этой вкладки позволяет указать перекодирования отдельных входных значений. Чтобы добавить перекодирования, нажмите кнопку «добавить/+». Чтобы удалить перекодирования, нажмите кнопку «удалить/x». Для каждого перекодирования выберите следующее:
tr: Bu sekmenin üst yarısı, bireysel giriş değerleri için kayıtlar belirlemenize olanak tanır. Daha fazla kayıt eklemek için ‘Ekle/+’ düğmesini tıklayın. Yeniden kodlamaları kaldırmak için ‘Kaldır/x’ düğmesine tıklayın. Her kayıt için aşağıdakileri seçin:

source: For each recoding to perform, first select the old value(s) to recode. This can be either NA/missing, or select non-NA value(s) on the left hand side, and add them to the values to be recoded by clicking the arrow-button. If several input values are to be replaced with one output value, you can select them all at once.
ar: لكل عملية إعادة ترميز يجب إجراؤها، حدّد أولاً القيمة (القيم) القديمة لإعادة ترميزها. يمكن أن تكون هذه إما NA/مفقودة، أو حدّد قيمة (قيماً) غير NA على الجانب الأيسر، وأضفها إلى القيم التي يجب إعادة ترميزها بالنقر على زر السهم. إذا أردت استبدال عدة قيم إدخال بقيمة إخراج واحدة، يمكنك تحديدها كلها دفعة واحدة.
eo: Por ĉiu rekodigo, unue elektu la malnovan valoron(j)n por rekodigi. Ĉi tio povas esti aŭ NA/mankas, aŭ elektu ne-NA valoron(j)n sur la maldekstra flanko, kaj aldonu ilin al la valoroj rekoditaj per klako de la sago-butono. Se pluraj enigvaloroj devas esti anstataŭigitaj per unu eligvaloro, vi povas elekti ilin ĉiujn samtempe.
ru: Для каждого выполняемого перекодирования сначала выберите старые значения. Это могут быть либо недоступные («Н/Д») или отсутствующие значения, либо доступные значения в списке с левой стороны; добавьте их к значениям для перекодирования путём нажатия кнопки со стрелкой. Если на одно выходное значение нужно заменить несколько входных значений, можно выбрать их все сразу.
tr: Gerçekleştirilecek her yeniden kodlama için, öncelikle yeniden kodlanacak eski değeri/değerleri seçin. Bu, NA/eksik değerler olabilir veya sol taraftan NA olmayan değer(ler)i seçebilir ve bunları, ok düğmesine tıklayarak yeniden kodlanacak değerlere ekleyebilirsiniz. Birden fazla girdi değerinin tek bir çıkış değeriyle değiştirilmesi gerekiyorsa hepsini aynı anda seçebilirsiniz.

source: Enter the new value (or set it to be NA). For factors and character vectors, values will be quoted, automatically.
ar: أدخِل القيمة الجديدة (أو اضبطها لتكون NA). بالنسبة للمتّجهات العاملة والمتّجهات المحرفية، ستكون القيم مُقتبسة، آلياً.
eo: Enigu la novan valoron (aŭ agordu ĝin kiel NA). Por faktoroj kaj signaj vektoroj, valoroj estos cititaj aŭtomate.
ru: Введите новое значение (или укажите, что оно недоступно: «Н/Д»). Факторы и символьные векторы будут автоматически взяты в кавычки.
tr: Yeni değeri girin (veya NA olarak ayarlayın). Çarpanlar ve karakter vektörleri için değerler kendiliğinden alıntılanacaktır.

source: Any input values (including NAs) for which no recoding was specified, above, can either be left unchanged ("Copy"), or can be replaced with a specific value or NA.
ar: يمكن ترك أي قيم إدخال (بما في ذلك NAs) التي لم يُحدَّد لها إعادة ترميز، أعلاه، إما دون تغيير ("انسخ")، أو يمكن استبدالها بقيمة محددة أو NA.
eo: Ĉiuj enigvaloroj (inkluzive de NA) por kiuj neniu rekodigo estis specifita, supre, povas aŭ esti lasitaj senŝanĝaj ("Kopiu"), aŭ povas esti anstataŭigitaj per specifa valoro aŭ NA.
ru: Все входные значения (включая значения «Н/Д»), для которых выше не было указано перекодирование, можно либо оставить без изменений («Скопировать»), либо заменить указанным значением или «Н/Д».
tr: Yukarıda herhangi bir kodlamanın belirtilmediği herhangi bir giriş değeri (NA’lar içerilir) ya değiştirilmeden bırakılabilir (‘Kopyala’) ya da belirli bir değerle veya NA ile değiştirilebilir.

source: This plugin utilizes the <link href="rkward://component/rkward/level_select"/> and <link href="rkward://component/rkward/multi_input"/> embeddable plugins.
ar: تستخدِم هذه الملحقة الملحقتين القابلتين للتضمين <link href="rkward://component/rkward/level_select"/> و <link href="rkward://component/rkward/multi_input"/>.
eo: Ĉi tiu kromaĵo uzas la <link href="rkward://component/rkward/level_select"/> kaj <link href="rkward://component/rkward/multi_input"/> enkonstrueblajn kromaĵojn.
ru: В этом модуле используются встраиваемые модули <link href="rkward://component/rkward/level_select"/> и <link href="rkward://component/rkward/multi_input"/>.
tr: Bu eklenti, <link href="rkward://component/rkward/level_select"/> ve <link href="rkward://component/rkward/multi_input"/> gömülebilir eklentilerinden yararlanır.

source: Input and output variables
ar: المتغيرات المدخلة والمخرجة
eo: Enigo kaj eligo variabloj
ru: Входные и выходные переменные
tr: Girdi ve çıktı değişkenleri

source: Select variable to recode
ar: حدّد المتغير لإعادة ترميزه
eo: Elektu variablon por rekondigi
ru: Выберите переменную для перекодирования
tr: Yeniden kodlanacak değişkeni seçin

source: Save to
ar: احفظ في
eo: Konservi al
ru: Сохранить в
tr: Şuraya kaydet

source: Same object
ar: الكائن نفسه
eo: Sama objekto
eu: Objektu bera
ru: Тот же объект
tr: Aynı nesne

source: Other:
ar: أخرى:
eo: Alia:
ru: Другой:
tr: Diğer:

source: Object to save to
ar: الكائن للحفظ فيه
eo: Objekto por konservi
eu: Zein objektutan gorde
ru: Объект для выполнения сохранения
tr: İçine kaydedilecek nesne

source: Data type after recoding
ar: نوع البيانات بعد إعادة الترميز
eo: Tipo de datumoj post rekodigo
eu: Birkodetu ondoko datu-mota
ru: Тип данных после перекодирования
tr: Yeniden kodlama sonrası veri türü

source: Character
ar: محرف
eo: Signo
eu: Karakterea
ru: Символьный
tr: Karakter

source: Factor
ar: عامل
eo: Faktoro
eu: Faktorea
ru: Факторный
tr: Çarpan

source: Numeric
ar: عددي
eo: Numera
eu: Zenbakizkoa
ru: Числовой
tr: Sayısal

source: Logical
ar: منطقي
eo: Logika
eu: Logikoa
ru: Логический
tr: Mantıksal

source: Preview
ar: معاينة
eo: Antaŭrigardo
eu: Aurreikuspegia
ru: Предварительный просмотр
tr: Önizleme

source: Values
ar: القيم
eo: Valoroj
eu: Balioak
ru: Значения
tr: Değerler

source: Recodings
ar: عمليات إعادة الترميز
eo: Rekodigoj
eu: Birkodetuak
ru: Перекодирования
tr: Yeniden kodlamalar

source: Old value(s)
ar: القيمة (القيم) القديمة
eo: Malnova(j) valoro(j)
eu: Balio zaharra(k)
ru: Старые значения
tr: Eski değerler

source: New value(s)
ar: القيمة (القيم) الجديدة
eo: Nova(j) valoro(j)
eu: Balio berria(k)
ru: Новые значения
tr: Yeni değerler

source: Old values
ar: القيم القديمة
eo: Malnovaj valoroj
eu: Balio zaharrak
ru: Старые значения
tr: Eski değerler

source: Select value(s):
ar: حدّد القيمة (القيم):
eo: Elektu valoro(j)n:
eu: Hautatu balioa(k):
ru: Значения:
tr: Değerler seç;

source: New value
ar: قيمة جديدة
eo: Nova valoro
eu: Balio berria
ru: Новое значение
tr: Yeni değer

source: Value:
ar: القيمة:
eo: Valoro:
eu: Balioa:
ru: Значение:
tr: Değer:

source: (Value will be quoted, automatically)
ar: (القيمة ستكون مُقتبسة، آلياً)
eo: (Valoro estos citita, aŭtomate)
eu: (Balioa aipu gisa ipiniko da, automatikoki)
ru: (Значение будет автоматически взято в кавычки)
tr: (Değer kendiliğinden teklif edilecektir)

source: Any other values
ar: أي قيم أخرى
eo: Ajna aliaj valoroj
eu: Beste edozein balio
ru: Любые другие значения
tr: Herhangi başka bir değer

source: Copy
ar: انسخ
eo: Kopii
eu: Kopiatu
ru: Скопировать
tr: Kopya

source: Custom value:
ar: قيمة مخصصة:
eo: Propra valoro:
eu: Neurrira ipinitako balioa:
ru: Пользовательское значение:
tr: Özel değer;

source: Sort data. Currently data.frames, or individual vectors can be sorted.
ar: افرُز البيانات. حالياً، يمكن فرز إطارات البيانات، أو المتّجهات الفردية.
eo: Ordigi datumojn. Nuntempe data.frames, aŭ individuaj vektoroj povas esti ordigitaj.
eu: Sailkatu datuak. Egun, «data.frame»ak, edo banakako bektoreak sailka daitezke.
ru: Сортировка данных. В текущей версии предусмотрена сортировка data.frames или отдельных векторов.
tr: Veriyi sıralayın. Şu anda data.frames veya bireysel vektörler sıralanabilirler.

source: Select the object to be sorted. For data.frames, also specify the column to sort by. By default the object to be sorted is replaced with the sorted variant, but you can also specify to save to a separate object.
ar: حدّد الكائن الذي يجب فرزه. بالنسبة لإطارات البيانات، حدّد أيضاً العمود الذي يجب الفرز حسبه. مبدئياً، يُستبدَل الكائن المراد فرزه بالنسخة المفروزة، ولكن يمكنك أيضاً تحديد الحفظ في كائن منفصل.
eo: Elektu la objekton por ordigi. Por data.frames, ankaŭ specifu la kolumnon por ordigi. Defaŭlte la ordigota objekto estas anstataŭigita per la ordigita varianto, sed vi ankaŭ povas specifi konservi al aparta objekto.
eu: Hautatu sailkatu beharreko objektua. «data.frame»tan gainera, hautatu zein zutaberen arabera sailkatu behar den. Era lehenetsian, sailkatu beharreko objektua sailkatutako aldaerarekin ordezkatzen da, baina bereizitako objektu batean gorde dadin zehaztu dezakezu.
ru: Выберите объект для сортировки. В случае data.frames также укажите столбец, по которому будет выполняться сортировка. По умолчанию сортируемый объект заменяется на его отсортированный вариант, но можно настроить и сохранение в отдельный объект.
tr: Sıralanacak nesneyi seçin. data.frames için sıralama ölçütü olarak kullanılacak sütunu da belirtin. Öntanımlı olarak sıralanacak nesne, sıralanan değişkenle değiştirilir; ancak ayrı bir nesneye kaydetmeyi de belirtebilirsiniz.

source: The object to sort. If a data.frame editor window is currently active, the corresponding object name will be filled in as a default.
ar: الكائن للفرز. إذا كانت نافذة محرّر إطار بيانات نشطة حالياً، فسيُملأ اسم الكائن المطابق كقيمة مبدئية.
eo: La objekto por ordigi. Se data.frame-redaktila fenestro estas nuntempe aktiva, la responda objektonomo estos plenigita defaŭlte.
eu: Sailkatu beharreko objektua. Une horretan «data.frame» leiho bat aktibo badago, dagokion objektu-izena beteko da lehenetsitako gisa.
ru: Объект для сортировки. Если окно редактора data.frame активно, в поле имени по умолчанию появится имя соответствующего объекта.
tr: Sıralanacak nesne. Bir data.frame düzenleyici penceresi şu anda etkinse karşılık gelen nesne adı öntanımlı olarak doldurulacaktır.

source: Only for data.frame objects. Select the column(s) to sort by.
ar: فقط لكائنات إطار البيانات. حدّد العمود (الأعمدة) للفرز حسبه.
eo: Nur por datumoj.frame objektoj. Elektu la kolumno(j)n por ordigi.
eu: «data.frame» objektuetarako bakarrik. Hautatu zein zutaberen arabera sailkatu.
ru: Только для объектов data.frame. Выберите один или несколько столбцов, по которым будет выполняться сортировка.
tr: Yalnızca data.frame nesneleri için. Sıralanmaları için sütunları seçin.

source: Choose "Same object" (the default) to replace the object to be sorted with the sorted variant. If, instead, you want to keep the unsorted object, choose "Another object" to save the sorted object, separately.
ar: اختر "الكائن نفسه" (القيمة المبدئية) لاستبدال الكائن المراد فرزه بالنسخة المفروزة. إذا كنت تريد الاحتفاظ بالكائن غير المفروز بدلاً من ذلك، فاختر "كائن آخر" لحفظ الكائن المفروز بشكل منفصل.
eo: Elektu "Sama objekto" (la defaŭlta) por anstataŭigi la objekton por ordigi per la ordigita varianto. Se vi anstataŭe volas konservi la neordigitan objekton, elektu "Alia objekto" por konservi la ordigitan objekton, aparte.
eu: Aukeratu "Objektu bera" (lehenetsia), sailkatu beharreko objektua sailkatutako aldaerarekin ordezkatzeko. Horren ordez, sailkatu gabeko objektua mantendu nahi baduzu, aukeratu "Beste objektu bat", sailkatutako objektua bereizita gordetzeko.
ru: Выберите «Тот же объект» (значение по умолчанию) для замены сортируемого объекта на его отсортированный вариант. Если же следует оставить неотсортированный объект, выберите «Другой объект» для сохранения отсортированных данных в отдельном объекте.
tr: Sıralanacak nesneyi sıralanan değişkenle değiştirmek için ‘Aynı nesne’yi (öntanımlı) seçin. Bunun yerine, sıralanmamış nesneyi korumak istiyorsanız sıralanan nesneyi ayrı olarak kaydetmek için ‘Başka nesne’yi seçin.

source: Only, if you selected "Another object", above: Specify the object to save to.
ar: فقط، إذا اخترت "كائن آخر"، أعلاه: حدّد الكائن للحفظ فيه.
eo: Nur, se vi elektis "Alia objekto", supre: Specifu la objekton por konservi.
eu: Gorago "Beste objektu bat" aukeratu bazenuen bakarrik: Zehaztu zein objektutan gorde behar den.
ru: Только в том случае, если выше выбран вариант «Другой объект»: укажите объект для выполнения сохранения.
tr: Yukarıda yalnızca ‘Başka nesne’yi seçtiyseniz: İçine kaydedilecek nesneyi seçin.

source: Show a preview of the sorted data. The preview is limited to 200 rows and 50 columns of data, for performance reasons.
ar: اعرض معاينة للبيانات المفروزة. المعاينة محدودة بـ 200 صف و 50 عموداً من البيانات، لأسباب تتعلق بالأداء.
eo: Montru antaŭrigardon de la ordigitaj datumoj. La antaŭvido estas limigita al 200 vicoj kaj 50 kolumnoj da datumoj, pro agado-kialoj.
eu: Erakutsi sailkatutako datuen aurreikuspegi bat. Errendimendu-arrazoiak direla eta, aurreikuspegia 200 errenkada eta 50 zutabera mugatuta dago.
ru: Предварительный просмотр отсортированных данных (для повышения производительности ограничен 200 строками и 50 столбцами данных).
tr: Sıralanan verilerin önizlemesini gösterin. Önizleme, başarım nedenleriyle 200 satır ve 50 veri sütunuyla sınırlıdır.

source: Sort in ascending or descending order.
ar: افرُز بترتيب تصاعدي أو تنازلي.
eo: Ordigi en suprena aŭ malkreska ordo.
eu: Sailkatu goranzko edo beranzko ordenan.
ru: Сортировка в порядке возрастания или убывания.
tr: Artan veya azalan düzende sıralayın.
