Repository: KDE/rkward
Catalog: po/*/rkward__embedded.po
Languages: ar, eo, ru, tr

source: This is the <i>breaks</i> parameter to <b>hist</b>, unless either 'Integer numbers' or 'Vector of break points' is chosen. The 'Integer numbers' option sets the break points as the integers between the minimum and the maximum of the variable. The 'Vector of break points' option sets equally spaced break points in the range of the variable. The number of break points in this case is provided by 'Vector length' (see below).
ar: هذا هو الوسيط <i>breaks</i> لدالة <b>hist</b>، ما لم يُختَر 'أعداد صحيحة' أو 'متجه نقاط التوقف'. يضبط خيار 'أعداد صحيحة' نقاط التوقف كأعداد صحيحة بين الحد الأدنى والحد الأقصى للمتغير. يضبط خيار 'متجه نقاط التوقف' نقاط توقف متباعدة بالتساوي في مدى المتغير. يُوَفَّر عدد نقاط التوقف في هذه الحالة بواسطة 'طول المتجه' (انظر أدناه).
eo: Ĉi tio estas la parametro <i>rompoj</i> al <b>hist</b>, krom se oni elektas aŭ 'Entjerajn nombrojn' aŭ 'Vektoro de rompopunktoj'. La opcio 'Entjeraj nombroj' fiksas la rompopunktojn kiel la entjeroj inter la minimumo kaj la maksimumo de la variablo. La opcio 'Vektoro de rompopunktoj' starigas egale interspacigitajn rompopunktojn en la intervalo de la variablo. La nombro da rompopunktoj en ĉi tiu kazo estas disponigita per "Vektora longo" (vidu malsupre).
ru: Это параметр <i>breaks</i> функции <b>hist</b>, если не выбран пункт «Целые числа» или «Вектор точек разрыва». При выборе пункта «Целые числа» точки разрыва будут целыми числами между минимумом и максимумом переменной. При выборе пункта «Вектор точек разрыва» в диапазоне переменной будут равноотстоящие точки разрыва. В этом случае количество точек разрыва предоставляется параметром «Длина вектора» (смотрите ниже).
tr: ‘Tamsayı sayılar’ veya ‘Kesme noktalarının vektörü’ seçilmediği sürece bu, <b>hist</b>’in <i>breaks</i> parametresidir. ‘Tamsayı sayılar’ seçeneği, kesme noktalarını değişkenin en düşüğü ve en yükseği arasındaki tam sayılar olarak ayarlar. ‘Kırılma noktaları vektörü’ seçeneği, değişken aralığında eşit aralıklarla kırılma noktaları ayarlar. Bu durumda kırılma noktalarının sayısı ‘Vektör uzunluğu’ ile sağlanır (aşağıya bakın).

source: If 'A single number' is chosen in the above field, then this provides a suggestion to the number of cells. This is the <i>breaks</i> parameter with a single number argument.
ar: إذا اختير 'عدد واحد' في الحقل أعلاه، يوفر هذا اقتراحًا لعدد الخلايا. هذا هو الوسيط <i>breaks</i> مع وسيط عدد واحد.
eo: Se 'Ununura nombro' estas elektita en la supra kampo, tiam ĉi tio donas sugeston pri la nombro da ĉeloj. Ĉi tio estas la parametro <i>rompoj</i> kun unusola argumento.
ru: Если в поле выше выбрано «Одно число», этот параметр позволяет предложить количество ячеек. Это параметр <i>breaks</i> с одним числом в качестве аргумента.
tr: Yukarıdaki alanda ‘Tek bir sayı’ seçilirse bu, hücre sayısına ilişkin bir öneri sağlar. Bu, tek sayı argümanına sahip <i>breaks</i> parametresidir.

source: If 'Vector of break points' is chosen in the above field, then this provides the length of the vector of equally spaced break points in the range of the variable. This is the <i>breaks</i> parameter with a vector argument. The actual sequence is calculated by an inline function call (see the generated code). The range of the variable is extended by 10% before obtaining the sequence, so that both the minimum and maximum points are included.
ar: إذا اختير 'متجه نقاط التوقف' في الحقل أعلاه، يوفر هذا طول متجه نقاط التوقف المتباعدة بالتساوي في مدى المتغير. هذا هو الوسيط <i>breaks</i> مع وسيط متجه. يُحسَب التسلسل الفعلي باستدعاء دالة مضمنة (انظر الشيفرة المولدة). مدى المتغير يُمَدَّد بنسبة 10% قبل الحصول على التسلسل، بحيث تُضمَن كلتا النقطتين الدنيا والقصوى.
eo: Se "Vektoro de rompopunktoj" estas elektita en la supra kampo, tiam tio disponigas la longon de la vektoro de egale interspacigitaj rompopunktoj en la intervalo de la variablo. Ĉi tio estas la parametro <i>rompoj</i> kun vektora argumento. La fakta sekvenco estas kalkulita per enlinia funkciovoko (vidu la generitan kodon). La gamo de la variablo estas etendita je 10% antaŭ akiri la sekvencon, tiel ke ambaŭ la minimumaj kaj maksimumaj punktoj estas inkluditaj.
ru: Если в поле выше выбран вариант «Вектор точек разрыва», то этот параметр предоставляет длину вектора равноотстоящих точек разрыва в диапазоне переменной. Это параметр <i>breaks</i> с векторным аргументом. Сама последовательность рассчитывается вызовом встроенной функции (смотрите сгенерированный код). Перед получением последовательности диапазон переменной увеличивается на 10%, поэтому включаются обе точки (точка минимума и точка максимума).
tr: Yukarıdaki alanda ‘Kesme noktalarının vektörü’ seçilirse bu, değişken aralığında eşit aralıklı kesme noktalarının vektörünün uzunluğunu sağlar. Bu, vektör argümanına sahip <i>breaks</i> parametresidir. Gerçek sıra, satır içi işlev çağrısıyla hesaplanır (oluşturulan koda bakın). Dizi elde edilmeden önce değişkenin aralığı %​10 genişletilir, böylece hem en düşük hem de en yüksek noktalar içerilir.

source: Whether border to the histogram bars are to be drawn. If unchecked then, <i>border=FALSE</i> is added to the code. Otherwise a color is provided as the argument to <i>border</i>.
ar: ما إذا أُرِيدَ رسم حدٍّ لأشرطة المدرج التكراري. إذا أُلغِيَ التنشيط، فـ<i>border=FALSE</i> يُضاف إلى الشيفرة. وإلا يُوَفَّر لون كوسيط لـ<i>border</i>.
eo: Ĉu limo al la histogramaj stangoj estas desegnita. Se nemarkite tiam, <i>border=FALSE</i> estas aldonita al la kodo. Alie koloro estas provizita kiel la argumento al <i>limo</i>.
ru: Следует ли рисовать границу столбцов гистограммы. Если флажок снят, в код добавляется <i>border=FALSE</i>. В ином случае в качестве аргумента <i>border</i> предоставляется цвет.
tr: Histogram çubuklarına kenarlık çizilip çizilmeyeceği. İşaretlenmezse koda <i>border=FALSE</i> eklenir. Aksi takdirde, <i>border</i> argümanı olarak bir renk sağlanır.

source: This is the <i>border</i> argument which provides the color of the border. Check the above box to use this option.
ar: هذا هو الوسيط <i>border</i> الذي يوفر لون الحدّ. نشِّط المربع أعلاه لاستعمال هذا الخيار.
eo: Ĉi tiu estas la argumento <i>limo</i> kiu provizas la koloron de la limo. Marku la supran skatolon por uzi ĉi tiun elekteblon.
ru: Это аргумент <i>border</i>, который предоставляет цвет границы. Установите расположенный выше флажок для использования этого параметра.
tr: Bu, kenarlığın rengini sağlayan <i>border</i> argümanıdır. Bu seçeneği kullanmak için yukarıdaki kutuyu işaretleyin.

source: This is the <i>lty</i> parameter. Choosing 'Blank' will not draw any lines, select a fill color to make a sensible plot. See R reference for further details.
ar: هذا هو الوسيط <i>lty</i>. اختيار 'فارغ' لن يرسم أي خطوط، اختر لون تعبئة لإنشاء رسم بياني معقول. انظر مرجع R للمزيد من التفاصيل.
eo: Ĉi tio estas la parametro <i>lty</i>. Elektante 'Malplena' ne desegnos neniujn liniojn, elektu plenigkoloron por fari senchavan grafikon. Vidu R-referencon por pliaj detaloj.
ru: Это параметр <i>lty</i>. При выборе значения «Пустая» рисование линий не будет выполняться. Выберите цвет заливки для создания читаемого графика. Подробные сведения доступны в справке R.
tr: Bu <i>lty</i> parametresidir. ‘Boş’ seçeneğini seçmek herhangi bir çizgi çizmez; mantıklı bir çizim oluşturmak için bir dolgu rengi seçin. Daha fazla ayrıntı için R başvurusuna bakın.

source: This is the <i>density</i> parameter. See the R reference on 'rect' for more details.
ar: هذا هو الوسيط <i>density</i>. انظر مرجع R حول 'rect' للمزيد من التفاصيل.
eo: Ĉi tio estas la parametro <i>denseco</i>. Vidu la R-referencon pri 'rect' por pliaj detaloj.
ru: Это параметр <i>density</i>. Более подробные сведения доступны в справке R по «rect».
tr: Bu, <i>density</i> parametresidir. Daha fazla ayrıntı için ‘rect’ üzerine olan R başvurusuna bakın.

source: This is the <i>angle</i> parameter.
ar: هذا هو الوسيط <i>angle</i>.
eo: Ĉi tio estas la parametro <i>angulo</i>.
ru: Это параметр <i>angle</i>.
tr: Bu, <i>angle</i> parametresidir.

source: Check this box to use a fill color for the histogram bars.
ar: نشِّط هذا المربع لاستعمال لون تعبئة لأشرطة المدرج التكراري.
eo: Marku ĉi tiun skatolon por uzi plenkoloron por la histogramaj stangoj.
ru: Установите этот флажок, чтобы программа использовала цвет заливки для столбцов гистограммы.
tr: Histogram çubuklarında dolgu rengi kullanmak için bu kutuyu işaretleyin.

source: This is the <i>col</i> parameter. The embedding plugin might set a default color. If it is empty, then <i>col</i> is not used in the code, otherwise the chosen color is used to fill the bars.
ar: هذا هو الوسيط <i>col</i>. قد تضبِط إضافة التضمين لونًا مبدئيًّا. إذا كان فارغًا، فلا يُستعمَل <i>col</i> في الشيفرة، وإلا يُستعمَل اللون المختار لتعبئة الأشرطة.
eo: Ĉi tio estas la parametro <i>col</i>. La enkonstrua kromaĵo povus agordi defaŭltan koloron. Se ĝi estas malplena, tiam <i>kol</i> ne estas uzata en la kodo, alie la elektita koloro estas uzata por plenigi la stangojn.
ru: Это параметр <i>col</i>. Модуль встраивания может установить цвет по умолчанию. Если этот параметр оставлен пустым, <i>col</i> не используется в коде. В ином случае для заполнения столбцов используется выбранный цвет.
tr: Bu, <i>col</i> parametresidir. Gömme eklentisi bir öntanımlı renk ayarlayabilir. Boşsa kodda <i>col</i> kullanılmaz, aksi halde çubukları doldurmak için seçili renk kullanılır.

source: The following external tags are provided for use in the embedding plugin.
ar: وسوم خارجية التالية متوفرة للاستعمال في إضافة التضمين.
eo: La sekvaj eksteraj etikedoj estas provizitaj por uzo en la enkonstrua kromaĵo.
ru: Для использования в модуле встраивания предоставляются следующие внешние теги.
tr: Gömme eklentisinde kullanılmak üzere aşağıdaki dış etiketler sağlanmıştır.

source: <i>code.printout</i>: This contains all the other options determining the look of the plot.
ar: <i>code.printout</i>: يحتوي هذا على جميع الخيارات الأخرى التي تحدد مظهر الرسم البياني.
eo: <i>code.printout</i>: Ĉi tio enhavas ĉiujn aliajn eblojn determinantajn la aspekton de la grafiko.
ru: <i>code.printout</i>: содержит все остальные параметры, определяющие внешний вид графика.
tr: <i>code.printout</i>: Bu, çizimin görünümünü belirleyen diğer tüm seçenekleri içerir.

source: <i>allow_addtoplot</i>: Setting this to "true" ("false") enables (disables) the display of the '<label id="addtoplot"/>' check box.
ar: <i>allow_addtoplot</i>: ضبط هذا على "true" ("false") يُمكِّن (يُعطِّل) عرض مربع التنشيط '<label id="addtoplot"/>'.
eo: <i>allow_addtoplot</i>: Agordi ĉi tion al "true" ("false") ebligas (malŝaltas) la montradon de la markobutono '<label id="addtoplot"/>'.
ru: <i>allow_addtoplot</i>: установка в значение «true» («false») включает (отключает) отображение флажка «<label id="addtoplot"/>».
tr: <i>allow_addtoplot</i>: Bunu "true" ("false") olarak ayarlamak, ‘<label id="addtoplot"/>’ onay kutusunun görüntülenmesini etkinleştirir (devre dışı bırakır).

source: <i>varname</i>: For linking to the variable name for which histogram is being plotted. This is used in the 'Integer numbers' option for breaks.
ar: <i>varname</i>: للربط باسم المتغير الذي يُرسَم من أجله المدرج التكراري. هذا يُستعمَل في خيار 'أعداد صحيحة' لنقاط التوقف.
eo: <i>varname</i>: Por ligi al la variablo nomo por kiu histogramo estas grafika. Ĉi tio estas uzata en la elekteblo 'Entjeraj nombroj' por paŭzoj.
ru: <i>varname</i>: для привязки к имени переменной, для которой строится график гистограммы. Используется в параметре «Целые числа» для разрывов.
tr: <i>varname</i>: Histogramın çizildiği değişken adına bağlantı vermek için. Bu, kesmeler için ‘Tamsayı sayılar’ seçeneğinde kullanılır.

source: <i>allow_freq</i>: Setting this to "true" ("false") enables (disables) the display of the '<label id="freq"/>' check box.
ar: <i>allow_freq</i>: ضبط هذا على "true" ("false") يُمكِّن (يُعطِّل) عرض مربع التنشيط '<label id="freq"/>'.
eo: <i>allow_freq</i>: Agordi ĉi tion al "vera" ("falsa") ebligas (malŝaltas) la montradon de la markobutono '<label id="freq"/>'.
ru: <i>allow_freq</i>: установка в значение «true» («false») включает (отключает) отображение флажка «<label id="freq"/>».
tr: <i>allow_freq</i>: Bunu "true" ("false") olarak ayarlamak, ‘<label id="freq"/>’ onay kutusunun görüntülenmesini etkinleştirir (devre dışı bırakır).

source: <i>allow_barlabels</i>: Setting this to "true" ("false") enables (disables) the display of the '<label id="barlabels"/>' check box.
ar: <i>allow_barlabels</i>: ضبط هذا على "true" ("false") يُمكِّن (يُعطِّل) عرض مربع التنشيط '<label id="barlabels"/>'.
eo: <i>allow_barlabels</i>: Agordi ĉi tion al "true" ("false") ebligas (malŝaltas) la montradon de la markobutono '<label id="barlabels"/>'.
ru: <i>allow_barlabels</i>: установка в значение «true» («false») включает (отключает) отображение флажка «<label id="barlabels"/>».
tr: <i>allow_barlabels</i>: Bunu "true" ("false") olarak ayarlamak, ‘<label id="barlabels"/>’ onay kutusunun görüntülenmesini etkinleştirir (devre dışı bırakır).

source: In order to allow flexible use, the generated options are separated into three different sections:
ar: من أجل السماح بالاستعمال المرن، تفصَل الخيارات المولدة إلى ثلاثة أقسام مختلفة:
eo: Por permesi flekseblan uzon, la generitaj elektebloj estas apartigitaj en tri malsamajn sekciojn:
ru: Чтобы обеспечить гибкость использования, сгенерированные параметры выделяются в следующие три раздела:
tr: Esnek kullanıma olanak sağlamak amacıyla oluşturulan seçenekler üç farklı bölüme ayrılmıştır:

source: <i>code.preprocess</i>: Options suitable for use in a call to <b>rk.header()</b>. These are safe to ignore, if you do not need them.
ar: <i>code.preprocess</i>: خيارات مناسبة للاستعمال في استدعاء لـ <b>rk.header()</b>. يمكن تجاهلها بأمان، إذا لم تحتجها.
eo: <i>code.preprocess</i>: Opcioj taŭgaj por uzado en voko al <b>rk.header()</b>. Ĉi tiuj estas sekure ignori, se vi ne bezonas ilin.
ru: <i>code.preprocess</i>: параметры, подходящие для использования в вызове функции <b>rk.header()</b>. Эти параметры можно проигнорировать, если они не нужны.
tr: <i>code.preprocess</i>: <b>rk.header()</b> çağrısında kullanıma uygun seçenekler. Gereksiniminiz yoksa bunlar yok sayılabilir.

source: <i>code.calculate</i>: This contains only the <i>breaks</i>-option.
ar: <i>code.calculate</i>: يحتوي هذا على خيار <i>breaks</i> فقط.
eo: <i>code.calculate</i>: Ĉi tio enhavas nur la opcion <i>breaks</i>.
ru: <i>code.calculate</i>: содержит только параметр <i>breaks</i>.
tr: <i>code.calculate</i>: Bu, yalnızca <i>breaks</i> seçeneğini içerir.

source: Default histogram options
ar: خيارات المدرج التكراري المبدئية
eo: Defaŭltaj histogramaj opcioj
ru: Параметры гистограммы по умолчанию
tr: Öntanımlı histogram seçenekleri

source: Add bars to current plot
ar: أضِف أشرطة إلى الرسم البياني الحالي
eo: Aldonu stangojn al nuna grafiko
ru: Добавить столбцы к текущему графику
tr: Geçerli grafiğe çubuklar ekle

source: Bar labels
ar: لصائق الشريط
eo: Bret-etikedoj
ru: Подписи столбцов
tr: Çubuk etiketleri

source: Histogram Breakpoints
ar: نقاط توقف المدرج التكراري
eo: Histogramaj Rompovoj
ru: Точки разрыва гистограммы
tr: Histogram Kesme Noktaları

source: Method
ar: الطريقة
eo: Metodo
ru: Метод
tr: Yöntem

source: Sturges
ar: ستورجس
ru: Правило Стёрджеса

source: Scott
ar: سكوت
ru: Правило Скотта

source: Friedman-Diaconis
ar: فريدمان-دياكونيس
ru: Правило Фридмана — Диакониса

source: A single number
ar: عدد مفرد
eo: Ununura nombro
ru: Одно число
tr: Tek bir sayı

source: Integer numbers
ar: أعداد صحيحة
eo: Entjeraj nombroj
ru: Целые числа
tr: Tamsayı sayılar

source: Vector of break points
ar: متجه نقاط التوقف
eo: Vektoro de rompopunktoj
ru: Вектор точек разрыва
tr: Kesme noktalarının vektörü

source: Suggested cells
ar: خلايا مقترحة
eo: Sugestaj ĉeloj
ru: Предлагаемое количество ячеек
tr: Önerilen hücreler

source: Vector length
ar: طول المتجه
eo: Vektora longo
ru: Длина вектора
tr: Vektör uzunluğu

source: Right closed
ar: مغلق من اليمين
eo: Ĝuste fermita
ru: Закрыто справа
tr: Sağ kapalı

source: Include in lowest cell
ar: ضمّن في أدنى خلية
eo: Enmetu en la plej malaltan ĉelon
ru: Включить нижнюю ячейку
tr: En düşük hücrede içer

source: (For vector valued breaks)
ar: (لأجل نقاط التوقف ذات قيم المتجهات)
eo: (Por vektoraj valoraj paŭzoj)
ru: (Для векторнозначных разрывов)
tr: (Vektör değerli kesmeler için)

source: Histogram Line options
ar: خيارات خط الرسم البياني التكراري
eo: Elektoj de Histograma Linio
ru: Параметры линии гистограммы
tr: Histogram Çizgisi Seçenekleri

source: Line type for histogram
ar: نوع الخط للرسم البياني التكراري
eo: Liniotipo por histogramo
ru: Тип линии гистограммы
tr: Histogramın çizgi türü

source: Blank (No lines)
ar: فارغ (لا خطوط)
eo: Blanka (Neniu linioj)
ru: Пустая (нет линий)
tr: Boş (Çizgi yok)

source: Solid
ar: متصل
eo: Solida
ru: Сплошная
tr: Katı

source: Dashed
ar: متقطع
eo: Paŭzita
ru: Штриховая
tr: Tireli

source: Dotted
ar: منقّط
eo: Punktita
ru: Точечная
tr: Noktalı

source: Dot-Dash
ar: نقطة-شرطة
ru: Точка-черта
tr: Noktalı–Tireli

source: Long-dash
ar: شرطة طويلة
eo: Long-streko
ru: Длинная черта
tr: Uzun Tireli

source: Two-dash
ar: شرطتان
eo: Du-streko
ru: Двойная черта
tr: İki Tireli

source: Density of shading lines
ar: كثافة خطوط التظليل
eo: Denso de ombraj linioj
ru: Плотность линий штриховки
tr: Gölgeleme çizgilerinin yoğunluğu

source: Angle of shading lines
ar: زاوية خطوط التظليل
eo: Angulo de ombraj linioj
ru: Угол линий штриховки
tr: Gölgeleme çizgilerinin açısı

source: Histogram Border options
ar: خيارات حدود الرسم البياني التكراري
eo: Opcioj pri Histograma Bordo
ru: Параметры границы гистограммы
tr: Histogram Kenarlığı Seçenekleri

source: Draw border
ar: ارسم الحد
eo: Desegni limon
ru: Рисовать границу
tr: Kenarlığı çiz

source: Histogram Fill options
ar: خيارات تعبئة الرسم البياني التكراري
eo: Histogramo Plenigi opcioj
ru: Параметры заливки гистограммы
tr: Histogram Dolgusu Seçenekleri

source: Use Fill color
ar: استعمل لون التعبئة
eo: Uzu Plenigkoloron
ru: Использовать цвет заливки
tr: Dolgu rengi kullan

source: Generic plot options plugin. More often than not, this plugin is embedded into other plugins. As a result, not all the features explained here are available in a specific embedded situation. When a particular feature is available, it is explained as below.
ar: ملحق خيارات الرسم مبدئي. في أغلب الأحيان، يُضمّن هذا الملحق في ملحقات أخرى. نتيجة لذلك، ليست كل الميزات المشروحة هنا متوفرة في حالة تضمين محددة. عندما تتوفر ميزة معينة، تُشرح كما يلي.
eo: Ĝenerala kromprogramo por grafik-elektebloj. Pli ofte, ĉi tiu kromaĵo estas enigita en aliajn kromaĵojn. Kiel rezulto, ne ĉiuj funkcioj klarigitaj ĉi tie estas haveblaj en specifa enigita situacio. Kiam aparta funkcio estas disponebla, ĝi estas klarigita kiel sube.
ru: Модуль универсальных параметров графика. Чаще всего этот модуль встраивается в другие модули. Поэтому в конкретной ситуации могут быть доступны не все возможности, описание которых приводится здесь.
tr: Genel grafik seçenekleri eklentisi. Çoğu zaman bu eklenti diğer eklentilerin içine yerleştirilmiştir. Sonuç olarak, burada açıklanan özelliklerin tümü belirli bir yerleşik durumda kullanılabilir değildirler. Belirli bir özellik kullanılabilir olduğunda aşağıda açıklanmaktadır.

source: Set or change the various graphical parameters to the plot function.
ar: اضبط أو غيّر المعلمات الرسومية المختلفة لدالة الرسم.
eo: Agordu aŭ ŝanĝu la diversajn grafikajn parametrojn al la grafika funkcio.
ru: Установить или изменить различные графические параметры функции plot.
tr: Çizim işlevine ait çeşitli grafik parametrelerini ayarlayın veya değiştirin.

source: This is the <i>main</i> argument to plot.default. See R reference on <b>plot.default</b>. To achieve a line-break (in a quoted string), enter '\n'.
ar: هذه هي الوسيط <i>main</i> لـ plot.default. انظر دليل R على <b>plot.default</b>. لتحقيق فاصل أسطر (في سلسة نصية مقتبسة)، أدخل '\n'.
eo: Ĉi tiu estas la <i>ĉefa</i> argumento al plot.default. Vidu R-referencon sur <b>plot.default</b>. Por atingi linio-rompon (en citita ĉeno), enigu '\n'.
ru: Это аргумент <i>main</i> функции plot.default. Смотрите справку R по <b>plot.default</b>. Чтобы добавить разрыв строки (в закавыченной строке), введите «\n».
tr: Bu, plot.default’un <i>main</i> argümanıdır. <b>plot.default</b> üzerine olan R başvurusuna bakın. Satır sonu elde etmek için (tırnak içine alınmış bir dizide) ‘\n’ girin.

source: If this box is checked, the <i>main</i> title will be used literally (quoted). Otherwise is will be interpreted as an R statement
ar: إذا وضع علامة على هذا المربع، سيُستعمل العنوان <i>main</i> حرفيًا (مقتبسًا). وإلا، فسيفسر كعبارة R
eo: Se ĉi tiu skatolo estas markita, la titolo <i>ĉefa</i> estos uzata laŭvorte (citita). Alie is estos interpretita kiel R-deklaro
ru: Если этот флажок установлен, заголовок <i>main</i> будет обрабатываться как текстовая строка (в кавычках). В ином случае он будет обработан как инструкция R.
tr: Bu kutu işaretlenirse <i>main</i> başlığı düz anlamıyla kullanılacaktır (tırnak içinde). Aksi halde is bir R ifadesi olarak yorumlanır

source: This is the <i>sub</i> argument to plot.default. See R reference on <b>plot.default</b>. To achieve a line-break (in a quoted string), enter '\n'.
ar: هذه هي الوسيط <i>sub</i> لـ plot.default. انظر دليل R على <b>plot.default</b>. لتحقيق فاصل أسطر (في سلسلة نصية مقتبسة)، أدخل '\n'.
eo: Ĉi tiu estas la <i>sub</i> argumento al plot.default. Vidu R-referencon sur <b>plot.default</b>. Por atingi linio-rompon (en citita ĉeno), enigu '\n'.
ru: Это аргумент <i>sub</i> функции plot.default. Смотрите справку R по <b>plot.default</b>. Чтобы добавить разрыв строки (в закавыченной строке), введите «\n».
tr: Bu, plot.default’un <i>sub</i> argümanıdır. <b>plot.default</b> üzerine olan R başvurusuna bakın. Satır sonu elde etmek için (tırnak içine alınmış bir dizide) ‘\n’ girin.

source: If this box is checked, the <i>sub</i> title will be used literally (quoted). Otherwise is will be interpreted as an R statement
ar: إذا وضع علامة على هذا المربع، سيُستعمل العنوان <i>sub</i> حرفيًا (مقتبسًا). وإلا، فسيفسر كعبارة R
eo: Se ĉi tiu skatolo estas markita, la <i>sub</i> titolo estos uzata laŭvorte (citita). Alie is estos interpretita kiel R-deklaro
ru: Если этот флажок установлен, заголовок <i>sub</i> будет обрабатываться как текстовая строка (в кавычках). В ином случае он будет обработан как инструкция R.
tr: Bu kutu işaretlenirse <i>sub</i> başlığı düz anlamıyla kullanılacaktır (tırnak içinde). Aksi halde is bir R ifadesi olarak yorumlanır

source: Enable this option, if you want to customize the margins.
ar: مكّن هذا الخيار، إذا أردت تخصيص الهوامش.
eo: Ebligu ĉi tiun opcion, se vi volas agordi la randojn.
ru: Включите этот параметр, если требуется настроить поля.
tr: Kenar boşluklarını özelleştirmek istiyorsanız bu seçeneği etkinleştirin.

source: Size of top margin. Size is specified in (approximate) line heights.
ar: حجم الهامش العلوي. يُحدّد الحجم بارتفاعات الأسطر (التقريبية).
eo: Grandeco de supra rando. Grando estas specifita en (proksimuma) linioaltoj.
ru: Размер верхнего поля. Размер указывается в (примерных) высотах строки.
tr: Üst kenar boşluğunun boyutu. Boyut (yaklaşık) satır yükseklikleriyle belirtilir.

source: Size of bottom margin. Size is specified in (approximate) line heights.
ar: حجم الهامش السفلي. يُحدّد الحجم بارتفاعات الأسطر (التقريبية).
eo: Grandeco de malsupra rando. Grando estas specifita en (proksimuma) linioaltoj.
ru: Размер нижнего поля. Размер указывается в (примерных) высотах строки.
tr: Alt kenar boşluğunun boyutu. Boyut (yaklaşık) satır yükseklikleriyle belirtilir.
