Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: This object has %1 dimension(s), but %2 dimension(s) is/are expected.
ar: هذا الكائن له %1 بُعد (أبعاد)، ولكن يُتَوَقَّع %2 بُعد (أبعاد).
ru: Количество измерений этого объекта — %1, но ожидаемое количество — %2.
tr: Bu nesnenin %1 boyutu var, ancak %2 boyut bekleniyor.

source: This object has a length of %1, but a minimum length of %2 is expected.
ar: هذا الكائن له طول %1، ولكن يُتَوَقَّع حد أدنى للطول %2.
ru: Длина этого объекта — %1, но ожидаемая минимальная длина — %2.
tr: Bu nesnenin uzunluğu %1; ancak en az uzunluğun %2 olması bekleniyor.

source: This object has a length of %1, but a maximum length of %2 is expected.
ar: هذا الكائن له طول %1، ولكن يُتَوَقَّع حد أقصى للطول %2.
ru: Длина этого объекта — %1, но ожидаемая максимальная длина — %2.
tr: Bu nesnenin uzunluğu %1; ancak en fazla uzunluğun %2 olması bekleniyor.

source: This object does not appear to belong to any of the classes <i>%1</i>.
ar: لا يبدو أن هذا الكائن ينتمي إلى أي من الفئات <i>%1</i>.
ru: Похоже, этот объект не принадлежит ни к одному из классов <i>%1</i>.
tr: Bu nesne, <i>%1</i> sınıflarından hiçbirine ait görünmüyor.

source: This object's data type is <i>%1</i>, while expected type(s) is/are <i>%2</i>.
ar: نوع بيانات هذا الكائن هو <i>%1</i>، بينما النوع (الأنواع) المُتَوَقَّع هو <i>%2</i>.
ru: Тип данных этого объекта — <i>%1</i>, но ожидаемый тип — <i>%2</i>.
tr: Bu nesnenin veri türü <i>%1</i>, beklenen tür(ler) ise <i>%2</i>.

source: Select one:
ar: اختار واحدًا:
ru: Выбор:
tr: Birini seç:

source: Specify model
ar: حدِّد نموذج
ru: Указание модели
tr: Modeli belirt

source: Full Model
ar: نموذج كامل
ru: Модель полностью
tr: Tüm model

source: Main Effects only
ar: التأثيرات الرئيسية فقط
ru: Только основные эффекты
tr: Yalnızca ana efektler

source: Custom Model:
ar: نموذج مخصص:
ru: Пользовательская модель:
tr: Özel model:

source: Main effects
ar: التأثيرات الرئيسة
ru: Основные эффекты
tr: Ana efektler

source: Level
ar: المستوى
ru: Уровень
tr: Düzey

source: Term
ar: الفترة
ru: Элемент
tr: Terim

source: Enter text
ar: أَدْخِل نصًا
ru: Введите текст
tr: Metin gir

source: Enter data:
ar: أدخل المعلومات:
ru: Данные:
tr: Veri gir:

source: Type on these cells to expand the table
ar: اكتب في هذه الخلايا لتوسيع الجدول
ru: Вводите текст в эти ячейки для расширения таблицы
tr: Tabloyu genişletmek için bu hücrelerde yazın

source: Empty values are not allowed
ar: لا يُسمح بالقيم الفارغة
ru: Значения не могут быть пустыми
tr: Boş değerlere izin verilmez

source: This column contains illegal values in some of its cells
ar: يحتوي هذا العمود على قيم غير قانونية في بعض خلاياه
ru: В некоторых ячейках этого столбца содержатся недопустимые значения
tr: Bu sütunun bazı hücrelerinde izinsiz değerler var

source: Updating status, please wait
ar: جاري تحديث الحالة، من فضلك انتظر
ru: Обновление состояния, подождите
tr: Durum güncelleniyor, lütfen bekleyin

source: This row has not yet been processed.
ar: لم يُعالج هذا الصف بعد.
ru: Эта строка ещё не была обработана.
tr: Bu satır henüz işlenmedi.

source: This row contains invalid settings.
ar: يحتوي هذا الصف على إعدادات غير صالحة.
ru: Эта строка содержит неверные параметры.
tr: Bu satır geçersiz ayarlar içeriyor.

source: Please wait while settings are being processed
ar: من فضلك انتظر ريثما تعالج الإعدادات
ru: Дождитесь окончания обработки параметров
tr: Lütfen ayarlar işlenirken bekleyin

source: One or more rows contain invalid settings.
ar: صف واحد أو أكثر يحتوي على إعدادات غير صالحة.
ru: Одна или несколько строк содержат неверные параметры.
tr: Bir veya daha fazla satır geçersiz ayarlar içeriyor.

source: At least %1 rows have to be defined (if any)
ar: يجب تعريف %1 صفًا على الأقل (إن وجدت)
ru: Минимальное количество строк для определения — %1 (если имеются)
tr: En az %1 satır tanımlanmalıdır (varsa)

source: At least %1 rows have to be defined
ar: يجب تعريف %1 صفًا على الأقل
ru: Минимальное количество строк для определения — %1
tr: En az %1 satır tanımlanmalıdır

source: At most %1 rows may be defined
ar: يَجوز تعريف %1 صفًا على الأكثر
ru: Максимальное количество строк для определения — %1
tr: En çok %1 satır tanımlanabilir

source: This element is not valid for the following reason(s):
ar: هذا العنصر غير صالح للأسباب التالية:
ru: Этот элемент является некорректным по следующим причинам:
tr: Bu öge, aşağıdaki nedenlerden dolayı geçerli değildir:

source: Enter filename
ar: أدخِل اسم الملف
ru: Введите имя файла
tr: Dosya adı gir

source: Select
ar: اختر
ru: Выбрать
tr: Seç

source: The file or directory does not exist.
ar: الملف أو المجلد غير موجود.
ru: Файл или каталог не существует.
tr: Dosya veya dizin yok.

source: Only files (not directories) are acceptable, here.
ar: الملفات فقط (لا المجلدات) مقبولة هنا.
ru: Здесь допускаются только файлы (не каталоги).
tr: Burada yalnızca dosyalara (dizinlere değil) izin verilir.

source: Only directories (not files) are acceptable, here.
ar: المجلدات فقط (لا الملفات) مقبولة هنا.
ru: Здесь допускаются только каталоги (не файлы).
tr: Burada yalnızca dizinlere (dosyalara değil) izin verilir.

source: The specified file is not writable.
ar: الملف المحدد غير قابل للكتابة.
ru: Указанный файл недоступен для записи.
tr: Belirtilen dosya yazılabilir değil.

source: You have to specify a filename (not directory) to write to.
ar: يجب عليك تحديد اسم ملف (لا مجلد) للكتابة فيه.
ru: Необходимо указать имя файла (не каталога) для записи данных.
tr: Kendisine yazılacak bir dosya adı (dizin değil) belirtmelisiniz.

source: <b>Note:</b> The given file already exists, and will be modified / overwritten.
ar: <b>ملاحظة:</b> الملف المحدد موجود مسبقًا، وسيجري تعديله / الكتابة فوقه.
ru: <b>Примечание:</b> указанный файл уже существует, он будет изменён или перезаписан.
tr: <b>Not:</b> Verilen dosya halihazırda var ve değiştirilecek/üzerine yazılacak.

source: Only local files are allowed, here.
ar: يُسمح بالملفات المحلية فقط، هنا.
ru: Здесь допустимы только локальные файлы.
tr: Burada yalnızca yerel dosyalara izin verilir.

source: This url looks valid.
ar: يبدو هذا الرابط صالحًا.
ru: Этот URL-адрес выглядит корректным.
tr: URL geçerli gibi görünüyor.

source: The given filename / url is not valid.
ar: اسم الملف / الرابط المحدد غير صالح.
ru: Указанное имя файла или URL-адрес является некорректным.
tr: Verilen dosya adı/URL geçerli değil.

source: Save to:
ar: احفظ في:
ru: Сохранить в:
tr: Şuraya kaydet:

source: my.data
ar: بياناتي

source: Enter value:
ar: أدخل القيمة:
ru: Значение:
tr: Değer gir:

source: Preview
ar: معاينة
ru: Предварительный просмотр
tr: Önizleme

source: There has been an error while trying to parse the description of this plugin ('%1'). Please refer to stdout for details.
ar: حدث خطأ أثناء محاولة تحليل وصف هذا المُلحق ('%1'). يرجى الرجوع إلى الخرج القياسي (stdout) للحصول على التفاصيل.
ru: При попытке обработать описание этого модуля («%1») произошла ошибка. Подробные сведения доступны в стандартном выводе данных.
tr: Bu eklentinin açıklaması (“%1”) ayrıştırılmaya çalışılırken bir hata oluştu. Ayrıntılar için lütfen stdout’a bakın.

source: Could not create plugin
ar: تعذَّر إنشاء الملحق
ru: Не удалось создать модуль
tr: Eklenti Oluşturulamadı

source: Options
ar: خيارات
ru: Параметры
tr: Seçenekler

source: Code Preview
ar: معاينة الشيفرة
ru: Предварительный просмотр кода
tr: Kod Önizlemesi

source: Submit
ar: أرسل
ru: Отправить
tr: Gönder

source: Auto close
ar: إغلاق آليّ
ru: Автозакрытие
tr: Kendiliğinden kapat

source: Help
ar: مساعدة
ru: Справка
tr: Yardım

source: Use Wizard
ar: استخدِم المُعالِج
ru: Использовать мастер
tr: Sihirbazı Kullan

source: Run again
ar: شغِّل مرة أخرى
ru: Запустить снова
tr: Yeniden çalıştır

source: Processing. Please wait
ar: جاري المعالجة. من فضلك انتظر
ru: Обработка. Подождите
tr: İşlem sürüyor. Lütfen bekleyin

source: Below you can preview the R commands corresponding to the settings you made. Click 'Submit' to run the commands.
ar: يمكنك معاينة أوامر R المطابقة للإعدادات التي أجريتها أدناه. انقر على 'إرسال' لتشغيل الأوامر.
ru: Ниже доступен предварительный просмотр команд R, соответствующих заданным параметрам. Нажмите кнопку «Отправить» для выполнения команд.
tr: Aşağıda, yaptığınız ayarlara karşılık gelen R komutlarının önizlemesini görebilirsiniz. Komutları çalıştırmak için “Gönder”e tıklayın.

source: Below you can preview the result of your settings, and the R commands to be run. Click 'Submit' to run the commands.
ar: يمكنك معاينة نتيجة إعداداتك، وأوامر R التي ستُشغَّل، أدناه. انقر على 'إرسال' لتشغيل الأوامر.
ru: Ниже доступен предварительный просмотр результатов использования заданных параметров, а также команд R, которые будут выполнены. Нажмите кнопку «Отправить» для выполнения команд.
tr: Aşağıda ayarlarınızın sonucunu ve çalıştırılacak R komutlarını önizleyebilirsiniz. Komutları çalıştırmak için “Gönder”e tıklayın.

source: Next >
ar: التالي >
ru: Вперёд >
tr: Sonraki >

source: < Back
ar: < رجوع
ru: < Назад
tr: < Geri

source: Use Dialog
ar: استخدِم الحوار
ru: Использовать диалог
tr: İletişim Kutusu Kullan

source: Select Variable(s)
ar: اختر المتغير(ات)
ru: Выбор переменных
tr: Değişkenleri seç

source: Show all environments
ar: أَظهِر كل البيئات
ru: Показать все окружения
tr: Tüm ortamları göster

source: Show objects in all environments on the <i>search()</i> path, instead of just those in <i>.GlobalEnv</i>. Check this, if you want to select objects from a loaded package.
ar: أَظهِر الكائنات في جميع البيئات الموجودة على مسار <i>search()</i>، بدلاً من تلك الموجودة في <i>.GlobalEnv</i> فقط. افعل هذا، إذا كنت ترغب في تحديد كائنات من حزمة محملة.
ru: Показать объекты во всех окружениях по пути <i>search()</i>, а не только объекты из <i>.GlobalEnv</i>. Включите этот параметр, если требуется выбрать объекты из загруженного пакета.
tr: Tüm ortamlardaki nesneleri yalnızca <i>.GlobalEnv</i>’dekiler yerine <i>search()</i> yolu üzerinde gösterin. Yüklü bir paketten nesneler seçmek istiyorsanız bunu işaretleyin.

source: Show filter options
ar: أَظهِر خيارات التصفية
ru: Показать параметры фильтра
tr: Süzgeç Seçeneklerini Göster

source: Expand all root level objects (show columns of data.frames)
ar: وسِّع كل الكائنات على المستوى الجذري (أَظهِر أعمدة إطارات البيانات)
ru: Развернуть все объекты корневого уровня (показать столбцы data.frame)
tr: Tüm kök düzeyindeki nesneleri genişletin (data.frames sütunlarını gösterin)

source: Collapse all root level objects (hide columns of data.frames)
ar: اطوِ كل الكائنات على المستوى الجذري (أَخفِ أعمدة إطارات البيانات)
ru: Свернуть все объекты корневого уровня (скрыть столбцы data.frame)
tr: Tüm kök düzeyindeki nesneleri daraltın (data.frames sütunlarını gizleyin)

source: Variable:
ar: المتغير:
ru: Переменная:
tr: Değişken:

source: <p>Using this object, here, may lead to failures or unexpected results, for the following reason(s):</p>
ar: <p>قد يؤدي استخدام هذا الكائن، هنا، إلى حالات فشل أو نتائج غير متوقعة، للأسباب التالية:</p>
ru: <p>Использование здесь этого объекта может привести к сбоям или получению непредвиденных результатов. Причина:</p>
tr: <p>Bu nesnenin burada kullanılması, aşağıdaki nedenlerden dolayı hatalara veya beklenmeyen sonuçlara yol açabilir:</p>

source: Running
ar: يعمل
ru: Выполняется
tr: Çalışıyor

source: Canceled
ar: أُلغي
ru: Отменено
tr: İptal edildi

source: Command Chain
ar: تسلسل الأوامر
ru: Цепочка команд
tr: Komut Zinciri

source: Closed
ar: مغلق
ru: Закрыто
tr: Kapalı

source: Waiting
ar: ينتظر
ru: Ожидание
tr: Bekliyor

source: Command Stack
ar: مكدس الأوامر
ru: Стек команд
tr: Komut Yığını

source: Command
ar: الأمر
ru: Команда
tr: Komut

source: Description
ar: الوصف
ru: Описание
tr: Açıklama

source: RKWard failed to detect an R installation on this system. Either R is not installed, or not at one of the standard installation locations.
ar: فشل أر كي وارد في اكتشاف تثبيت R على هذا النظام. إما أن R غير مثبت، أو ليس في أحد مواقع التثبيت القياسية.
ru: RKWard не удалось обнаружить установленный дистрибутив R в этой системе. Установка R либо не выполнена, либо выполнена в нестандартном расположении.
tr: RKWard bu sistemde bir R kurulumunu algılayamadı. Ya R kurulu değil ya da standart kurulum konumlarından birinde değil.

source: The configured R installation at <b>%1</b> does not exist or is not an executable.
ar: تثبيت R المُضبَط في <b>%1</b> غير موجود أو ليس ملفًا تنفيذيًا.
ru: Настроенное расположение дистрибутива R (<b>%1</b>) не существует или не содержит исполняемого файла.
tr: <b>%1</b> konumunda yapılandırılmış R kurulumu ya yok ya da bir yürütülebilir değil.

source: The backend executable could not be found. This is likely to be a problem with your installation.
ar: تعذَّر العثور على الملف التنفيذي للواجهة الخلفية. من المحتمل أن تكون هذه مشكلة في تثبيتك.
ru: Не удалось найти исполняемый файл серверного приложения. Вероятно, это связано с проблемой с установленными компонентами.
tr: Arka uç yürütülebilir dosyası bulunamadı. Bu, büyük olasılıkla kurulumunuzla ilgili bir sorundur.

source: The backend executable could not be started. Error message was: %1
ar: تعذَّر بدء الملف التنفيذي للواجهة الخلفية. كانت رسالة الخطأ هي: %1
ru: Не удалось выполнить запуск исполняемого файла серверного приложения. Получено следующее сообщение об ошибке: %1
tr: Arka uç yürütülebilir dosyası başlatılamadı. Hata iletisi şuydu: %1

source: Error during handshake with backend process. Expected token '%1', received token '%2'
ar: حدث خطأ أثناء المصافحة مع عملية الواجهة الخلفية. الرمز المتوقع '%1'، والرمز المستلَم '%2'
ru: Ошибка при попытке установки связи с процессом серверного приложения. Ожидался маркер «%1», но получен маркер «%2».
tr: Arka uç süreciyle el sıkışma sırasında hata oluştu. “%1” jetonu bekleniyordu, “%2” jetonu alındı

source: Version mismatch during handshake with backend process. Frontend is version '%1' while backend is '%2'. Please fix your installation.
ar: عدم تطابق في الإصدار أثناء المصافحة مع عملية الواجهة الخلفية. الواجهة الأمامية هي الإصدار '%1' بينما الواجهة الخلفية هي '%2'. يرجى إصلاح تثبيتك.
ru: Несоответствие версий при попытке установки связи с процессом серверного приложения. Версия интерфейса — «%1», версия серверного приложения — «%2». Устраните проблему с установленными компонентами.
tr: Arka uç süreciyle el sıkışma sırasında sürüm uyuşmazlığı. Ön uç “%1” sürümünde, arka uç ise “%2”. Lütfen kurulumunuzu onarın.

source: The backend process could not be started. Please check your installation.
ar: تعذَّر بدء عملية الواجهة الخلفية. يرجى التحقق من تثبيتك.
ru: Не удалось запустить процесс серверного приложения. Проверьте корректность установки.
tr: Arka uç süreci başlatılamadı. Lütfen kurulumunuzu denetleyin.

source: The backend process failed to start with exit code %1, message: '%2'.
ar: فشلت عملية الواجهة الخلفية في البدء برمز خروج %1، الرسالة: '%2'.
ru: Не удалось запустить процесс серверного приложения. Код выхода %1, сообщение: «%2».
tr: Arka uç süreci, %1 çıkış kodu ve “%2” iletisi ile başlatılamadı.

source: Backend process has exited with code %1, message: '%2'.
ar: خرجت عملية الواجهة الخلفية بالرمز %1، الرسالة: '%2'.
ru: Процесс серверного приложения завершил работу с кодом %1, сообщение: «%2».
tr: Arka uç süreci, %1 kodu ve “%2” iletisi ile çıktı.

source: The R engine has shut down with status: %1
ar: أُغلقت محرك R بالحالة: %1
ru: Работа движка R была завершена со следующим сообщением о состоянии: %1
tr: R işletkesi, şu durumda ile kapandı: %1

source: The R engine has encountered a fatal error: %1
ar: واجه محرك R خطأ فادحًا: %1
ru: Произошла критическая ошибка движка R: %1
tr: R işletkesi, onulmaz bir hata ile karşılaştı: %1

source: Message from the R backend
ar: رسالة من الواجهة الخلفية لـ R
ru: Сообщение от серверного приложения R
tr: R arka ucundan ileti

source: Question from the R backend
ar: سؤال من الواجهة الخلفية لـ R
ru: Вопрос от серверного приложения R
tr: R arka ucundan soru

source: </p> - The 'rkward' R-library either could not be loaded at all, or not in the correct version. This may lead to all sorts of errors, from single missing features to complete failure to function. The most likely cause is that the last installation did not place all files in the correct place. However, in some cases, left-overs from a previous installation that was not cleanly removed may be the cause.</p> <p><b>You should quit RKWard, now, and fix your installation</b>. For help with that, see <a href="https://rkward.kde.org/compiling">https://rkward.kde.org/compiling</a>.</p>
ar: </p> - إما أنه تعذَّر تحميل مكتبة R 'rkward' على الإطلاق، أو لم تُحمَّل بالإصدار الصحيح. قد يؤدي هذا إلى جميع أنواع الأخطاء، بدءًا من الميزات المفقودة الواحدة إلى الفشل الكامل في العمل. السبب الأكثر احتمالاً هو أن التثبيت الأخير لم يضع كل الملفات في المكان الصحيح. ومع ذلك، في بعض الحالات، قد تكون المخلفات من تثبيت سابق لم يُزلْ بصفة نظيفة هي السبب. </p> <p><b>يجب عليك إنهاء أر كي وارد الآن، وإصلاح تثبيتك</b>. للحصول على مساعدة في ذلك، راجع <a href="https://rkward.kde.org/compiling">https://rkward.kde.org/compiling</a>.</p>
ru: </p> — библиотеку R «rkward» либо вообще не удалось загрузить, либо была загружена неверная её версия. Это может привести к появлению различных ошибок; от отсутствия отдельных возможностей до полной неработоспособности. Вероятнее всего, при последней установке не все файлы оказались в нужном месте. Тем не менее, в некоторых случаях причиной может быть наличие оставшихся от прошлой установки файлов, которые не были корректно удалены.</p> <p><b>Необходимо сейчас выйти из RKWard, а затем исправить проблему с установленными компонентами</b>. Дополнительные сведения: <a href="https://rkward.kde.org/compiling">https://rkward.kde.org/compiling</a>.</p>
tr: <p> - “rkward” R kitaplığı ya hiç yüklenemedi ya da doğru sürümde değil. Bu, tek bir özelliğin eksik olmasından, tümüyle işlevsiz kalmasına kadar her türlü hataya yol açabilir. Bunun en olası nedeni, son kurulumun tüm dosyaları doğru yere yerleştirmemesidir. Ancak bazı durumlarda, önceki kurulumdan kalan ve temiz bir şekilde çıkarılmayan kalıntılar bunun nedeni olabilir.</p> <p><b>Şimdi RKWard’dan çıkıp kurulumunuzu düzeltmelisiniz</b>. Bununle ilgili ek yardım için <a href="https://rkward.kde.org/compiling">https://rkward.kde.org/compiling</a> adresine bakın.</p>

source: <p> -There was a problem setting up the communication with R. Most likely this indicates a broken installation.</p> <p><b>You should quit RKWard, now, and fix your installation</b>. For help with that, see <a href="https://rkward.kde.org/compiling">https://rkward.kde.org/compiling</a>.</p></p>
ar: <p> -حدثت مشكلة في إعداد الاتصال مع R. وعلى الأرجح يشير هذا إلى تثبيت معطوب.</p> <p><b>يجب عليك إنهاء أر كي وارد الآن، وإصلاح تثبيتك</b>. للحصول على مساعدة في ذلك، راجع <a href="https://rkward.kde.org/compiling">https://rkward.kde.org/compiling</a>.</p></p>
ru: <p> — обнаружена проблема при попытке установки связи с R. Вероятнее всего, установленный дистрибутив повреждён.</p> <p><b>Необходимо сейчас выйти из RKWard, а затем исправить проблему с установленными компонентами</b>. Дополнительные сведения: <a href="https://rkward.kde.org/compiling">https://rkward.kde.org/compiling</a>.</p></p>
tr: <p> - R ile iletişim kurulurken bir sorun oluştu. Büyük olasılıkla bu, kurulumun bozuk olduğunu gösteriyor.</p> <p><b><b>Şimdi RKWard’dan çıkıp kurulumunuzu düzeltmelisiniz</b>. Bununle ilgili ek yardım için <a href="https://rkward.kde.org/compiling">https://rkward.kde.org/compiling</a> adresine bakın.</p></p>

source: Graphics version mismatch
ar: عدم تطابق في إصدار الرسوميات
ru: Несоответствие версий графики
tr: Grafikler sürümü uyuşmazlığı

source: R Graphics Engine version has changed (from %1 to %2).<br>This change requires a recompilation.<br><a href="rkward://page/rkward_incompatible_version">Additional information</a>
ar: تغير إصدار محرك رسوميات R (من %1 إلى %2).<br>يتطلب هذا التغيير إعادة تجميع.<br><a href="rkward://page/rkward_incompatible_version">معلومات إضافية</a>
ru: Версия графического движка R изменена (с %1 на %2).<br>Это изменение требует пересборки программы.<br><a href="rkward://page/rkward_incompatible_version">Дополнительные сведения</a>
tr: R Grafikler İşletkesi sürümü değişti (%1 idi, %2 oldu).<br>Bu değişiklik, bir yeniden derleme gerektirir.<br><a href="rkward://page/rkward_incompatible_version">Ek bilgi</a>

source: Ok
ar: حسنًا
ru: ОK
tr: Tamam

source: R Startup
ar: بدء تشغيل R
ru: Запуск R
tr: R Başlangıcı

source: <p> -An unspecified error occurred that is not yet handled by RKWard. Likely RKWard will not function properly. Please check your setup.</p>
ar: <p> -حدث خطأ غير محدد لا يعالجه أر كي وارد بعد. من المرجح أن أر كي وارد لن يعمل بشكل صحيح. يرجى التحقق من إعدادك.</p>
ru: <p> — произошла неизвестная ошибка, обработка которой не предусмотрена в RKWard. Вероятно, RKWard не будет работать надлежащим образом. Проверьте заданные параметры настройки.</p>
tr: <p> - Henüz RKWard tarafından ele alınmayan, belirtilmemiş bir hata oluştu. Büyük olasılıkla RKWard düzgün çalışmayacaktır. Lütfen kurulumunuzu denetleyin.</p>

source: <p>There was a problem starting the R backend. The following error(s) occurred:</p>
ar: <p>حدثت مشكلة في بدء تشغيل الواجهة الخلفية لـ R. حدثت الأخطاء التالية:</p>
ru: <p>При запуске серверного приложения R возникла проблема. Ошибка(и):</p>
tr: <p>R arka ucu başlatırken bir sorun vardı. Aşağıdaki hatalar oluştu:</p>

source: Error starting R
ar: خطأ في بدء تشغيل R
ru: Ошибка запуска R
tr: R başlatılırken hata

source: The R-backend has indicated that in order to carry out the current task it needs the package '%1', which is not currently installed. We will open the package-management tool, and there you can try to locate and install the needed package.
ar: أشارت الواجهة الخلفية لـ R إلى أنه لتنفيذ المهمة الحالية تحتاج إلى الحزمة '%1'، وهي غير مثبتة حاليًا. سنفتح أداة إدارة الحزم، وهناك يمكنك محاولة تحديد موقع الحزمة المطلوبة وتثبيتها.
ru: Серверное приложение R определило, что для выполнения текущего задания необходим пакет «%1», который в настоящее время не установлен. Будет открыто окно управления пакетами, с помощью которого можно указать расположение необходимого пакета и установить его.
tr: R arka ucu, geçerli görevi gerçekleştirmek için şu anda kurulu olmayan “%1” paketine gereksinimi olduğunu belirtti. Paket yönetim aracını açacağız ve orada gerekli paketi bulup kurmayı deneyebilirsiniz.

source: Require package '%1'
ar: تتطلب حزمة '%1'
ru: Требуется пакет «%1»
tr: “%1” Paketi Gerekli

source: Quitting was canceled
ar: أُلغي الإغلاق
ru: Выход отменён
tr: Çıkış iptal edildi
