Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: Dataset
ar: مجموعة البيانات
ru: Набор данных
tr: Veri Kümesi

source: Creates new empty dataset and opens it for editing
ar: ينشئ مجموعة بيانات فارغة جديدة ويفتحها للتحرير
ru: Создаёт новый пустой набор данных и открывает его для редактирования
tr: Yeni boş veri kümesi oluşturur ve düzenleme için açar

source: Script File
ar: ملف نص برمجي
ru: Файл сценария
tr: Betik Dosyası

source: Output document
ar: مستند الإخراج
ru: Выходной документ
tr: Çıktı Belgesi

source: Creates and activates a new output document
ar: ينشئ مستند إخراج جديدًا ويفعّله
ru: Создаёт и активирует новый выходной документ
tr: Yeni bir çıktı belgesi oluşturur ve etkinleştirir

source: Open R Script File...
ar: افتح ملف نص برمجي R...
ru: Открыть сценарий R…
tr: R Betiği Dosyası Aç…

source: Open RKWard Output File...
ar: افتح ملف إخراج أر كي وارد...
ru: Открыть файл вывода RKWard…
tr: R Çıktısı Dosyası Aç…

source: Open any File...
ar: افتح أي ملف...
ru: Открыть любой файл…
tr: Herhangi Bir Dosyayı Aç…

source: Open Recent R Script File
ar: افتح ملف نص برمجي R حديث
ru: Последние сценарии R
tr: Son Kullanılan R Betiği Dosyasını Aç

source: Import Assistant
ar: مساعد الاستيراد
ru: Помощник по импорту
tr: İçe Aktarma Yardımcısı

source: Assistant to find the best method to import data from a variety of formats
ar: مساعد للعثور على أفضل طريقة لاستيراد البيانات من مجموعة متنوعة من التنسيقات
ru: Помощник для поиска наилучшего способа импорта данных различного формата
tr: Çeşitli biçimlerden veriyi içe aktarmanın en iyi yöntemini bulma yardımcısı

source: Open Workspace...
ar: افتح مساحة عمل...
ru: Открыть рабочую область…
tr: Çalışma Alanı Aç…

source: Opens an existing document
ar: يفتح مستندًا موجودًا
ru: Открывает существующий документ
tr: Var olan bir dosyayı açar

source: Open Recent Workspace
ar: افتح مساحة عمل حديثة
ru: Последние рабочие области
tr: Son Kullanılan Çalışma Alanını Aç

source: Opens a recently used file
ar: يفتح ملفًّا مستخدم مؤخّرًا
ru: Открывает один из последних файлов
tr: Son zamanlarda kullanılan bir dosyayı açar

source: Save Workspace
ar: احفظ مساحة العمل
ru: Сохранить рабочую область
tr: Çalışma Alanını Kaydet

source: Saves the actual document
ar: يحفظ المستند الفعلي
ru: Сохраняет текущий документ
tr: Güncel dosyayı kaydeder

source: Save Workspace As
ar: احفظ مساحة العمل باسم
ru: Сохранить рабочую область как
tr: Çalışma Alanını Farklı Kaydet

source: Saves the actual document as...
ar: يحفظ المستند الفعلي باسم...
ru: Сохраняет текущий документ как…
tr: Güncel dosyayı farklı kaydeder…

source: Quits the application
ar: ينهي التَّطبيق
ru: Выход из программы
tr: Uygulamadan çıkar

source: Interrupt all commands
ar: اقطَع كل الأوامر
ru: Прервать все команды
tr: Tüm komutları yarıda keser

source: CC commands to output...
ar: أوامر نسخة كربونية إلى الإخراج...
ru: Скопировать команды в вывод…
tr: Komutları Çıktıya Kopyala…

source: Manage R packages and plugins...
ar: أدِر حزم وملحقات R...
ru: Управление пакетами и модулями R…
tr: R Paketlerini ve Eklentilerini Yönet…

source: Close All Data
ar: أغلِق كل البيانات
ru: Закрыть все данные
tr: Tüm Veriyi Kapat

source: Closes all open data editors
ar: يغلق كل محررات البيانات المفتوحة
ru: Закрывает все открытые редакторы данных
tr: Tüm açık veri düzenleyicilerini kapatır

source: Close All
ar: أغلق الكل
ru: Закрыть все
tr: Tümünü Kapat

source: Detach
ar: افصل
ru: Отсоединить
tr: Ayır

source: Check installation
ar: تأكد من التثبيت
ru: Проверить установку
tr: Kurulumu Denetle

source: [No actions available for current view]
ar: [لا توجد إجراءات متاحة للعرض الحالي]
ru: [Для текущего представления нет доступных действий]
tr: [Geçerli görünüm için kullanılabilir eylem yok]

source: Open...
ar: افتح...
ru: Открыть…
tr: Aç…

source: Create...
ar: أنشئ...
ru: Создать…
tr: Oluştur…

source: Save...
ar: احفظ...
ru: Сохранить…
tr: Kaydet…

source: Restart R Backend
ar: أعِد تشغيل الواجهة الخلفية لـ R
ru: Перезапустить серверное приложение R
tr: R Arka Ucunu Yeniden Başlat

source: <p><b>Restarting the backend will discard all unsaved data in this workspace!</b> All data editors, and graphics windows will be closed.</p><p>Are you sure you want to proceed?</p>
ar: <p><b>إعادة تشغيل الواجهة الخلفية ستتخلص من جميع البيانات غير المحفوظة في مساحة العمل هذه!</b> ستُغلَق جميع محررات البيانات ونوافذ الرسوميات.</p><p>هل أنت متأكد من أنك تريد المتابعة؟</p>
ru: <p><b>При перезапуске серверного приложения будут потеряны все несохранённые данные в этой рабочей области!</b> Будут закрыты все редакторы данных и графические окна.</p><p>Продолжить?</p>
tr: <p><b>Arka ucu yeniden başlatmak bu çalışma alanındaki tüm kaydedilmemiş işin kaybolmasına neden olacak!</b> Tüm veri düzenleyicileri ve grafik pencereleri kapatılacak.</p><p>Sürdürmek istediğinizden emin misiniz?</p>

source: Restart R backend
ar: أعِد تشغيل الواجهة الخلفية لـ R
ru: Перезапустить серверное приложение R
tr: R Arka Ucunu Yeniden Başlat

source: <p>One or more operations are pending.</p><p>If you have recently chosen to save your workspace, and you see this message, <b>your data may not be saved, yet!</b></p><p>How do you want to proceed?</p>
ar: <p>عملية واحدة أو أكثر معلقة.</p><p>إذا اخترت مؤخرًا حفظ مساحة عملك، ورأيت هذه الرسالة، <b>فقد لا تكون بياناتك محفوظة بعد!</b></p><p>كيف تريد المتابعة؟</p>
ru: <p>В очереди одна или несколько операций.</p><p>Если программа недавно получила команду сохранить рабочую область и появилось это сообщение, <b>то данные, возможно, ещё не сохранены!</b></p><p>Что следует сделать?</p>
tr: <p>Bir veya daha fazla işlem beklemede.</p><p>Yakın zamanda çalışma alanınızı kaydetmeyi seçtiyseniz ve bu iletiyi görüyorsanız <b>veriniz henüz kaydedilmemiş olabilir!</b></p><p>Nasıl ilerlemek istiyorsunuz?</p>

source: R commands still pending
ar: أوامر R لا تزال معلقة
ru: В очереди есть команды R
tr: R Komutları Beklemede

source: Force restart now
ar: أفرِض إعادة التشغيل الآن
ru: Выполнить принудительный перезапуск сейчас
tr: Şimdi Yeniden Başlatmayı Zorla

source: Check again
ar: تحقق مجددًا
ru: Проверить ещё раз
tr: Yeniden Denetle

source: Cancel restarting
ar: ألغِ إعادة التشغيل
ru: Отменить перезапуск
tr: Yeniden Başlatmayı İptal Et

source: Current working directory
ar: مجلد العمل الحالي
ru: Текущий рабочий каталог
tr: Geçerli çalışma dizini

source: Configure R backend
ar: اضبط الواجهة الخلفية لـ R
ru: Настроить серверное приложение R
tr: R Arka Ucunu Yapılandır

source: Exiting...
ar: يخرج…
ru: Выход…
tr: Çıkılıyor…

source: New dataset
ar: مجموعة بيانات جديدة
ru: Новый набор данных
tr: Yeni Veri Kümesi

source: Enter name for the new dataset
ar: أَدْخِل اسم مجموعة البيانات الجديدة
ru: Введите название нового набора данных
tr: Yeni veri kümesi için ad girin

source: Opening workspace...
ar: جاري فتح مساحة العمل...
ru: Открытие рабочей области…
tr: Çalışma alanı açılıyor…

source: Select workspace to open...
ar: اختر مساحة العمل لفتحها...
ru: Рабочая область для открытия…
tr: Açılacak çalışma alanını seç…

source: The <b>R</b> engine is busy.
ar: محرك <b>R</b> مشغول.
ru: Движок <b>R</b> занят.
tr: <b>R</b> işletkesi meşgul.

source: The <b>R</b> engine is idle.
ar: محرك <b>R</b> خاملاً.
ru: Движок <b>R</b> бездействует.
tr: <b>R</b> işletkesi boşta.

source: The <b>R</b> engine is being initialized.
ar: محرك <b>R</b> قيد التهيئة.
ru: Движок <b>R</b> инициализируется.
tr: <b>R</b> işletkesi başlatılıyor.

source: The <b>R</b> engine is unavailable.
ar: محرك <b>R</b> غير متاح.
ru: Движок <b>R</b> недоступен.
tr: <b>R</b> işletkesi kullanılamıyor.

source: R engine unavailable. See <a href="rkward://page/rkward_trouble_shooting">troubleshooting</a> for possible solutions.
ar: محرك R غير متاح. راجع <a href="rkward://page/rkward_trouble_shooting">استكشاف الأخطاء وإصلاحها</a> لحلول محتملة.
ru: Движок R недоступен. Возможные решения доступны в разделе <a href="rkward://page/rkward_trouble_shooting">устранение неисправностей</a>.
tr: R işletkesi kullanılamıyor. Olası çözümler için <a href="rkward://page/rkward_trouble_shooting">tanılama</a> bölümüne bakın.

source: Open
ar: افتح
ru: Открыть
tr: Aç

source: Opening mode:
ar: وضع الفتح:
ru: Режим открытия:
tr: Açma kipi:

source: Guess file type, automatically
ar: خَمِّن نوع الملف، آليًا
ru: Автоматически определить тип файла
tr: Dosya türünü kendiliğinden tahmin et

source: Open as text / script file
ar: افتح كملف نص / نص برمجي
ru: Открыть как текстовый файл или сценарий
tr: Metin/betik dosyası olarak aç

source: Open as text file and force R highlighting
ar: افتح كملف نص وافرِض تمييز R
ru: Открыть как текстовый файл и принудительно применить подсветку R
tr: Metin dosyası olarak aç ve R vurgulamasını zorla

source: Open as R workspace
ar: افتح كمساحة عمل R

source: Select RKWard Output file to open...
ar: اختر ملف إخراج أر كي وارد لفتحه...
ru: Файл вывода RKWard для открытия…
tr: Açılacak RKWard çıktı dosyasını seç…

source: RKWard Output Files [*.rko](*.rko);;All files [*](*)
ar: ملفات إخراج أر كي وارد [*.rko](*.rko);;كل الملفات [*](*)
ru: Файлы вывода RKWard [*.rko](*.rko);;Все файлы [*](*)
tr: RKWard çıktı dosyaları [*.rko](*.rko);;Tüm dosyalar [*](*)

source: Open script file(s)
ar: افتح ملف (ملفات) نص برمجي
ru: Открыть файлы сценариев
tr: Betik dosyaları aç

source: [Unnamed Workspace]
ar: [مساحة عمل غير مُسمّاة]
ru: [Безымянная рабочая область]
tr: [Adsız Çalışma Alanı]

source: &New
ar: &جديد
ru: &Создать
tr: &Yeni

source: &Open by Type
ar: &افتح حسب النوع
ru: &Открыть по типу
tr: Türe Göre &Aç

source: &Import
ar: ا&ستورد
ru: &Импорт
tr: &İçe Aktar

source: &Export
ar: &صدّر
ru: &Экспорт
tr: &Dışa Aktar

source: &Workspace
ar: &مساحة العمل
ru: &Рабочая область
tr: &Çalışma Alanı

source: &Windows
ar: ال&نوافذ
ru: &Окно
tr: &Pencereler

source: &Activate
ar: &نشّط
ru: &Активировать
tr: &Etkinleştir

source: &Settings
ar: إ&عدادات
ru: &Настройка
tr: Ayar&lar

source: &Help
ar: م&ساعدة
ru: &Справка
tr: &Yardım

source: summary (x)
ar: ملخص (x)
tr: özet (x)

source: print (x)
ar: اطبَع (x)
tr: yazdır (x)

source: str (x)
ar: بنية (x)
tr: yapı (x)

source: <b>Object was deleted</b>
ar: <b>حُذف الكائن</b>
ru: <b>Объект удалён</b>
tr: <b>Nesne silindi</b>

source: Object Viewer: %1
ar: عارض الكائنات: %1
ru: Средство просмотра объектов: %1
tr: Nesne görüntüleyicisi: %1

source: The object was changed. You may want to click "Update"
ar: غُير الكائن. قد ترغب في النقر على "تحديث"
ru: Объект был изменён. Нажмите кнопку «Обновить»
tr: Nesne değiştirildi. “Güncelle”ye tıklamak isteyebilirsiniz

source: Update
ar: حدّث
ru: Обновить
tr: Güncelle

source: Fetching information
ar: جاري جلب المعلومات
ru: Получение информации
tr: Bilgiler getiriliyor

source: The QtScript-backend has reported an error: %1
ar: أبلغت الواجهة الخلفية لـ QtScript عن خطأ: %1
ru: Серверное приложение QtScript сообщило об ошибке: %1
tr: QtScript arka ucu bir hata bildirdi: %1

source: Scripting error
ar: خطأ في البرمجة النصية
ru: Ошибка при работе со сценарием
tr: Betik yazımı hatası

source: Script Error in %1, line %2: %3 Backtrace: %4
ar: خطأ في النص البرمجي في %1، السطر %2: %3 تتبع خلفي: %4
ru: Ошибка сценария в %1, строка %2: %3 Обратная трассировка: %4
tr: %1 içinde %2. satırda betik hatası: %3 Geri iz: %4

source: The file "%1" (needed by "%2") could not be found. Please check your installation.
ar: تعذَّر العثور على الملف "%1" (الذي يحتاجه "%2"). يرجى التحقق من تثبيتك.
ru: Не удалось найти файл «%1» (необходимый для работы «%2»). Проверьте корректность установки.
tr: “%1” dosyası (“%2” tarafından gerekli) bulunamadı. Lütfen kurulumunuzu denetleyin.

source: inlined code
ar: شيفرة مضمّنة
ru: встроенный код
tr: satır içi kod

source: Script Error at '%1' line %2: %3
ar: خطأ في النص البرمجي عند '%1' السطر %2: %3
ru: Ошибка сценария в «%1» на строке %2: %3
tr: “%1” içinde %2. satırda betik hatası: %3

source: error ('The file "%1" (needed by "%2") could not be found. Please check your installation.');
ar: خطأ ('تعذَّر العثور على الملف "%1" (الذي يحتاجه "%2"). يرجى التحقق من تثبيتك.')؛
ru: ошибка («Не удалось найти файл "%1" (который требуется "%2"). Проверьте корректность установки.»);
tr: Hata (““%1” dosyası (“%2” tarafından gerekli) bulunamadı. Lütfen kurulumunuzu denetleyin.”);

source: ## Prepare
ar: ## جهز
ru: ## Подготовить
tr: ## Hazırla

source: ## Compute
ar: ## احسب
ru: ## Вычислить
tr: ## Hesapla

source: ## Print result
ar: ## اطبع النتيجة
ru: ## Вывести результат
tr: ## Sonucu Yazdır

source: Settings
ar: إعدادات
ru: Настройка
tr: Ayarlar

source: Code Completion / Code Hints
ar: إكمال الشيفرة / تلميحات الشيفرة
ru: Автодополнение кода и подсказки
tr: Kod Tamamlama/İpuçları

source: Function call tip
ar: تلميح استدعاء الدالة
ru: Подсказка по вызову функций
tr: İşlev çağrısı ipuçları

source: Function argument completion
ar: إكمال وسائط الدالة
ru: Автодополнение аргументов функций
tr: İşlev argümanı tamamlaması

source: Object name completion
ar: إكمال اسم الكائن
ru: Автодополнение имён объектов
tr: Nesne adı tamamlaması

source: Filename completion
ar: إكمال اسم الملف
ru: Автодополнение имён файлов
tr: Dosya adı tamamlaması

source: Auto word completion
ar: إكمال الكلمات الآليّ
ru: Автодополнение слов
tr: Kendiliğinden sözcük tamamlama

source: Mouseover object info
ar: معلومات الكائن عند تمرير الفأرة
ru: Информация об объектах при наведении мыши
tr: İmleç altı nesne bilgisi

source: Start code completions/hints, automatically
ar: ابدأ إكمال/تلميحات الشيفرة، آليًا
ru: Автоматически начинать автодополнение кода и показывать подсказки
tr: Kod tamamlamayı/ipuçlarını kendiliğinden başlat

source: Minimum number of characters
ar: الحد الأدنى لعدد الأحرف
ru: Минимальное количество символов
tr: En az karakter sayısı

source: Timeout (milliseconds)
ar: مهلة (ملي ثانية)
ru: Тайм-аут (в миллисекундах)
tr: Zaman aşımı (milisaniye)

source: (Attempt to) start completion whenever the cursor position changes
ar: ابدأ (حاول بدء) الإكمال كلما تغير موضع المؤشر
ru: (Пытаться) начинать автодополнение при изменении позиции курсора
tr: İmleç konumu değiştiğinde tamamlamayı başlat/başlatmaya çalış

source: Note: Further shortcuts can be assigned, and by default, Ctlr+Space invokes completions, in addition to this. Further, pressing the Tab key, while completions are shown, performs partial completion (if possible), independent of this setting.
ar: ملاحظة: يمكن تعيين اختصارات إضافية، وبمبدئي، يستدعي Ctrl+Space الإكمال، بالإضافة إلى هذا. علاوة على ذلك، الضغط على مفتاح Tab، أثناء عرض الإكمال، يؤدي إلى إكمال جزئي (إذا كان ذلك ممكنًا)، مستقلًا عن هذا الإعداد.
ru: Примечание: можно назначить и дополнительные комбинации клавиш. По умолчанию Ctlr + пробел также вызывает автодополнение. Кроме того, нажатие клавиши Tab во время показа вариантов автодополнения позволяет выполнить частичное дополнение (если это возможно) независимо от значения этого параметра.
tr: Not: Daha fazla kısayol atanabilir ve öntanımlı olarak Kontrol+Boşluk buna ek olarak tamamlamaları da çağırır. Ayrıca, tamamlamalar gösterilirken Sekme düğmesine basıldığında bu ayardan bağımsız olarak kısımsal tamamlama (olanaklıysa) gerçekleştirilir.

source: Tab key invokes code completion
ar: مفتاح Tab يستدعي إكمال الشيفرة
ru: Tab вызывает автодополнение кода
tr: Sekme düğmesi kod tamamlamayı çağırır

source: Up/down cursor keys
ar: مفاتيح مؤشر أعلى/أسفل
ru: Клавиши курсора «вверх» и «вниз»
tr: Yukarı/Aşağı imleç düğmeleri

source: Alt+Up/down cursor keys
ar: مفاتيح مؤشر Alt+أعلى/أسفل
ru: Alt + клавиши курсора «вверх» и «вниз»
tr: Seçenek+Yukarı/Aşağı imleç düğmeleri

source: If you wish to avoid ambiguity between navigation completion options and navigating the document, you can set the behavior such that completion items are navigate using Alt+up / Alt+down, instead of just the up/down cursor keys.
ar: إذا كنت ترغب في تجنب الغموض بين خيارات إكمال التنقل والتنقل في المستند، يمكنك ضبط السلوك بحيث يجري التنقل في عناصر الإكمال باستخدام Alt+أعلى / Alt+أسفل، بدلاً من مجرد مفاتيح مؤشر أعلى/أسفل.
ru: Чтобы избежать неоднозначности между навигацией по вариантам автодополнения и навигацией по документу, можно настроить программу так, чтобы перебор вариантов автодополнения выполнялся по нажатию Alt + «вверх» и Alt + «вниз», а не просто с помощью клавиш курсора «вверх» и «вниз».
tr: Dolaşmayı tamamlama seçenekleri ile belgede dolaşma arasındaki belirsizliği önlemek istiyorsanız davranışı, tamamlama ögelerinde yalnızca yukarı/aşağı imleç düğmeleri yerine Seçenek+Yukarı/Seçenek+Aşağı kullanılarak dolaşılacak biçimde ayarlayabilirsiniz.

source: Keyboard navigation of completion items
ar: تنقل لوحة المفاتيح لعناصر الإكمال
ru: Навигация по вариантам автодополнения с помощью клавиатуры
tr: Tamamlama ögelerinde klavye dolaşımı

source: '$'-operator (list$member)
ar: عامل '$' (list$member)
ru: «$»-оператор (список$элемент)
tr: “$” işleci (list$üyesi)

source: '[['-operator (list[["member"]])
ar: عامل '[[' (list[["member"]])
ru: «[[»-оператор (список[["элемент"]])
tr: '[[' işleci (list[["üye"]])

source: Operator for access to members of list() and data.frame() objects
ar: عامل للوصول إلى أعضاء كائنات list() و data.frame()
ru: Оператор для доступа к элементам объектов list() и data.frame()
tr: list() ve data.frame() nesnelerinin üyelerine erişme işleci

source: '@'-operator (object@member)
ar: عامل التشغيل '@' (الكائن@العضو)
ru: «@»-оператор (объект@элемент)
tr: “@” işleci (nesne@üye)

source: 'slot()'-function (slot(object, member))
ar: دالة 'slot()' (slot(كائن, عضو))
ru: «slot()»-функция (slot(объект, элемент))
tr: “slot()” işleci (slot(nesne, üye))

# Note: S4-slot() is a programming term in R, and should not be translated, here
source: Operator for access to S4-slot()s
ar: عامل للوصول إلى S4-slot()s
ru: Оператор для доступа к S4-slot()
tr: S4-slot()’larına erişim işleci

source: For masked objects, only
ar: للكائنات المقنّعة، فقط
ru: Только для маскированных объектов
tr: Yalnızca maskelenmiş nesneler için

source: For objects outside of <i>.GlobalEnv</i>, only
ar: للكائنات خارج <i>.GlobalEnv</i>، فقط
ru: Только для объектов вне <i>.GlobalEnv</i>
tr: Yalnızca <i>.GlobalEnv</i> dışındaki nesneler için

source: Always
ar: دائمًا
ru: Всегда
tr: Her zaman

source: Include environment for objects on the search path:
ar: ضم البيئة للكائنات الموجودة على مسار البحث:
ru: Включить окружение для объектов по пути поиска:
tr: Arama yolunda nesnelerin ortamlarını içer:

source: Offer completions in all file types (not just R scripts)
ar: اعرض الإكمال في جميع أنواع الملفات (وليس نصوص R البرمجية فقط)
ru: Предлагать автодополнение в файлах всех типов (не только в сценариях R)
tr: Tüm dosya türleri için tamamlamayı öner (yalnızca R betikleri değil)

source: <b>Note: </b>Additional (common) completion options are available at the <a href="rkward://settings/editor">script editor settings</a>
ar: <b>ملاحظة: </b> تتوفر خيارات إكمال إضافية (شائعة) في <a href="rkward://settings/editor">إعدادات محرر النصوص البرمجية</a>
ru: <b>Примечание: </b>дополнительные (общие) параметры автодополнения доступны в <a href="rkward://settings/editor">разделе настройки редактора сценариев</a>
tr: <b>Not: </b>Ek (yaygın) tamamlama seçeneklerine <a href="rkward://settings/editor">betik düzenleyicisi ayarlarından</a> erişilebilir

source: Script editor
ar: محرّر السّكربتات
ru: Редактор сценариев
tr: Betik düzenleyicisi

source: Settings marked with (*) do not take effect until you restart RKWard
ar: الإعدادات المميزة بـ (*) لا تسري حتى تعيد تشغيل أر كي وارد
ru: Параметры, отмеченные символом (*), вступят в силу только после перезапуска RKWard
tr: (*) ile imlenen ayarlar, RKWard yeniden başlatılıncaya kadar etkili olmaz

source: Autosaves
ar: حفظ آلي
ru: Автосохранения
tr: Kendiliğinden Kaydetmeler

source: Autosave interval (minutes)
ar: فاصل الحفظ الآلي (بالدقائق)
ru: Интервал автосохранения (в минутах)
tr: Kendiliğinden kaydetme aralığı (dakika)

source: Keep autosave file after manual save
ar: أبقِ ملف الحفظ الآلي بعد الحفظ اليدوي
ru: Оставить файл автосохранения после сохранения вручную
tr: Elle kaydetme sonrası kendiliğinden kaydetme dosyasını tut

source: <p>A list of filters (file name extensions) that should be treated as R script files. Most importantly, files matching one of these filters will always be opened with R syntax highlighting.</p><p>Filters are case insensitive.</p>
ar: <p>قائمة من المُرشحات (ملحقات اسم الملف) التي يجب معاملتها كملفات نص R البرمجي. الأهم من ذلك، الملفات التي تطابق أحد هذه المرشحات افتحها دائمًا مع إبراز صيغة R.</p><p>المرشحات غير حساسة لحالة الأحرف.</p>
ru: <p>Список фильтров (расширения имён файлов) для файлов, которые должны обрабатываться как сценарии R. Самое главное: файлы, соответствующие одному из этих фильтров, всегда будут открываться с подсветкой синтаксиса R.</p><p>Фильтры нечувствительны к регистру.</p>
tr: <p>R betiği dosyaları olarak değerlendirilmesi gereken süzgeçlerin (dosya adı uzantıları) listesi. En önemlisi, bu süzgeçlerden biriyle eşleşen dosyalar her zaman R sözdizimi vurgulanarak açılacaktır.</p><p>Süzgeçler, BÜYÜK/küçük harf duyarsızdır.</p>

source: R script file filters (separated by spaces)
ar: مرشحات ملف نص R البرمجي (افصلها بمسافات)
ru: Фильтры файлов сценариев R (разделяются пробелами)
tr: R betiği dosyası süzgeçleri (boşluklarla ayrılmış)

source: Console
ar: الطرفية
ru: Консоль
tr: Konsol

source: Load/Save command history
ar: حمّل/احفظ سجل الأوامر
ru: Сохранять и загружать журнал команд
tr: Yükle/Kaydet komutu geçmişi

source: Maximum length of command history (0 for no limit)
ar: الحد الأقصى لطول سجل الأوامر (0 بلا حد)
ru: Максимальная длина журнала команд (0 — без ограничений)
tr: Komut geçmişinin en çok uzunluğu (sınırsız için 0)

source: Maximum number of paragraphs/lines to display in the console (0 for not limit)
ar: الحد الأقصى لعدد الفقرات/السطور لعرضها في الطرفية (0 بلا حد)
ru: Максимальное количество абзацев/строк для показа в консоли (0 — без ограничений)
tr: Konsolda görüntülenecek en çok paragraf/satır sayısı (sınırsız için 0)

source: Run commands from script editor through console
ar: شغّل الأوامر من محرر النصوص البرمجية عبر الطرفية
ru: Запускать команды из редактора сценариев через консоль
tr: Komutları betik düzenleyicisinden konsol aracılığıyla çalıştır

source: Also add those commands to console history
ar: أضف تلك الأوامر أيضًا إلى سجل الطرفية
ru: Также добавлять эти команды в журнал консоли
tr: Aynı zamanda bu komutları konsol geçmişine ekle

source: Do not add
ar: لا تُضف
ru: Не добавлять
tr: Ekleme

source: Add only if single line
ar: أضف إذا كان سطرًا واحدًا فقط
ru: Добавить, если это одна строка
tr: Yalnızca tek satırsa ekle

source: Add all commands
ar: أضف جميع الأوامر
ru: Добавить все команды
tr: Tüm komutları ekle

source: Command history is context sensitive by default
ar: سجل الأوامر حساس للسياق مبدئيًا
ru: По умолчанию журнал команд учитывает контекст
tr: Komut geçmişi öntanımlı olarak bağlama duyarlıdır

source: Debug
ar: نقّح
ru: Отладка
tr: Hata Ayıklama

source: <b>These settings are for debugging purposes, only.</b> It is safe to leave them untouched. Also, these settings will only apply to the current session, and will not be saved.
ar: <b>هذه الإعدادات لأغراض التصحيح فقط.</b> من الآمن تركها كما هي. أيضًا، هذه الإعدادات تسري على الجلسة الحالية فقط، ولن تحفظ.
ru: <b>Эти параметры предназначены исключительно для целей отладки.</b> Можно спокойно оставить их без изменений. Кроме того, эти параметры применяются только к текущему сеансу, они не будут сохранены.
tr: <b>Bu ayarlar yalnızca hata ayıklama amaçlıdır.</b> Onlara dokunmadan bırakmak daha iyidir. Ayrıca bu ayarlar yalnızca geçerli oturum için geçerlidir ve kaydedilmezler.

source: Debug level
ar: مستوى التصحيح
ru: Уровень отладки
tr: Hata ayıklama düzeyi

source: Debug flags
ar: علامات التصحيح
ru: Флаги отладки
tr: Hata ayıklama bayrakları

source: Command timeout
ar: مهلة الأوامر
ru: Тайм-аут команды
tr: Komut zaman aşımı
