Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
ru: Олеся Герасименко
tr: Kaan Özdinçer, Emir SARI

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
ru: translation-team@basealt.ru
tr: kaanozdincer@gmail.com, emir_sari@icloud.com

source: The object '%1', could not be opened for editing. Either it does not exist, or RKWard does not support editing this type of object, yet.
ar: تعذر فتح الكائن '%1' للتعديل. إما أنه غير موجود، أو لا يدعم أر كي وارد تعديل هذا النوع من الكائنات بعد.
ru: Не удалось открыть объект «%1» для редактирования. Либо этот объект не существует, либо RKWard ещё не поддерживает редактирование объектов такого типа.
tr: “%1” nesnesi düzenlemek için açılamadı. Ya yok ya da RKWard bu tür nesnelerin düzenlenmesini henüz desteklemiyor.

source: Cannot edit '%1'
ar: لا يمكن تحرير '%1'
ru: Невозможно изменить «%1»
tr: “%1” düzenlenemiyor

source: Loading Workspace...
ar: يحمّل مساحة العمل...
ru: Загрузка рабочей области…
tr: Çalışma alanı yükleniyor…

source: There has been an error opening file '%1': %2
ar: وقع خطأ أثناء فتح الملف '%1': %2
ru: При открытии файла «%1» произошла ошибка: %2
tr: “%1” dosyası açılırken bir hata oluştu: %2

source: Error loading workspace
ar: خطأ في تحميل مساحة العمل
ru: Ошибка загрузки рабочей области
tr: Çalışma Alanı Yükleme Hatası

source: No service was found to provide a KDE print dialog for PostScript files. We will try to open a generic PostScript viewer (if any), instead.<br><br>Consider installing 'okular', or configure RKWard not to attempt to print using a KDE print dialog.
ar: لم يعثر على خدمة لتقديم حوار طباعة كيدي لملفات PostScript. ستحاول فتح عارض PostScript عام (إن وجد) بدلاً من ذلك.<br><br>فكر في تثبيت 'okular'، أو اضبط RKWard على عدم محاولة الطباعة باستخدام حوار طباعة كيدي.
ru: Не найдена служба, предоставляющая диалоговое окно печати KDE для файлов PostScript. Вместо этого будет открыто типовое средство просмотра PostScript (если имеется).<br><br>Рекомендуется установить пакет «okular» или настроить RKWard так, чтобы программа не пыталась выполнить печать через диалог печати KDE.
tr: PostScript dosyaları için KDE yazdırma iletişim kutusu sağlayacak bir hizmet bulunamadı. Bunun yerine genel bir PostScript görüntüleyicisi (varsa) açmayı deneyeceğiz.<br><br>“Okular”ı kurmayı düşünün veya RKWard’ı, KDE yazdırma iletişim kutusunu kullanarak yazdırmayı denemeyecek şekilde yapılandırın.

source: Unable to open KDE print dialog
ar: تعذر فتح حوار طباعة كيدي
ru: Не удалось открыть диалог печати KDE
tr: KDE Yazdırma Hizmeti Açılamadı

source: Waiting for remaining R commands to finish. To quit immediately, press Cancel (WARNING: This may result in loss of data)
ar: انتظر انتهاء أوامر R المتبقية. للإغلاق فوراً، اضغط على إلغاء (تحذير: قد يؤدي هذا إلى فقدان البيانات)
ru: Ожидание завершения выполнения оставшихся команд R. Чтобы выполнить выход немедленно, нажмите кнопку «Отмена» (ВНИМАНИЕ: это может привести к потере данных)
tr: Kalan R komutlarının bitmesi bekleniyor. Hemen çıkmak için “İptal”e basın (UYARI: Bu, veri kaybına neden olabilir)

source: Waiting for R to finish
ar: انتظر انتهاء R
ru: Ожидание завершения R
tr: Bitirmek için R Bekleniyor

source: A file named "%1" already exists. Are you sure you want to overwrite it?
ar: الملفّ بالاسم "%1" موجود فعلًا. أمتأكّد من الكتابة فوقه؟
ru: Файл с именем «%1» уже существует. Заменить его?
tr: “%1” adlı bir dosya halihazırda var. Üzerine yazmak istediğinizden emin misiniz?

source: A file named "%1" already exists, and will be overwritten when saving to "%2". Are you sure you want to overwrite it?
ar: ملف بالاسم "%1" موجود بالفعل، وستجري الكتابة فوقه عند الحفظ في "%2". هل أنت متأكد من رغبتك في الكتابة فوقه؟
ru: Файл с именем «%1» уже существует, он будет заменён при сохранении в «%2». Заменить его?
tr: “%1” adlı bir dosya halihazırda var ve “%2” konumuna kaydedilirken üzerine yazılacak. Üzerine yazmak istediğinizden emin misiniz?

source: Files named "%1" and "%2" already exist, and will both be overwritten. Are you sure you want to overwrite them?
ar: الملفان المسميان "%1" و "%2" موجودان بالفعل، وستجري الكتابة فوقهما. هل أنت متأكد من رغبتك في الكتابة فوقهما؟
ru: Файлы с именами «%1» и «%2» уже существуют, они оба будут заменены. Заменить их?
tr: “%1” ve “%2” adlı dosyalar halihazırda var ve her ikisinin de üzerine yazılacak. Üzerilerine yazmak istediğinizden emin misiniz?

source: Overwrite File?
ar: أأكتب فوق الملفّ؟
ru: Заменить файл?
tr: Üzerine Yazılsın mı?

source: R Workspace Files [%1](%1);;All files [*](*)
ar: ملفات مساحة عمل R [%1](%1);;جميع الملفات [*](*)
ru: Рабочие области R [%1](%1);;Все файлы [*](*)
tr: R Çalışma Alanı dosyaları [%1](%1);;Tüm dosyalar [*](*)

source: Workspace is being saved. <b>Hint:</b> Should this take an unusually long time, on a regular sized workspace, this may be due to other commands still pending completion in the R backend.
ar: يجري حفظ مساحة العمل. <b>تلميح:</b> إذا استغرق هذا وقتًا طويلاً على غير المعتاد، في مساحة عمل ذات حجم عادي، فقد يكون هذا بسبب أوامر أخرى لم تكتمل بعد في الواجهة الخلفية لـ R.
ru: Выполняется сохранение рабочей области. <b>Подсказка:</b> если рабочая область обычного размера сохраняется необычно долго, причиной этого может быть наличие других ожидающих завершения команд в серверном приложении R.
tr: Çalışma alanı kaydediliyor. <b>İpucu:</b> Normal boyutlu bir çalışma alanında bu işlemin alışılmadık derecede uzun sürmesi durumunda, bunun nedeni R arka ucunda hâlâ tamamlanmayı bekleyen diğer komutlar olması olabilir.

source: Saving workspace
ar: يحفظ مساحة العمل
ru: Сохранение рабочей области
tr: Çalışma Alanı Kaydediliyor

source: Save failed
ar: فشل الحفظ
ru: Ошибка сохранения
tr: Kaydedilemedi

source: An error occurred while trying to save the workspace. You data was <b>not</b> saved.
ar: وقع خطأ أثناء محاولة حفظ مساحة العمل. لم يحفظ بياناتك <b>بنجاح</b>.
ru: При попытке сохранения рабочей области произошла ошибка. Данные <b>не</b> сохранены.
tr: Çalışma alanı kaydedilmeye çalışılırken bir hata oluştu. Verileriniz <b>kaydedilmedi</b>.

source: Done
ar: تمّ
ru: Готово
tr: Bitti

source: A command running in the R-engine wants you to see the following file(s):<ul><li>
ar: يرغب أمر يعمل في محرك R في أن تشاهد الملف(ات) التالية:<ul><li>
ru: Команда, отданная движку R, требует от вас просмотра следующих файлов:<ul><li>
tr: R işletkesinde çalışan bir komut aşağıdaki dosyaları görmenizi istiyor:<ul><li>

source: Showing file(s)
ar: يعرض الملف(ات)
ru: Показ файлов
tr: Dosyalar Gösteriliyor

source: A command running in the R-engine wants you to edit the following file(s). Please look at these files, edit them as appropriate, and save them. When done, press the "Done"-button, or close this dialog to resume.<ul><li>
ar: يرغب أمر يعمل في محرك R في أن تعدّل الملف(ات) التالية. الرجاء النظر في هذه الملفات، وعدّلها حسب الاقتضاء، واحفظها. عند الانتهاء، اضغط على زر "انتهى"، أو أغلق هذا الحوار للمتابعة.<ul><li>
ru: Команда, отданная движку R, требует от вас редактирования следующих файлов. Посмотрите на них, внесете необходимые изменения и выполните сохранение. По завершении нажмите кнопку «Готово» или закройте этот диалог для продолжения работы.<ul><li>
tr: R işletkesinde çalışan bir komut, aşağıdaki dosya(lar)ı düzenlemenizi istiyor. Lütfen bu dosyalara bakın, uygun şekilde düzenleyin ve kaydedin. İşiniz bittiğinde “Bitti” düğmesine basın veya sürdürmek için bu iletişim kutusunu kapatın.<ul><li>

source: Edit file(s)
ar: عدّل الملف(ات)
ru: Редактировать файлы
tr: Dosyaları Düzenle

source: This section contains data in your "workspace". This is data that you created or imported, in contrast to data contained in a loaded R package. Technically, this corresponds to the <i>.GlobalEnv</i> environment.
ar: يحتوي هذا القسم على بيانات في "مساحة عملك". هذه هي البيانات التي أنشأتها أو استوردتها، على عكس البيانات الموجودة في حزمة R محملة. تقنيًا، يتوافق هذا مع بيئة <i>.GlobalEnv</i>.
ru: В этом разделе содержатся данные из «рабочей области». Это те данные, которые были созданы или импортированы пользователем, в отличие от данных, содержащихся в загруженном пакете R. С технической точки зрения это окружение <i>.GlobalEnv</i>.
tr: Bu bölüm, “çalışma alanınızdaki” veriyi içerir. Bu, yüklü bir R paketinde bulunan verilerin aksine, oluşturduğunuz veya içe aktardığınız verilerdir. Teknik olarak bu, <i>.GlobalEnv</i> ortamına karşılık gelir.

source: Your workspace contains more than 10.000 top level objects. RKWard is not optimized for this situation, and you may experience lag between R commands. Should this situation constitute a regular use case for your work, please let us know at rkward@kde.org, so we can consider possible solutions.
ar: تحتوي مساحة عملك على أكثر من 10.000 كائن من المستوى الأعلى. لم يجري تحسين RKWard لهذا الموقف، وقد تواجه تأخيرًا بين أوامر R. إذا شكل هذا الموقف حالة استخدام منتظمة لعملك، فالرجاء إخبارنا على rkward@kde.org، حتى يتسنى التفكير في الحلول الممكنة.

source: Many objects in workspace
ar: العديد من الكائنات في مساحة العمل
ru: Много объектов в рабочей области
tr: Çalışma Alanında Çok Fazla Nesne

source: The object '%1' was removed from workspace or changed to a different type of object, but is currently opened for editing. Do you want to restore it?
ar: أزيل الكائن '%1' من مساحة العمل أو تغير إلى نوع مختلف من الكائنات، ولكنه مفتوح حاليًا للتعديل. هل تريد استعادته؟
ru: Объект «%1» был удалён из рабочей области или сделан объектом другого типа, но сейчас открыт для редактирования. Восстановить его?
tr: “%1” nesnesi çalışma alanından kaldırıldı veya farklı türde bir nesneyle değiştirildi; ancak şu anda düzenleme için açık. Geri yüklemek istiyor musunuz?

source: Restore object?
ar: هل تستعيد الكائن؟
ru: Восстановить объект?
tr: Nesneyi Geri Yükle?

source: Do you really want to remove the object '%1'? The object is currently opened for editing, it will be removed in the editor, too. There's no way to get it back.
ar: هل تريد حقًا إزالة الكائن '%1'؟ الكائن مفتوح حاليًا للتعديل، وسيجري إزالته في المحرر أيضًا. لا توجد طريقة لإعادته.
ru: Удалить объект «%1»? В настоящее время этот объект открыт для редактирования, он будет удалён также и из редактора. Восстановить его будет нельзя.
tr: “%1” nesnesini kaldırmayı gerçekten istiyor musunuz? Nesne şu anda düzenlemeye açık, düzenleyiciden de kaldırılacak. Onu geri almanın hiçbir yolu olmayacak.

source: Remove object?
ar: هل أزيل كائن؟
ru: Удалить объект?
tr: Nesneyi Kaldır?

source: Do you really want to remove the object '%1'? There's no way to get it back.
ar: هل تريد حقًا إزالة الكائن '%1'؟ لا توجد طريقة لإعادته.
ru: Удалить объект «%1»? Восстановить его будет нельзя.
tr: “%1” nesnesini kaldırmayı gerçekten istiyor musunuz? Onu geri almanın hiçbir yolu olmayacak.

source: Name
ar: الاسم
ru: Имя
tr: Ad

source: Label
ar: اللصيقة
ru: Подпись
tr: Etiket

source: Type
ar: النوع
ru: Тип
tr: Tür

source: Class
ar: الفئة
ru: Класс
tr: Sınıf

# Note: 'namespace' is a technical term, should not be translated
source: Orphan Namespaces
ar: مساحات أسماء يتيمة
ru: Неиспользуемые пространства имён
tr: Kimsesiz Ad Alanları

source: This special object does not actually exist anywhere in R. It is used, here, to list namespaces which are loaded, but not attached to a package on the search path. These are typically 'imported' namespaces.
ar: هذا الكائن الخاص غير موجود فعليًا في أي مكان في R. يجري استخدامه، هنا، لسرد مساحات الأسماء المحملة، ولكنها غير مرفقة بحزمة على مسار البحث. عادة ما تكون هذه مساحات أسماء 'مستوردة'.
ru: Этот специальный объект фактически не существует где-либо в R. Здесь он используется для перечисления пространств имён, которые загружены, но не связаны с пакетом по пути поиска. Обычно это «импортированные» пространства имён.
tr: Bu özel nesne aslında R’de hiçbir yerde yoktur. Burada, arama yolundaki bir pakete yüklenen ancak eklenmeyen ad alanlarını listelemek için kullanılır. Bunlar genellikle “içe aktarılan” ad alanlarıdır.

source: new.row
ar: صف.جديد
tr: yeni.satır

source: Full location:
ar: الموقع الكامل:
ru: Адрес полностью:
tr: Tam konum:

source: Label:
ar: اللصيقة:
ru: Подпись:
tr: Etiket:

source: Type:
ar: النوع:
ru: Тип:
tr: Tür:

source: Function
ar: الدالة
ru: Функция
tr: İşlev

source: Usage:
ar: الاستخدام:
ru: Использование:
tr: Kullanım:

source: Data frame
ar: إطار البيانات
ru: Датафрейм
tr: Veri çerçevesi

source: Array
ar: صفيف
ru: Массив
tr: Diziliş

source: Matrix
ar: مصفوفة
ru: Матрица
tr: Matris

source: List
ar: قائمة
ru: Список
tr: Liste

# Noun; in brackets, data type of the var is stated
source: Variable (%1)
ar: متغير (%1)
ru: Переменная (%1)
tr: Değişken (%1)

source: Environment
ar: البيئة
ru: Окружение
tr: Ortam

source: Length:
ar: الطول:
ru: Длина:
tr: Uzunluk:

source: Dimensions:
ar: الأبعاد:
ru: Размеры:
tr: Boyutlar:

source: Class(es):
ar: الفئة (الفئات):
ru: Классы:
tr: Sınıf(lar):

source: The package '%1' (probably you just loaded it) is currently blacklisted for retrieving structure information. Practically this means, the objects in this package will not appear in the object browser, and there will be no object name completion or function argument hinting for objects in this package. Packages will typically be blacklisted, if they contain huge amount of data, that would take too long to load. To unlist the package, visit Settings->Configure RKWard->Workspace.
ar: حزمة '%1' (لعلّك حمّلتها للتو) مدرجة حاليًا في القائمة السوداء لاسترداد معلومات الهيكل. عمليًا هذا يعني أن الكائنات الموجودة في هذه الحزمة لن تظهر في متصفح الكائنات، ولن يكون هناك إكمال لاسم الكائن أو تلميح لوسيط الدالة للكائنات الموجودة في هذه الحزمة. تدرج الحزم عادةً في القائمة السوداء، إذا كانت تحتوي على كمية كبيرة من البيانات، تستغرق وقتًا طويلاً جدًا للتحميل. لإزالة الحزمة من القائمة، اذهب إلى الإعدادات->اضبط أر كي وارد->مساحة العمل.
ru: Пакет «%1» (вероятно, он только что был загружен) в настоящее время находится в списке пакетов, для которых запрещено получение информации о структуре. На практике это означает, что объекты из этого пакета не будут показаны при обзоре объектов; соответственно, для них не выполняется автодополнение имён и показ подсказок по аргументам функций. Пакеты обычно попадают в такой список, когда содержат огромный объём данных, на загрузку которых потребовалось бы слишком много времени. Чтобы удалить пакет из списка: «Настройка -> Настроить RKWard -> Рабочая область».
tr: “%1” paketi (büyük olasılıkla yeni yüklediniz) şu anda yapı bilgilerini alma konusunda kara listede. Pratik olarak bu, bu paketteki nesnelerin nesne tarayıcısında görünmeyeceği ve bu paketteki nesneler için hiçbir nesne adı tamamlama veya işlev argümanı ipucu olmayacağı anlamına gelir. Paketler büyük miktarda veri içeriyorsa ve yüklenmesi çok uzun sürecekse genellikle kara listeye alınır. Paketi listeden çıkarmak için Ayarlar → RKWard Uygulamasını Yapılandır → Çalışma Alanı’nı ziyaret edin.

source: Package blacklisted
ar: الحزمة مدرجة في القائمة السوداء
ru: Пакет в списке запрещённых
tr: Paket Kara Listede

source: This section contains environments that are not part of <i>.GlobalEnv</i> / your "workspace". Most importantly, this includes loaded packages, but also objects added to R's <i>search()<i>-path using <i>attach()</i>.
ar: يحتوي هذا القسم على بيئات ليست جزءًا من <i>.GlobalEnv</i> / "مساحة عملك". الأهم من ذلك، يشمل هذا الحزم المحملة، وأيضًا الكائنات المضافة إلى مسار <i>search()</i> الخاص بـ R باستخدام <i>attach()</i>.
ru: В этом разделе содержатся среды, которые не являются частью <i>.GlobalEnv</i> или вашей «рабочей области». Самым важным является то, что здесь содержатся загруженные пакеты, а также объекты, добавленные к пути <i>search()<i> R с помощью <i>attach()</i>.
tr: Bu bölüm, <i>.GlobalEnv</i>’nin/“çalışma alanınızın” parçası olmayan ortamları içerir. En önemlisi bu, yüklenen paketleri ve aynı zamanda <i>attach()</i> kullanılarak R’nin <i>search()<i> yoluna eklenen nesneleri de içerir.

source: Did not unload package %1. It is required in RKWard. If you really want to do this, do so on the R Console.
ar: لم يلغِ تحميل حزمة %1. إنها مطلوبة في أر كي وارد. إذا كنت تريد القيام بذلك حقًا، فافعل ذلك على وحدة تحكم R.
ru: Выгрузка пакета %1 не выполнена. Он требуется для работы RKWard. Если выгрузка действительно необходима, выполните её в консоли R.
tr: %1 paketi çıkarılamadı; bu, RKWard’da gereklidir. Bunu gerçekten yapmak istiyorsanız bunu R konsolunda yapın.

source: Package %1 appears not to have been loaded
ar: يبدو أن حزمة %1 لم يجرِ تحميلها
ru: Похоже, пакет %1 не загружен
tr: %1 paketi yüklenmemiş gibi görünüyor

source: The name you specified was already in use or not valid. Renamed to %1
ar: الاسم الذي حددته مستخدم بالفعل أو غير صالح. غيّر الاسم إلى %1
ru: Указанное имя уже используется или некорректно. Выполнено переименование: %1
tr: Belirttiğiniz ad halihazırda kullanılıyordu veya geçerli değildi. %1 olarak yeniden adlandırıldı

source: Invalid Name
ar: الاسم غير صالح
ru: Некорректное имя
tr: Geçersiz Ad

source: &Edit
ar: &حرّر
ru: &Правка
tr: Dü&zen

source: Duplicate column name '%1'
ar: اسم العمود '%1' مكرر
ru: Дублирование названия столбца «%1»
tr: “%1” sütun adını çoğalt

source: Type on these fields to add new columns
ar: اكتب في هذه الحقول لإضافة أعمدة جديدة
ru: Заполняйте эти поля для добавления новых столбцов
tr: Yeni sütunlar eklemek için bu alanlara yazın

source: Type on these fields to add new rows
ar: اكتب في هذه الحقول لإضافة صفوف جديدة
ru: Заполняйте эти поля для добавления новых строк
tr: Yeni satırlar eklemek için bu alanlara yazın

source: This value is not allowed, here
ar: هذه القيمة غير مسموحة هنا
ru: Здесь это значение недопустимо
tr: Bu değere burada izin verilmiyor

source: #New Variable#
ar: #متغير جديد#
ru: #Новая переменная#
tr: #Yeni Değişken#

source: Row names
ar: أسماء الصفوف
ru: Названия строк
tr: Satır adları

source: This column contains one or more invalid fields
ar: يحتوي هذا العمود على حقل واحد أو أكثر غير صالح
ru: Этот столбец содержит одно или несколько некорректных полей
tr: Bu sütun, bir veya daha fazla geçersiz alan içeriyor

source: Format
ar: التنسيق
ru: Формат
tr: Biçim

source: Levels
ar: المستويات
ru: Уровни
tr: Düzeyler

source: Edit these fields to rename variables.
ar: عدّل هذه الحقول لإعادة تسمية المتغيرات.
ru: Отредактируйте эти поля, чтобы переименовать переменные.
tr: Değişkenleri yeniden adlandırmak için bu alanları düzenleyin.

source: A descriptive label for each column (optional).
ar: لصيقة وصفية لكل عمود (اختياري).
ru: Описательная подпись для каждого столбца (необязательно).
tr: Her bir sütun için açıklayıcı etiket (isteğe bağlı).

source: Type of data.
ar: نوع البيانات.
ru: Тип данных.
tr: Verinin türü.

source: Double click on these fields to customize data display.
ar: انقر نقرًا مزدوجًا على هذه الحقول لتخصيص عرض البيانات.
ru: Двойной щелчок по этим полям позволит настроить отображение данных.
tr: Veri görüntülemesini özelleştirmek için bu alanlara çift tıklayın.

source: Double click on these fields to edit factor levels.
ar: انقر نقرًا مزدوجًا على هذه الحقول لتعديل مستويات العامل.
ru: Двойной щелчок по этим полям позволит изменить уровни факторов.
tr: Etken düzeylerini düzenlemek için bu alanlara çift tıklayın.

source: Object '%1' is not a vector
ar: الكائن '%1' ليس متجهًا
ru: Объект «%1» не является вектором
tr: “%1” nesnesi bir vektör değil

source: Cuts the selected section and puts it to the clipboard
ar: يقُصُ المقطع المُنتقَى ويضعه في حافظة القُصاصات
ru: Вырезает выделенный раздел и помещает его в буфер обмена
tr: Seçili bölümü keser ve panoya yerleştirir

source: Copies the selected section to the clipboard
ar: ينسخ المقطع المُنتقى إلى حافظة القُصاصات
ru: Копирует выделенный раздел в буфер обмена
tr: Seçili bölümü panoya kopyalar

source: Pastes the clipboard contents to current position
ar: لصق محتويات الحافظة في الموضع الحالي
ru: Вставляет содержимое буфера обмена в текущую позицию курсора
tr: Pano içeriğini geçerli konuma yapıştırır

source: Paste inside table
ar: الصق داخل الجدول
ru: Вставить внутри таблицы
tr: Tablo İçine Yapıştır

source: Pastes the clipboard contents to current position, but not beyond the table's boundaries
ar: يلصق محتويات الحافظة في الموضع الحالي، ولكن ليس خارج حدود الجدول
ru: Вставляет содержимое буфера обмена в текущую позицию курсора, но в пределах таблицы
tr: Pano içeriğini geçerli konuma yapıştırır; ancak tablonun sınırlarının dışına taşmaz

source: Paste inside selection
ar: الصق داخل التحديد
ru: Вставить внутри выделения
tr: Seçim İçine Yapıştır

source: Pastes the clipboard contents to current position, but not beyond the boundaries of the current selection
ar: يلصق محتويات الحافظة في الموضع الحالي، ولكن ليس خارج حدود التحديد الحالي
ru: Вставляет содержимое буфера обмена в текущую позицию курсора, но в пределах текущего выделения
tr: Pano içeriğini geçerli konuma yapıştırır; ancak seçimin sınırlarının dışına taşmaz

source: Show / Edit row names
ar: أظهر / عدّل أسماء الصفوف
ru: Показать / изменить названия строк
tr: Satır Adlarını Göster/Düzenle

source: Enable editing
ar: فعل التعديل
ru: Включить редактирование
tr: Düzenlemeyi Etkinleştir

# verb: switch to read-only state. Make this short.
source: Lock
ar: اقفل
ru: Забл.
tr: Kilitle

source: Disable editing (to prevent accidental modification of data)
ar: عطّل التعديل (لمنع التعديل العرضي للبيانات)
ru: Отключить редактирование (для предотвращения случайного изменения данных)
tr: Düzenlemeyi devre dışı bırakın (verilerin yanlışlıkla değiştirilmesini önlemek için)

# verb: switch to read-write state. Make this short.
source: Unlock
ar: فكّ القفل
ru: Разбл.
tr: Kilidi Aç

source: The object's internal structure does not conform to a regular <tt>data.frame</tt>. Editing this table may not be safe, and has been disabled. Some columns may not be shown.
ar: لا يتوافق الهيكل الداخلي للكائن مع <tt>data.frame</tt> عادي. قد لا يكون تعديل هذا الجدول آمنًا، وعلّه جرى تعطيله. قد لا تظهر بعض الأعمدة.
ru: Внутренняя структура объекта не соответствует обычному <tt>data.frame</tt>. Редактирование этой таблицы может быть небезопасным, поэтому оно отключено. Некоторые столбцы могут быть не показаны.
tr: Nesnenin iç yapısı bir düzenli <tt>data.frame</tt> yapısına uymuyor. Bu tabloyu düzenlemek güvenli olmayabilir ve devre dışı bırakılmıştır. Bazı sütunlar gösterilmeyebilir.

source: Show details
ar: أظهر التّفاصيل
ru: Показать подробности
tr: Ayrıntıları göster

source: You may want to create an editable subset using Data->Subset data.frame.
ar: قد ترغب في إنشاء مجموعة فرعية قابلة للتعديل باستخدام بيانات->مجموعة فرعية data.frame.
ru: Можно создать доступное для редактирования подмножество («Данные -> Подмножество data.frame»).
tr: “Veri → data.frame’i alt kümele” kullanarak bir düzenlenebilir alt küme oluşturmak isteyebilirsiniz.

source: Problem detected
ar: كشف عن مشكلة
ru: Обнаружена проблема
tr: Sorun algılandı

source: %1 [read-only]
ar: %1 [للقراءة فقط]
ru: %1 [только чтение]
tr: %1 [saltokunur]

source: Insert new variable left
ar: أدخل متغيرًا جديدًا على اليسار
ru: Вставить новую переменную слева
tr: Sola yeni değişken ekle

source: Delete this variable
ar: احذف هذا المتغير
ru: Удалить эту переменную
tr: Bu değişkeni sil

source: Insert new case above (at %1)
ar: أدخل حالة جديدة أعلاه (في %1)
ru: Вставить новый вариант выше (в %1)
tr: Yukarıya yeni vaka ekle (%1 konumunda)

source: Delete marked rows (%1-%2)
ar: احذف الصفوف المحددة (%1-%2)
ru: Удалить отмеченные строки (%1-%2)
tr: İmlenen satırları (%1–%2) sil

source: Delete this row (%1)
ar: احذف هذا الصف (%1)
ru: Удалить эту строку (%1)
tr: Bu hücreyi (%1) sil

source: Inserting clipboard contents...
ar: جاري إدراج محتويات الحافظة...
ru: Вставка содержимого буфера обмена…
tr: Pano içeriği ekleniyor…

source: Reporting bugs in RKWard
ar: أبلغ عن الأخطاء في أر كي وارد
ru: Отчёты об ошибках в RKWard
tr: RKWard’da Hata Raporlama
