Repository: KDE/rkward
Catalog: po/*/rkward__item_response_theory.po
Languages: ar, eo

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: olivermkellogg@gmail.com

source: 2PL parameter estimation
ar: تقدير المعلمات 2PL
eo: 2PL parametrotakso

source: Call:
ar: النداء:
eo: Voku:

source: Coefficients:
ar: المعاملات:
eo: Koeficientoj:

source: Log-likelihood value at convergence:
ar: قيمة لوغاريتم الاحتمالية عند التقارب:
eo: Logverŝajna valoro ĉe konverĝo:

# R code comment
source: keep results in current workspace
ar: احفظ بالنتائج في مساحة العمل الحالية
eo: konservi rezultojn en nuna laborspaco

source: This plugin estimates parameters under Item Response Theory approach, using the <link href="rkward://rhelp/ltm-package">ltm</link> package.
ar: يُقدّر هذا الملحق المعلمات وفقًا لمنهجية نظرية استجابة الفقرة، باستخدام حزمة <link href="rkward://rhelp/ltm-package">ltm</link>.
eo: Ĉi tiu kromaĵo taksas parametrojn laŭ Item-Responda Teorio, uzante la pakon <link href="rkward://rhelp/ltm-package">ltm</link>.

source: The complete results can be stored as a new object in the current workspace for further use (e.g. plotting item characteristic curves).
ar: اِحفظ النتائج الكاملة ككائن جديد في مساحة العمل الحالية لغرض الاستخدام اللاحق (مثل رسم منحنيات خاصية الفقرة).
eo: La kompletaj rezultoj povas esti konservitaj kiel nova objekto en la nuna laborspaco por plua uzo (ekz. grafikado de objekt-karakterizaj kurboj).

source: To fit the two parameter logistic model with default settings, just the matrix of manifest variables (dichotomous item responses) must be selected. Further options are described in the sections below.
ar: لتلائم نموذج لوجستي بمعلمتين باستخدام الإعدادات المبدئية، اِختر فقط مصفوفة المتغيرات الواضحة (استجابات الفقرات الثنائية). وَصَف الخيارات الإضافية في الأقسام أدناه.
eo: Por konveni la du parametran loĝistikan modelon kun defaŭltaj agordoj, nur la matrico de manifestaj variabloj (dikotomaj objektorespondoj) devas esti elektita. Pliaj elektoj estas priskribitaj en la sekcioj sube.

source: Matrix of manifest variables
ar: مصفوفة المتغيرات الواضحة
eo: Matrico de manifestaj variabloj

source: Select the matrix of dichotomous item responses from the objects shown on the left.
ar: اِختر مصفوفة استجابات الفقرات الثنائية من الكائنات المعروضة على اليسار.
eo: Elektu la matricon de dikotomaj objektorespondoj el la objektoj montritaj maldekstre.

source: If you want to fix parameters, you have to prepare a matrix of fixed-value constraints first and then select it here. For detailed information on the specific layout of that matrix please refer to the manual for the <link href="rkward://rhelp/ltm">ltm()</link> function.
ar: إذا أردت تثبيت المعلمات، اِجهِز أولاً مصفوفة قيود القيمة الثابتة ثم اِخترها هنا. للحصول على معلومات مفصّلة حول التنسيق المحدد لتلك المصفوفة، اِرجِع إلى دليل وظيفة <link href="rkward://rhelp/ltm">ltm()</link>.
eo: Se vi volas ripari parametrojn, vi unue devas prepari matricon de fiksvaloraj limoj kaj poste elekti ĝin ĉi tie. Por detalaj informoj pri la specifa aranĝo de tiu matrico bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/ltm">ltm()</link>.

source: By default start values for the parameters are computed automatically. Alternatively, you can force the use of random start values, or give a matrix of values to be used. For detailed information on the specific layout of that matrix please refer to the manual for the <link href="rkward://rhelp/ltm">ltm()</link> function.
ar: مبدئيًا، تُحسب قيم البدء للمعلمات آليًا. بدلاً من ذلك، أَجبِر على استخدام قيم بدء عشوائية، أو أَعطِ مصفوفة قيم لِتُستخدم. للحصول على معلومات مفصّلة حول التنسيق المحدد لتلك المصفوفة، اِرجِع إلى دليل وظيفة <link href="rkward://rhelp/ltm">ltm()</link>.
eo: Defaŭlte startvaloroj por la parametroj estas kalkulitaj aŭtomate. Alternative, vi povas devigi la uzon de hazardaj komencaj valoroj, aŭ doni matricon de valoroj por esti uzataj. Por detalaj informoj pri la specifa aranĝo de tiu matrico bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/ltm">ltm()</link>.

source: Specifies how missing values are to be treated. By default all available cases are used. If checked, only complete cases will be considered.
ar: تحدد كيفية معالجة القيم المفقودة. مبدئيًا، تُستخدم جميع الحالات المتاحة. إذا وضعت علامة، تُعتبر فقط الحالات الكاملة.
eo: Specifas kiel mankantaj valoroj estas traktotaj. Defaŭlte ĉiuj disponeblaj kazoj estas uzataj. Se markite, nur kompletaj kazoj estos konsiderataj.

source: If checked, the coefficients' estimates are reported under the usual Item Response Theory parameterization (which is the default).
ar: إذا وُضعت علامة، تُبلَّغ تقديرات المعاملات وفقًا للتخصيص المعتاد لمعلمات نظرية استجابة الفقرة (وهو المبدئي).
eo: Se markite, la taksoj de la koeficientoj estas raportitaj sub la kutima Item Response Theory-parametrizado (kiu estas la defaŭlta).

source: Number of EM iterations
ar: عدد تكرارات EM
eo: Nombro de EM-ripetoj

source: Defaults to 40.
ar: المبدئيات إلى 40.
eo: Defaŭlte al 40.

source: Number of quasi-Newton iterations
ar: عدد تكرارات شبه نيوتن
eo: Nombro de kvazaŭ-Neŭtonaj ripetoj

source: Defaults to 150.
ar: المبدئيات إلى 150.
eo: Defaŭlte al 150.

source: Number of Gauss-Hermite quadrature points
ar: عدد نقاط تربيع غاوس-هيرميت
eo: Nombro de Gauss-Hermite kvadrataj punktoj

source: Defaults to 15.
ar: المبدئيات إلى 15.
eo: Defaŭlte al 15.

source: Optimization method
ar: طريقة التحسين
eo: Optimumiga metodo

source: The default optimization method is BFGS. It can be set to Nelder-Mead, CG, L-BFGS-B, or SANN instead. Please refer to the <link href="rkward://rhelp/optim">optim()</link> manual for details.
ar: طريقة التحسين المبدئية هي BFGS. اِضبِطها لتكون Nelder-Mead أو CG أو L-BFGS-B أو SANN بدلاً من ذلك. اِرجِع إلى دليل <link href="rkward://rhelp/optim">optim()</link> للحصول على التفاصيل.
eo: La defaŭlta optimumiga metodo estas BFGS. Ĝi povas esti agordita al Nelder-Mead, CG, L-BFGS-B, aŭ SANN anstataŭe. Bonvolu konsulti la manlibron <link href="rkward://rhelp/optim">optim()</link> por detaloj.

source: Pretty much speaks for itself ;-)
ar: العبارة واضحة جدًا 😉
eo: Preskaŭ parolas por si mem ;-)

source: Please refer to the <code>ltm</code> manuals for further information and detailed command line options:
ar: اِرجِع إلى أدلة <code>ltm</code> للحصول على مزيد من المعلومات وخيارات سطر الأوامر التفصيلية:
eo: Bonvolu konsulti la manlibrojn de <code>ltm</code> por pliaj informoj kaj detalaj komandliniaj elektebloj:

source: The two factor solution of the <code>ltm()</code> function is not yet fully implemented (quadratic term is missing).
ar: لم يُطبَّق حل العاملين لوظيفة <code>ltm()</code> بالكامل بعد (المصطلح التربيعي مفقود).
eo: La dufaktora solvo de la funkcio <code>ltm()</code> ankoraŭ ne estas plene efektivigita (kvadratika termino mankas).

source: IRT parameter estimation: Two parameter logistic model
ar: تقدير معلمات نظرية استجابة الفقرة: نموذج لوجستي بمعلمتين
eo: IRT-parametrotakso: Du-parametra loĝistika modelo

source: Manifest variables
ar: المتغيرات الواضحة
eo: Manifestaj variabloj

source: Matrix of manifest variables:
ar: مصفوفة المتغيرات الواضحة:
eo: Matrico de manifestaj variabloj:

source: Save results in workspace
ar: احفظ النتائج في مساحة العمل
eo: Konservu rezultojn en laborspaco

source: Options
ar: خيارات
eo: Elektebloj

source: Should parameters be fixed (constraints)?
ar: هل يجب تثبيت المعلمات (قيود)؟
eo: Ĉu parametroj estu fiksitaj (limoj)?

source: Constraint matrix:
ar: مصفوفة القيود:
eo: Lima matrico:

source: Start values
ar: قيم البداية
eo: Komencaj valoroj

source: Compute automatically
ar: احسب آليا
eo: Komputilu aŭtomate

source: Use random start values
ar: اِستخدِم قيم بدء عشوائية
eo: Uzu hazardajn komencajn valorojn

source: Use own matrix of start values
ar: اِستخدِم مصفوفة قيم بدء خاصة
eo: Uzu propran matricon de komencaj valoroj

source: Matrix of start values:
ar: مصفوفة قيم البداية:
eo: Matrico de komencaj valoroj:

source: Misc options
ar: خيارات متنوعة
eo: Misk opcioj

source: Use only complete cases
ar: استعمل الحالات المكتملة فقط
eo: Uzu nur kompletajn kazojn

source: Usual IRT parameterization
ar: التخصيص المعتاد لمعلمات نظرية استجابة الفقرة
eo: Kutima IRT-parametrigo

source: Assume two-factor model with interaction term
ar: اِفترِض نموذج عاملين مع مصطلح التفاعل
eo: Supozu dufaktoran modelon kun interaga termino

source: Advanced control
ar: تحكم متقدّم
eo: Altnivela mastrumo

source: Number of EM iterations:
ar: عدد تكرارات EM:
eo: Nombro da EM-ripetoj:

source: Number of quasi-Newton iterations:
ar: عدد تكرارات شبه نيوتن:
eo: Nombro da kvazaŭ-neŭtonaj ripetoj:

source: Number of Gauss-Hermite quadrature points:
ar: عدد نقاط تربيع غاوس-هيرميت:
eo: Nombro da Gauss-Hermite-kvadrataj punktoj:

source: Optimization method:
ar: طريقة التحسين:
eo: Optimumiga metodo:

source: Print verbose info about optimization
ar: طباعة معلومات تفصيلية حول التحسين
eo: Presi multvortajn informojn pri optimumigo

source: 3PL parameter estimation
ar: تقدير مَعْلَمَة 3PL
eo: 3PL parametrotakso

source: To fit the Birnbaum three parameter model with default settings, just the matrix of manifest variables (dichotomous item responses) must be selected. Further options are described in the sections below.
ar: لتلائم نموذج بيرنباوم ذو المَعْلَمَات الثلاثة بالإعدادات المبدئية، يجب اختيار مصفوفة المتغيرات الظاهرة (استجابات البند ثنائية التفرع) فقط. تُوصَف الخيارات الأخرى في الأقسام أدناه.
eo: Por konveni la modelon de tri parametroj de Birnbaum kun defaŭltaj agordoj, nur la matrico de manifestaj variabloj (dikotomaj objektorespondoj) devas esti elektita. Pliaj elektoj estas priskribitaj en la sekcioj sube.

source: If you want to fix parameters, you have to prepare a matrix of fixed-value constraints first and then select it here. For detailed information on the specific layout of that matrix please refer to the manual for the <link href="rkward://rhelp/tpm">tpm()</link> function.
ar: إذا أردت تثبيت المَعْلَمَات، عليك إعداد مصفوفة من قيود القيمة الثابتة أولاً ثم اخترها هنا. للحصول على معلومات مفصلة حول التخطيط المعين لتلك المصفوفة، ارجع إلى دليل دالة <link href="rkward://rhelp/tpm">tpm()</link>.
eo: Se vi volas ripari parametrojn, vi unue devas prepari matricon de fiksvaloraj limoj kaj poste elekti ĝin ĉi tie. Por detalaj informoj pri la specifa aranĝo de tiu matrico bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/tpm">tpm()</link>.

source: Limits the estimated guessing parameter (accepts values between 0 and 1).
ar: يحدّ من مَعْلَمَة التخمين المُقدَّرة (تقبل قيماً بين 0 و 1).
eo: Limigas la taksitan divenan parametron (akceptas valorojn inter 0 kaj 1).

source: By default start values for the parameters are computed automatically. Alternatively, you can force the use of random start values, or give a matrix of values to be used. For detailed information on the specific layout of that matrix please refer to the manual for the <link href="rkward://rhelp/tpm">tpm()</link> function.
ar: آليًا تُحسب قيم البدء للمَعْلَمَات بطريقة آليَّة. وبدلاً من ذلك، يمكنك فرض استخدام قيم بدء عشوائية، أو اعطِ مصفوفة من القيم لـ تُستخدَم. للحصول على معلومات مفصلة حول التخطيط المعين لتلك المصفوفة، ارجع إلى دليل دالة <link href="rkward://rhelp/tpm">tpm()</link>.
eo: Defaŭlte startvaloroj por la parametroj estas kalkulitaj aŭtomate. Alternative, vi povas devigi la uzon de hazardaj komencaj valoroj, aŭ doni matricon de valoroj por esti uzataj. Por detalaj informoj pri la specifa aranĝo de tiu matrico bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/tpm">tpm()</link>.

source: If checked it is assumed that discrimination parameters are equal for all items, as in the 1PL Rasch model. That leaves difficulty and guessing parameters to be estimated.
ar: إذا وُضِعت علامة، يُفترض أن مَعْلَمَات التمييز مُتساوية لجميع البنود، كما هو الحال في نموذج 1PL Rasch. هذا يترك مَعْلَمَات الصعوبة والتخمين لتقديرها.
eo: Se markite estas supozite ke diskriminaciaj parametroj estas egalaj por ĉiuj eroj, kiel en la 1PL Rasch-modelo. Tio lasas malfacilecon kaj divenajn parametrojn por esti taksitaj.

source: Defaults to 1000.
ar: المبدئيات إلى 1000.
eo: Defaŭlte al 1000.

source: Defaults to 21.
ar: المبدئيات إلى 21.
eo: Defaŭlte al 21.

source: Used optimizer
ar: المُحسِّن المستخدَم
eo: Uzita optimumilo

source: By default <link href="rkward://rhelp/optim">optim()</link> is being used for optimization. Alternatively, <link href="rkward://rhelp/nlminb">nlminb()</link> can be called.
ar: مبدئيًا تُستخدَم <link href="rkward://rhelp/optim">optim()</link> للتحسين. بدلاً من ذلك، يمكن استدعاء <link href="rkward://rhelp/nlminb">nlminb()</link>.
eo: Defaŭlte <link href="rkward://rhelp/optim">optim()</link> estas uzata por optimumigo. Alternative, <link href="rkward://rhelp/nlminb">nlminb()</link> povas esti vokita.

source: <i>Only if <code>optim()</code> is used:</i> The default optimization method is BFGS. It can be set to Nelder-Mead, CG, L-BFGS-B, or SANN instead. Please refer to the <link href="rkward://rhelp/optim">optim()</link> manual for details.
ar: <i>فقط إذا استُخدِمت <code>optim()</code>:</i> طريقة التحسين المبدئية هي BFGS. يمكن ضبطها إلى Nelder-Mead، أو CG، أو L-BFGS-B، أو SANN بدلاً من ذلك. ارجع إلى دليل <link href="rkward://rhelp/optim">optim()</link> للحصول على التفاصيل.
eo: <i>Nur se <code>optim()</code> estas uzata:</i> La defaŭlta optimumiga metodo estas BFGS. Ĝi povas esti agordita al Nelder-Mead, CG, L-BFGS-B, aŭ SANN anstataŭe. Bonvolu konsulti la manlibron <link href="rkward://rhelp/optim">optim()</link> por detaloj.

source: Used in the central difference approximation that approximates the hessian. Defaults to 1e-03.
ar: تُستخدَم في تقريب الفروق المركزية الذي يُقرِّب مصفوفة هيسيان. المبدئي 1e-03.
eo: Uzite en la centra diferencproksimumado kiu proksimumas la hesian. Defaŭlte al 1e-03.

source: Todo:
ar: مهمّة:
eo: Fari:

source: The <code>parscale</code> control element is not yet implemented.
ar: لم تُنفَّذ عنصر التحكم <code>parscale</code> بعد.
eo: La regelemento <code>parscale</code> ankoraŭ ne estas efektivigita.

source: IRT parameter estimation: Birnbaum three parameter model
ar: تقدير مَعْلَمَة نظرية الاستجابة للبنود: نموذج بيرنباوم ذو المَعْلَمَات الثلاثة
eo: IRT parametrotakso: Birnbaum tri parametromodelo

source: Upper bound for guessing parameter
ar: الحد الأعلى لمَعْلَمَة التخمين
eo: Supra limo por diveni parametron

source: Assume equal discrimination parameters
ar: افترض مَعْلَمَات تمييز مُتساوية
eo: Supozu egalajn diskriminaciajn parametrojn

source: Used optimizer:
ar: المُحسِّن المستخدَم:
eo: Uzita optimumilo:

source: Step-length for approximation
ar: طول الخطوة للتقريب
eo: Paŝo-longo por proksimuma

source: LLTM parameter estimation
ar: تقدير مَعْلَمَة LLTM
eo: LLTM parametrotakso

source: Conditional log-likelihood:
ar: احتمالية السجل الشرطي:
eo: Kondiĉa logverŝajneco:

source: <br />Number of iterations:
ar: <br />عدد التكرارات:
eo: <br />Nombro da ripetoj:

source: <br />Number of parameters:
ar: <br />عدد المَعْلَمَات:
eo: <br />Nombro da parametroj:

source: This plugin estimates parameters under Item Response Theory approach, using the <link href="rkward://rhelp/eRm-package">eRm</link> package.
ar: هذا المُلْحَق يقدِّر المَعْلَمَات تحت نَهْج نظرية الاستجابة للبنود، باستخدام حزمة <link href="rkward://rhelp/eRm-package">eRm</link>.
eo: Ĉi tiu kromaĵo taksas parametrojn laŭ Item-Responda Teorio, uzante la pakon <link href="rkward://rhelp/eRm-package">eRm</link>.

source: To fit the linear logistic test model with default settings, just the matrix of manifest variables (dichotomous item responses) must be selected. Further options are described in the sections below. For detailed information on the expected layout of matrices and vectors please refer to the manual for the <link href="rkward://rhelp/LLTM">LLTM()</link> function.
ar: لتلائم نموذج اختبار لوجستي الخطي بالإعدادات المبدئية، يجب اختيار مصفوفة المتغيرات الظاهرة (استجابات البند ثنائية التفرع) فقط. تُوصَف الخيارات الأخرى في الأقسام أدناه. للحصول على معلومات مفصلة حول التخطيط المتوقع للمصفوفات والمتجهات، ارجع إلى دليل دالة <link href="rkward://rhelp/LLTM">LLTM()</link>.
eo: Por konveni la linearan loĝistikan testmodelon kun defaŭltaj agordoj, nur la matrico de manifestaj variabloj (dikotomaj objektorespondoj) devas esti elektita. Pliaj elektoj estas priskribitaj en la sekcioj sube. Por detalaj informoj pri la atendata aranĝo de matricoj kaj vektoroj bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/LLTM">LLTM()</link>.

source: If repeated measurement applies, specify how many are represented in the data matrix (defaults to 1). This will divide the columns in the matrix into equally sized subsets of data.
ar: إذا انطبق القياس المُتكرر، فحدِّد العدد المُمثَّل في مصفوفة البيانات (المبدئي 1). هذا سيقسم الأعمدة في المصفوفة إلى مجموعات فرعية مُتساوية الحجم من البيانات.
eo: Se ripetita mezurado validas, specifu kiom da estas reprezentitaj en la datummatrico (defaŭlte al 1). Ĉi tio dividos la kolumnojn en la matrico en samgrandajn subarojn de datumoj.

source: If you want to compute group contrasts, a vector determining the group membership of each subject must be given. By default no group contrasts are imposed.
ar: إذا أردت حساب تباينات المجموعة، يجب إعطاء مُتجه يحدِّد عضوية المجموعة لكل موضوع. آليًا لا تُفرَض تباينات المجموعة.
eo: Se vi volas kalkuli grupkontrastojn, vektoro determinanta la grupan membrecon de ĉiu subjekto devas esti donita. Defaŭlte neniuj grupkontrastoj estas truditaj.

source: By default the design matrix for the LLTM will be computed automatically. Alternatively, you may specify your own design matrix here.
ar: آليًا، تُحسب مصفوفة التصميم لـ LLTM بطريقة آليَّة. بدلاً من ذلك، يمكنك تحديد مصفوفة التصميم الخاصة بك هنا.
eo: Defaŭlte la dezajnomatrico por la LLTM estos komputita aŭtomate. Alternative, vi povas specifi vian propran desegnan matricon ĉi tie.

source: By default eta values start with the 0-vector. To change this, a vector of starting values can be specified.
ar: آليًا، تبدأ قيم إيتا بالمُتجه-0. لتغيير هذا، يمكن تحديد مُتجه من قيم البدء.
eo: Defaŭlte eta valoroj komenciĝas per la 0-vektoro. Por ŝanĝi ĉi tion, vektoro de komencaj valoroj povas esti specifita.

source: If checked, standard errors are computed (which is the default).
ar: إذا وُضِعت علامة، تُحسب الأخطاء المعيارية (وهو الإعداد المبدئي).
eo: Se markite, normaj eraroj estas komputitaj (kiu estas la defaŭlta).

source: By default parameters are normalized to sum-0 by specifying an appropriate design matrix. Uncheck this box to restrict the first parameter to 0.
ar: آليًا، تُطبَّق المساواة على المَعْلَمَات إلى مجموع-0 بتحديد مصفوفة تصميم مناسبة. أزِل العلامة من هذا المربع لتقييد المَعْلَمَة الأولى إلى 0.
eo: Defaŭlte parametroj estas normaligitaj al sum-0 precizigante taŭgan dezajnmatricon. Malmarku ĉi tiun skatolon por limigi la unuan parametron al 0.

source: Please refer to the <code>eRm</code> manuals for further information and detailed command line options:
ar: ارجع إلى أدلة <code>eRm</code> للحصول على مزيد من المعلومات وخيارات سطر الأوامر المفصلة:
eo: Bonvolu konsulti la manlibrojn de <code>eRm</code> por pliaj informoj kaj detalaj komandliniaj elektebloj:

source: IRT parameter estimation: Linear logistic test model
ar: تقدير مَعْلَمَة نظرية الاستجابة للبنود: نموذج اختبار لوجستي الخطي
eo: IRT-parametrotakso: Lineara loĝistika testmodelo

source: Number of measurement points
ar: عدد نقاط القياس
eo: Nombro de mezurpunktoj

source: Group contrasts
ar: تباينات المجموعة
eo: Grupaj kontrastoj

source: All subjects belong to one group
ar: جميع المواضيع تنتمي إلى مجموعة واحدة
eo: Ĉiuj temoj apartenas al unu grupo

source: Compute group contrasts
ar: احسب تباينات المجموعة
eo: Komputi grupkontrastojn

source: Use this group vector:
ar: استخدم مُتجه المجموعة هذا:
eo: Uzu ĉi tiun grupvektoron:

source: Design matrix
ar: مصفوفة التصميم
eo: Dezajna matrico

source: Use own design matrix
ar: استخدم مصفوفة تصميم خاصة
eo: Uzu propran desegnan matricon

source: Design matrix:
ar: مصفوفة التصميم:
eo: Dezajna matrico:

source: Eta start values
ar: قيم بدء إيتا
eo: Eta komencaj valoroj

source: Use 0-vector
ar: استخدم مُتجه-0
eo: Uzu 0-vektoron

source: Use own vector of eta start values
ar: استخدم مُتجه خاص من قيم بدء إيتا
eo: Uzu propran vektoron de eta startvaloroj

source: Vector of start values:
ar: مُتجه قيم البدء:
eo: Vektoro de komencaj valoroj:

source: Compute standard error
ar: احسب الخطأ المعياري
eo: Kalkuli norman eraron

source: Normalize parameters to sum-0
ar: طبِّق المساواة على المَعْلَمَات إلى مجموع-0
eo: Normaligu parametrojn al sum-0

source: Rasch parameter estimation
ar: تقدير مَعْلَمَة راش
eo: Rasch-parametrotakso

source: To fit the Rasch model with default settings, just the matrix of manifest variables (dichotomous item responses) must be selected. Further options are described in the sections below.
ar: لتلائم نموذج راش بالإعدادات المبدئية، يجب اختيار مصفوفة المتغيرات الظاهرة (استجابات البند ثنائية التفرع) فقط. تُوصَف الخيارات الأخرى في الأقسام أدناه.
eo: Por konveni la Rasch-modelon kun defaŭltaj agordoj, nur la matrico de manifestaj variabloj (dikotomaj objektorespondoj) devas esti elektita. Pliaj elektoj estas priskribitaj en la sekcioj sube.

source: If you want to fix parameters, you have to prepare a matrix of fixed-value constraints first and then select it here. For detailed information on the specific layout of that matrix please refer to the manual for the <link href="rkward://rhelp/rasch">rasch()</link> function.
ar: إذا أردت تثبيت المَعْلَمَات، عليك إعداد مصفوفة من قيود القيمة الثابتة أولاً ثم اخترها هنا. للحصول على معلومات مفصلة حول التخطيط المعين لتلك المصفوفة، ارجع إلى دليل دالة <link href="rkward://rhelp/rasch">rasch()</link>.
eo: Se vi volas ripari parametrojn, vi unue devas prepari matricon de fiksvaloraj limoj kaj poste elekti ĝin ĉi tie. Por detalaj informoj pri la specifa aranĝo de tiu matrico bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/rasch">rasch()</link>.

source: By default start values for the parameters are computed automatically. Alternatively, you can force the use of random start values, or give a matrix of values to be used. For detailed information on the specific layout of that matrix please refer to the manual for the <link href="rkward://rhelp/rasch">rasch()</link> function.
ar: آليًا تُحسب قيم البدء للمَعْلَمَات بطريقة آليَّة. وبدلاً من ذلك، يمكنك فرض استخدام قيم بدء عشوائية، أو اعطِ مصفوفة من القيم لـ تُستخدَم. للحصول على معلومات مفصلة حول التخطيط المعين لتلك المصفوفة، ارجع إلى دليل دالة <link href="rkward://rhelp/rasch">rasch()</link>.
eo: Defaŭlte startvaloroj por la parametroj estas kalkulitaj aŭtomate. Alternative, vi povas devigi la uzon de hazardaj komencaj valoroj, aŭ doni matricon de valoroj por esti uzataj. Por detalaj informoj pri la specifa aranĝo de tiu matrico bonvolu konsulti la manlibron por la funkcio <link href="rkward://rhelp/rasch">rasch()</link>.

source: IRT parameter estimation: Rasch model
ar: تقدير مَعْلَمَة نظرية الاستجابة للبنود: نموذج راش
eo: IRT-parametrotakso: Rasch-modelo

source: GPCM parameter estimation
ar: تقدير مَعْلَمَة GPCM
eo: GPCM-parametrotakso

source: To fit the generalized partial credit model with default settings, just the matrix of manifest variables (polytomous item responses) must be selected. Further options are described in the sections below.
ar: لتلائم نموذج الائتمان الجزئي المُعمَّم بالإعدادات المبدئية، يجب اختيار مصفوفة المتغيرات الظاهرة (استجابات البند مُتعددة التفرع) فقط. تُوصَف الخيارات الأخرى في الأقسام أدناه.
eo: Por konveni la ĝeneraligitan partan kreditmodelon kun defaŭltaj agordoj, nur la matrico de manifestaj variabloj (politomaj objektorespondoj) devas esti elektita. Pliaj elektoj estas priskribitaj en la sekcioj sube.
