Repository: KDE/rkward
Catalog: po/*/rkward__data.po
Languages: ar, eo, eu, ru, tr

source: Allows to apply conversions, which may affect sort order (when sorting data.frames, this option is available for each column to sort by).
ar: اسمح بتطبيق التحويلات، والتي قد تؤثر على ترتيب الفرز (عند فرز إطارات البيانات، يتوفر هذا الخيار لكل عمود يجب الفرز حسبه).
eo: Permesas apliki konvertiĝojn, kiuj povas influi ordigon (dum ordigo de data.frames, ĉi tiu opcio estas disponebla por ĉiu kolumno por ordigi).
eu: Bihurketa erabiltzen uzten du, sailkatzeko ordenari eragin diezaiokelarik («data.frame»ak sailkatzean, sailkatzeko erabilitako zutabe gakoitzerako aukera hau erabilgarri dago).
ru: Позволяет применять преобразования, которые могут повлиять на порядок сортировки (при сортировке data.frame эта опция доступна для каждого столбца, по которому будет выполняться сортировка).
tr: Sıralama düzenini etkileyebilecek dönüşümlerin uygulanmasına izin verir (data.frame’leri sıralarken bu seçenek, sıralama ölçütü olarak her sütun için kullanılabilir).

source: When sorting data.frames, this option allows to reverse the global sort order for individual columns.
ar: عند فرز إطارات البيانات، يسمح هذا الخيار بعكس ترتيب الفرز العام للأعمدة الفردية.
eo: Dum ordigo de data.frames, ĉi tiu opcio permesas inversigi la ĉiean ordigon por individuaj kolumnoj.
eu: «data.frame»ak sailkatzean, aukera honek, banakako zutabeetarako sailkatzeko ordena globala iraultzeko aukera ematen du.
ru: При сортировке data.frames этот параметр позволяет обратить глобальный порядок сортировки для отдельных столбцов.
tr: data.frame’leri sıralarken bu seçenek, tek tek sütunlar için genel sıralama düzeninin tersine çevrilmesine olanak tanır.

source: Sorting this type of object is not supported in this plugin
ar: فرز هذا النوع من الكائنات غير مدعوم في هذه الملحقة
eo: Ordigi ĉi tiun tipon de objekto ne estas subtenata en ĉi tiu kromaĵo
eu: Plugin honetan ez dago objektu mota hau sailkatzeko euskarririk
ru: В этом модуле не поддерживается сортировка объектов такого типа
tr: Bu eklentide bu tür nesnelerin sıralanması desteklenmiyor

source: Basic settings
ar: إعدادات أساسية
eo: Bazaj agordoj
eu: Oinarrizko ezarpenak
ru: Основные параметры
tr: Temel ayarlar

source: Object to be sorted
ar: الكائن للفرز
eo: Objekto ordigota
eu: Sailkatu beharreko objektua
ru: Объект для сортировки
tr: Sıralanacak nesne

source: Sort by
ar: افرز حسب
eo: Ordigi laŭ
eu: Sailkatu honen arabera
ru: Сортировка по
tr: Şuna göre sırala

source: Another object
ar: كائن آخر
eo: Alia objekto
eu: Beste objektu bat
ru: Другой объект
tr: Başka nesne

source: Sort order
ar: ترتيب الفرز
eo: Ordo de ordigo
eu: Sailkapen-ordena
ru: Порядок сортировки
tr: Sıralama ölçütü

source: Ascending
ar: تصاعديًّا
eo: Kreskante
eu: Goranzkoa
ru: По возрастанию
tr: Artan

source: Descending
ar: تنازليًّا
eo: Malkreskanta
eu: Beheranzkoa
ru: По убыванию
tr: Azalan

source: Sort mode
ar: وضع الفرز
eo: Ordiga reĝimo
eu: Sailkapen-modua
ru: Режим сортировки
tr: Sıralama kipi

source: Sort as is
ar: افرُز كما هو
eo: Ordigi kiel estas
eu: Sailkatu dagoen bezala
ru: Сортировать как есть
tr: Olduğu gibi sırala

source: Sort as character
ar: افرز كمحرف
eo: Ordigi kiel signo
eu: Sailkatu karaktere gisa
ru: Сортировать как символ
tr: Karakter olarak sırala

source: Sort as number
ar: افرز كرقم
eo: Ordigi kiel nombro
eu: Sailkatu zenbaki gisa
ru: Сортировать как число
tr: Sayı olarak sırala

source: Sort by custom function:
ar: افرُز بدالة مخصصة:
eo: Ordigi laŭ propra funkcio:
eu: Sailkatu neurrira ipinitako funtzio baten arabera:
ru: Сортировка по пользовательской функции:
tr: Özel işleve göre sırala:

source: Function(_X_) to use for sorting
ar: الدالة (_X_) للاستخدام للفرز
eo: Funkcio(_X_) uzinda por ordigo
eu: Sailkatzeko erabili beharreko funtzioa(_X_)
ru: Функция(_X_) для сортировки
tr: Sıralama için kullanılacak function(_X_)

source: Reverse sort order
ar: اعكِس ترتيب الفرز
eo: Inversa ordigo
eu: Sailkatzeko alderantzizko ordena
ru: Обратить порядок сортировки
tr: Sıralama ölçütünü tersine çevir

source: Object
ar: الكائن
eo: Objekto
eu: Objektua
ru: Объект
tr: Nesne

source: Order
ar: الترتيب
eo: Sinsekvo
eu: Ordena
ru: Порядок
tr: Sıra

source: subset_dataframe
eo: subaro_datumkadro

source: Select a subset of rows and / or columns of a data.frame
ar: حدّد مجموعة فرعية من الصفوف و/أو الأعمدة من إطار بيانات
eo: Elektu subaron de vicoj kaj/aŭ kolumnoj de data.frame
eu: Hautatu «data.frame» bateko errenkada eta/edo zutabe azpimultzo bat
ru: Выбор подмножества строк и / или столбцов data.frame
tr: Bir data.frame’in satırlarının ve/veya sütunlarının bir alt kümesini seçin

source: Select the data.frame to subset. Then specify rules to filter by rows / cases, and / or columns. A data.frame containing only the specified subset is saved to your workspace.
ar: حدّد إطار البيانات للمجموعة الفرعية. ثم حدّد قواعد للترشيح حسب الصفوف/الحالات، و/أو الأعمدة. يُحفظ إطار بيانات يحتوي فقط على المجموعة الفرعية المحددة في مساحة عملك.
eo: Elektu la data.frame al subaro. Poste specifu regulojn por filtri laŭ vicoj / kazoj, kaj / aŭ kolumnoj. Data.frame enhavanta nur la specifitan subaron estas konservita al via laborspaco.
eu: Hautatu azpimultzokatzeko «data.frame». Ondoren zehaztu errenkada/kasu, eta/edo zutabe arabera iragazteko arauak. Zehaztutako azpimultzoa bakarrik duen «data.frame» bat gordeko da zure langunean.
ru: Выберите data.frame для выделения подмножества. Затем укажите правила для фильтрации по строкам / случаям и / или столбцам. В рабочей области будет сохранён data.frame, содержащий только указанное подмножество.
tr: Alt kümeye alınacak data.frame’i seçin. Daha sonra satırlara/durumlara ve/veya sütunlara göre süzülecek kuralları belirtin. Yalnızca belirtilen alt kümeyi içeren bir data.frame çalışma alanınıza kaydedilir.

source: Select the data.frame to subset.
ar: حدّد إطار البيانات للمجموعة الفرعية.
eo: Elektu la data.frame al subaro.
eu: Hautatu azpimultzokatu beharreko «data.frame».
ru: Выберите data.frame для выделения подмножества.
tr: Alt kümeye alınacak data.frame’i seçin.

source: Preview the resulting subset. Note that the preview is limited to the first 500 rows and 100 columns, for performance reasons.
ar: عاين المجموعة الفرعية الناتجة. لاحظ أن المعاينة محدودة بأول 500 صف و 100 عمود، لأسباب تتعلق بالأداء.
eo: Antaŭrigardu la rezultan subaron. Notu, ke la antaŭrigardo estas limigita al la unuaj 500 vicoj kaj 100 kolumnoj, pro agado-kialoj.
eu: Aurreikusi emaitzako azpimultzoa. Kontuan izan errendimendu-arrazoiak direla eta, aurreikuspegia aurreneko 500 errenkada eta 100 zutabera mugatuta dagoela.
ru: Предварительный просмотр итогового подмножества. Обратите внимание, что для повышения производительности он ограничен первыми 500 строками и 100 столбцами.
tr: Ortaya çıkan alt kümeyi önizleyin. Başarım nedeniyle önizlemenin ilk 500 satır ve 100 sütunla sınırlı olduğunu unutmayın.

source: Select a column of the data.frame specifying the condition to filter cases on. Leave empty, if you do not want to filter on a column.
ar: حدّد عموداً من إطار البيانات يحدد الشرط لترشيح الحالات. اتركه فارغاً، إذا كنت لا تريد الترشيح بناءً على عمود.
eo: Elektu kolumnon de la data.frame specifantan la kondiĉon por filtri kazojn. Lasu malplena, se vi ne volas filtri sur kolumno.
ru: Выберите столбец data.frame, где указано условие, по которому будут отфильтрованы случаи. Оставьте пустым, если фильтрация по столбцу не требуется.
tr: Koşulların süzüleceği koşulu belirten data.frame’in bir sütununu seçin. Bir sütuna göre süzmek istemiyorsanız boş bırakın.

source: Select the type of condition. Note that depending on the type of the filter variable, different options are available
ar: حدّد نوع الشرط. لاحظ أنه اعتماداً على نوع متغير المرشح، تتوفر خيارات مختلفة
eo: Elektu la tipon de kondiĉo. Notu, ke depende de la tipo de la filtrila variablo, malsamaj opcioj estas disponeblaj
ru: Выберите тип условия. Обратите внимание, что перечень доступных вариантов зависит от типа выбранной переменной
tr: Koşul türünü seçin. Süzgeç değişkeninin türüne bağlı olarak farklı seçeneklerin kullanılabilir olduğunu unutmayın

source: The value to compare against (for condition types equal / not equal, and one of / not one of). Note that this will be pasted as R code, verbatim. This means, you can specify any valid R expression, including the name of another column of the data.frame. However, if you want to compare to fixed strings, you will have to make sure to quote these. E.g. 'c ("City A", "City B")'.
ar: القيمة للمقارنة بها (لأنواع الشروط يساوي/لا يساوي، وواحد من/ليس واحداً من). لاحظ أن هذا سيلصق كرمز R، حرفياً. هذا يعني، يمكنك تحديد أي تعبير R صالح، بما في ذلك اسم عمود آخر من إطار البيانات. ومع ذلك، إذا كنت تريد المقارنة بسلاسل ثابتة، ستحتاج إلى التأكد من اقتباسها. على سبيل المثال 'c ("City A", "City B")'.
eo: La valoro kun kiu kompari (por kondiĉtipoj egala/ne egala, kaj unu el/ne unu el). Notu, ke ĉi tio estos algluita kiel R-kodo, laŭvorte. Ĉi tio signifas, ke vi povas specifi ajnan validan R-esprimon, inkluzive de la nomo de alia kolumno de la data.frame. Tamen, se vi volas kompari kun fiksaj ĉenoj, vi devos certigi citi ĉi tiujn. ekz. 'c ("Urbo A", "Urbo B")'.
ru: Значение, с которым будет выполняться сравнение (для условий «равно / не равно» и «является одним из / не является одним из»). Обратите внимание, что оно будет вставлено как код R, дословно. Это означает, что можно указать любое корректное выражение R, включая название другого столбца data.frame. Тем не менее, если требуется выполнить сравнение с фиксированными строками, их обязательно нужно будет взять в кавычки. Например: «c ("Город А", "Город Б")».
tr: Karşılaştırılacak değer (eşit/eşit değil ve biri/biri değil koşul türleri için). Bunun aynı biçimde R kodu olarak yapıştırılacağını unutmayın. Bu, data.frame’in başka bir sütununun adı da içerilmek üzere herhangi bir geçerli R ifadesini belirtebileceğiniz anlamına gelir. Ancak sabit dizilerle karşılaştırmak istiyorsanız bunları alıntıladığınızdan emin olmanız gerekir. Örneğin, ‘c ("Şehir A", "Şehir B")’.

source: For comparing against ranges (condition types in between / not in between), minimum and / or maximum values can be specified. If either is omitted, only the other is checked (i.e. greater / smaller than). Note that this will be pasted as R code, verbatim. This means, you can specify any valid R expression, including the name of another column of the data.frame.
ar: للمقارنة مع النطاقات (أنواع الشروط بين/ليس بين)، يمكن تحديد قيم دنيا و/أو قصوى. إذا حُذِف أحدهما، فسيُتحقَّق من الآخر فقط (أي أكبر من/أصغر من). لاحظ أن هذا سيلصق كرمز R، حرفياً. هذا يعني، يمكنك تحديد أي تعبير R صالح، بما في ذلك اسم عمود آخر من إطار البيانات.
eo: Por kompari kontraŭ intervaloj (kondiĉspecoj inter/ne inter), minimumaj kaj/aŭ maksimumaj valoroj povas esti specifitaj. Se iu estas preterlasita, nur la alia estas kontrolita (t.e. pli granda / pli malgranda ol). Notu, ke ĉi tio estos algluita kiel R-kodo, laŭvorte. Ĉi tio signifas, ke vi povas specifi ajnan validan R-esprimon, inkluzive de la nomo de alia kolumno de la data.frame.
ru: Для сравнения по диапазонам (условия «в диапазоне» или «не в диапазоне»), можно указать минимальное и / или максимальное значение. Если пропустить одно из них, то будет проверено только условие для указанного значения (то есть «больше» или «меньше»). Обратите внимание, что значение будет вставлено как код R, дословно. Это означает, что можно указать любое корректное выражение R, включая название другого столбца data.frame.
tr: Erimlere (aradaki/aradaki olmayan koşul türleri) göre karşılaştırma yapmak için en düşük ve/veya en yüksek değerler belirtilebilir. Bunlardan herhangi biri atlanırsa yalnızca diğeri işaretlenir (yani büyük/küçüktür). Bunun aynı biçimde R kodu olarak yapıştırılacağını unutmayın. Bu, data.frame’in başka bir sütununun adı da dahil olmak üzere herhangi bir geçerli R ifadesini belirtebileceğiniz anlamına gelir.

source: Whether the minimum value is contained in the range to check against (i.e. compare 'larger or equal (&gt;=)').
ar: ما إذا كانت القيمة الدنيا موجودة في النطاق للمقارنة به (أي قارن 'أكبر من أو يساوي (&gt;=)').
eo: Ĉu la minimuma valoro estas enhavita en la intervalo por kontroli (t.e. komparu 'pli granda aŭ egala (>=)').
ru: Должно ли минимальное значение содержаться в диапазоне для выполнения проверки (это означает сравнение «больше или равно (&gt;=)»).
tr: En düşük değerin denetlenecek erimde bulunup bulunmadığı (örn. ‘daha büyük veya eşit (≥)’ karşılaştırması).

source: See above. Maximum value.
ar: انظر أعلاه. القيمة القصوى.
eo: Vidu supre. Maksimuma valoro.
eu: Begiratu gorago. Balio maximoa.
ru: Смотрите выше. Максимальное значение.
tr: Yukarıya bakın. En yüksek değer.

source: Whether the maximum value is contained in the range to check against (i.e. compare 'smaller or equal (&lt;=)').
ar: ما إذا كانت القيمة القصوى موجودة في النطاق للمقارنة به (أي قارن 'أصغر من أو يساوي (&lt;=)').
eo: Ĉu la maksimuma valoro estas enhavita en la intervalo por kontroli (t.e. komparu 'pli malgranda aŭ egala (&lt;=)').
ru: Должно ли максимальное значение содержаться в диапазоне для выполнения проверки (это означает сравнение «меньше или равно (&lt;=)»).
tr: En yüksek değerin denetlenecek erimde bulunup bulunmadığı (örn. ‘daha küçük veya eşit (≤)’ karşılaştırması).

source: You can also filter rows / cases by a custom R expression. If using this in combination with filtering by a column (see above), both conditions are combined by logical 'and' (&amp;). Leave empty, if you do not want to filter on a custom expression.
ar: يمكنك أيضاً ترشيح الصفوف/الحالات بتعبير R مخصص. إذا استخدِمتَ هذا بالاقتران مع الترشيح بعمود (انظر أعلاه)، فسيُجمَع كلا الشرطين بـ 'و' المنطقي (&amp;). اتركه فارغاً، إذا كنت لا تريد الترشيح بتعبير مخصص.
eo: Vi ankaŭ povas filtri vicojn / kazojn per propra R-esprimo. Se oni uzas ĉi tion en kombinaĵo kun filtrado per kolumno (vidu supre), ambaŭ kondiĉoj estas kombinitaj per logika 'kaj' (&amp;). Lasu malplena, se vi ne volas filtri laŭ propra esprimo.
ru: Также можно фильтровать строки / случаи по пользовательскому выражению R. Если использовать это в сочетании с фильтрацией по столбцу (смотрите выше), то оба условия соединяются логическим «и». Оставьте пустым, если фильтрация по пользовательскому выражению не требуется.
tr: Ayrıca satırları/durumları özel bir R ifadesine göre de süzebilirsiniz. Bunu bir sütuna göre süzmeyle birlikte kullanıyorsanız (yukarı bakın), her iki koşul da mantıksal ‘AND’ (&amp;) ile birleştirilir. Özel bir ifadeye göre süzmek istemiyorsanız boş bırakın.

source: Check this, if you want to remove some columns from the resulting data.frame. Otherwise, all columns will be included.
ar: علّم هذا، إذا كنت تريد إزالة بعض الأعمدة من إطار البيانات الناتج. وإلا، فستُضمَّن جميع الأعمدة.
eo: Marku ĉi tion, se vi volas forigi kelkajn kolumnojn de la rezulta data.frame. Alie, ĉiuj kolumnoj estos inkluzivitaj.
eu: Markatu hori, emaitzako «data.frame»tik zutabe batzuk kendu nahi badituzu. Bestela, zutabe guztiak sartuko dira.
ru: Установите этот флажок, чтобы удалить некоторые столбцы из итогового data.frame. В ином случае будут включены все столбцы.
tr: Ortaya çıkan data.frame’den bazı sütunları kaldırmak istiyorsanız bunu işaretleyin. Aksi takdirde tüm sütunlar içerilecektir.

source: Variables to include in the resulting data.frame
ar: المتغيرات لتضمينها في إطار البيانات الناتج
eo: Variabloj por inkluzivi en la rezultan datumon.frame
eu: Emaitzako «data.frame»an sartu beharreko aldagaiak
ru: Переменные для включения в итоговый data.frame
tr: Ortaya çıkan data.frame’de içerilecek değişkenler

source: Subset of data
ar: مجموعة فرعية من البيانات
eo: Subaro de datumoj
eu: Datuen azpimultzoa
ru: Подмножество данных
tr: Verinin alt kümesi

source: Select data
ar: حدّد البيانات
eo: Elekti datumojn
eu: Hautatu datuak
ru: Выбор данных
tr: Veri seç

source: Data (data.frame)
ar: البيانات (data.frame)
eo: Datumoj (datenoj.kadro)
eu: Datuak (data.frame)
ru: Данные (data.frame)
tr: Veri (data.frame)

source: Filter cases
ar: حالات المرشح
eo: Filtrilaj kazoj
eu: Kasuak iragazi
ru: Фильтровать случаи
tr: Süzgeç senaryoları

source: Filter rows by variable
ar: رشّح الصفوف حسب متغير
eo: Filtri vicojn laŭ variablo
eu: Iragazi errenkadak aldagaiaren arabera
ru: Фильтровать строки по переменной
tr: Satırları değişkene göre süz

source: Filter by variable
ar: رشّح حسب متغير
eo: Filtri per variablo
eu: Aldagaiaren arabera iragazi
ru: Фильтровать по переменной
tr: Değişkene göre süz

source: Keep cases matching rule
ar: احتفظ بالحالات التي تطابق القاعدة
eo: Konservu kazojn kongruantajn regulon
eu: Mantendu arauarekin bat datozen kasuak
ru: Оставить случаи, соответствующие правилу
tr: BÜYÜK/küçük harf eşleşme durumlarını tut

source: is one of (%in%)
ar: واحد من (%in%)
eo: estas unu el (% en%)
eu: haietako bat da (%in%)
ru: является одним из (%in%)
tr: şunlardan biri (%in%)

source: is not one of (!%in%)
ar: ليس واحداً من (!%in%)
eo: ne estas unu el (!%in%)
eu: ez da haietako bat (!%in%)
ru: не является одним из (!%in%)
tr: şunlardan biri değil (!%in%)

source: is equal (==)
ar: يساوي (==)
eo: estas egala (==)
eu: berdina da (==)
ru: равняется (==)
tr: eşit (⩵)

source: is not equal (!=)
ar: لا يساوي (!=)
eo: ne estas egala (!=)
eu: ez da berdina (!=)
ru: не равняется (!=)
tr: eşit değil (≠)

source: is in between
ar: هو بين
eo: estas intere
eu: artean dago
ru: находится в диапазоне
tr: arasında

source: is not between
ar: ليس بين
eo: ne estas inter
eu: ez dago artean
ru: не находится в диапазоне
tr: arasında değil

source: is TRUE
ar: هو صواب
eo: estas vera
eu: EGIA da
ru: является ИСТИНОЙ
tr: TRUE

source: is FALSE
ar: هو خطأ
eo: estas MALSA
eu: GEZURRA da
ru: является ЛОЖЬЮ
tr: FALSE

source: Value (pasted as-is, use proper quoting!)
ar: القيمة (ملصقة كما هي، استخدم الاقتباس المناسب!)
eo: Valoro (algluita tia, uzu taŭgan citaĵon!)
eu: Balioa (dagoen bezala itsatsita, erabili aipu egokiak!)
ru: Значение (вставляется «как есть», используйте кавычки надлежащим образом!)
tr: Değer (olduğu gibi yapıştırılır, düzgün tırnak kullanın!)

source: Minimum (or empty)
ar: الأدنى (أو فارغ)
eo: Minimumo (aŭ malplena)
eu: Minimoa (edo hutsik)
ru: Минимум (или пусто)
tr: En düşük (veya boş)

source: Included (>=)
ar: مشمول (>=)
eo: Inkluditaj (>=)
eu: (>=) barne
ru: Включено (>=)
tr: İçerilir (≥)

source: Maximum (or empty)
ar: الأقصى (أو فارغ)
eo: Maksimumo (aŭ malplena)
eu: Maximoa (edo hutsik)
ru: Максимум (или пусто)
tr: En yüksek (veya boş)

source: Included (<=)
ar: مشمول (<=)
eo: Inkluditaj (<=)
eu: (<=) barne
ru: Включено (<=)
tr: İçerilir (≤)

source: Filter rows by expression
ar: رشّح الصفوف بتعبير
eo: Filtri vicojn laŭ esprimo
eu: Iragazi errenkadak adierazpenaren arabera
ru: Фильтровать строки по выражению
tr: Satırları ifadeye göre süz

source: Expression (or empty)
ar: التعبير (أو فارغ)
eo: Esprimo (aŭ malplena)
eu: Adierazpena (edo hutsik)
ru: Выражение (или пусто)
tr: İfade (veya boş)

source: Filter columns
ar: رشّح الأعمدة
eo: Filtrilaj kolumnoj
eu: Iragazi zutabeak
ru: Фильтровать столбцы
tr: Sütunları süz

source: Only use a subset of variables
ar: استخدِم مجموعة فرعية فقط من المتغيرات
eo: Uzu nur subaron de variabloj
eu: Erabili bakarrik aldagaien azpimultzo bat
ru: Использовать только подмножество переменных
tr: Yalnızca değişkenlerin bir alt kümesini kullan

source: Selected variables
ar: المتغيرات المحددة
eo: Elektitaj variabloj
eu: Hautatutako aldagaiak
ru: Выбранные переменные
tr: Seçili değişkenler

source: Save results to workspace
ar: احفظ النتائج في مساحة العمل
eo: Konservu rezultojn al laborspaco
eu: Gorde emaitzak langunean
ru: Сохранить результаты в рабочей области
tr: Sonuçları çalışma sayfasına kaydet

# Author name
source: RKWard Team
ar: فريق أر كي وارد
eo: RKWard Teamo
eu: RKWard taldea
ru: Команда RKWard
tr: RKWard Takımı

source: NA
ru: Н/Д
