Repository: KDE/rkward
Catalog: po/*/rkward__embedded.po
Languages: ar, eo, ru, tr

source: Title and margins
ar: العنوان والهوامش
eo: Titolo kaj marĝenoj
ru: Заголовок и поля
tr: Başlık ve kenar boşlukları

source: Main title
ar: العنوان الرئيسي
eo: Ĉefa titolo
ru: Основной заголовок
tr: Ana başlık

source: Main title (on top). Leave empty for default title
ar: العنوان الرئيسي (في الأعلى). اترك فارغًا للعنوان مبدئي
eo: Ĉefa titolo (supre). Lasu malplena por defaŭlta titolo
ru: Основной заголовок (вверху). Оставьте пустым, чтобы использовать заголовок по умолчанию
tr: Ana başlık (en üstte). Öntanımlı başlık için boş bırakın

source: Interpret this label as literal (quoted) string
ar: فسّر هذه اللصيقة على أنها سلسلة نصية حرفية (مقتبسة)
eo: Interpretu ĉi tiun etikedon kiel laŭvortan (citan) ĉenon
ru: Обработать эту подпись как текстовую (закавыченную) строку
tr: Bu etiketi düz (tırnak içinde) dizi olarak yorumlayın

source: Subtitle
ar: العنوان الفرعي
eo: Subtitolo
ru: Подзаголовок
tr: Alt başlık

source: Sub-title (at bottom). Leave empty for default title
ar: العنوان الفرعي (في الأسفل). اترك فارغًا للعنوان مبدئي
eo: Subtitolo (malsupre). Lasu malplena por defaŭlta titolo
ru: Подзаголовок (внизу). Оставьте пустым, чтобы использовать заголовок по умолчанию
tr: Alt başlık (en altta). Öntanımlı başlık için boş bırakın

source: Custom margins
ar: هوامش مخصصة
eo: Propraj randoj
ru: Нестандартные поля
tr: Özel kenar boşlukları

source: Top
ar: أعلى
eo: Supro
ru: Сверху
tr: Üst

source: Bottom
ar: أسفل
eo: Malsupro
ru: Снизу
tr: Alt

source: Left
ar: يسار
eo: Maldekstra
ru: Слева
tr: Sol

source: Right
ar: يمين
eo: Dekstra
ru: Справа
tr: Sağ

source: Axes
ar: المحاور
eo: Aksoj
ru: Оси
tr: Eksenler

source: Axis types
ar: أنواع المحاور
eo: Tipoj de aksoj
ru: Типы осей
tr: Eksen türleri

source: Draw X axis
ar: ارسم المحور س
eo: Desegnu X-akson
ru: Рисовать ось X
tr: X ekseni çiz

source: Draw Y axis
ar: ارسم المحور ص
eo: Desegnu Y-akson
ru: Рисовать ось Y
tr: Y ekseni çiz

source: X axis logarithmic
ar: المحور س لوغاريتمي
eo: X-akso logaritma
ru: Логарифмическая ось X
tr: X ekseni logaritmiği

source: Y axis logarithmic
ar: المحور ص لوغاريتمي
eo: Y-akso logaritma
ru: Логарифмическая ось Y
tr: Y ekseni logaritmiği

source: Labels (leave empty for default)
ar: لصائق (اترك فارغًا لمبدئي)
eo: Etikedoj (lasu malplenaj defaŭlte)
ru: Подписи (оставьте пустым для использования значения по умолчанию)
tr: Etiketler (öntanımlı değer için boş bırakın)

source: X axis label
ar: لصيقة المحور س
eo: X-aksa etikedo
ru: Подпись оси X
tr: X ekseni etiketi

source: Y axis label
ar: لصيقة المحور ص
eo: Etikedo de Y-akso
ru: Подпись оси Y
tr: Y ekseni etiketi

source: Interpret these labels as literal (quoted) strings?
ar: فسّر هذه اللصائق على أنها سلاسل نصية حرفية (مقتبسة)؟
eo: Ĉu interpreti ĉi tiujn etikedojn kiel laŭvortajn (cititajn) ĉenojn?
ru: Обработать эти подписи как текстовые (закавыченные) строки?
tr: Bu etiketi düz (tırnak içinde) dizi olarak yorumlayın

source: interpret as string
ar: فسّر كسلسلة نصية
eo: interpreti kiel ĉeno
ru: обработать как строку
tr: Dizi olarak yorumla

source: Scale (Minimum/Maximum values for X/Y). Leave blank for automatic
ar: المقياس (القيم الدنيا/القصوى لـ س/ص). اترك فارغًا ليحدد آليًا
eo: Skalo (Minimumaj/Maksimumaj valoroj por X/Y). Lasu malplena por aŭtomata
ru: Масштаб (минимальные/максимальные значения для X/Y). Оставьте пустым для автоматического определения.
tr: Ölçek (X/Y için en düşük/en yüksek değerler). Otomatik için boş bırakın

source: Min X value
ar: قيمة س الدنيا
eo: Min X-valoro
ru: Мин. значение X
tr: En düşük X değeri

source: Min Y value
ar: قيمة ص الدنيا
eo: Min Y-valoro
ru: Мин. значение Y
tr: En düşük Y değeri

source: Max X value
ar: قيمة س القصوى
eo: Maksimuma X-valoro
ru: Макс. значение X
tr: En yüksek X değeri

source: Max Y value
ar: قيمة ص القصوى
eo: Maksimuma Y-valoro
ru: Макс. значение Y
tr: En yüksek Y değeri

source: Axis Annotations
ar: شروح المحور
eo: Akso-Komentoj
ru: Аннотации осей
tr: Eksen Bilgi Notları

source: Tick label orientation
ar: اتجاه لصيقة علامة التدريج
eo: Tick ​​etikedorientiĝo
ru: Ориентация подписей делений
tr: Tik etiketi yönelimi

source: Always parallel to the axis
ar: دائمًا موازٍ للمحور
eo: Ĉiam paralela al la akso
ru: Всегда параллельно оси
tr: Her zaman eksene paralel

source: Always horizontal
ar: دائمًا أفقي
eo: Ĉiam horizontala
ru: Всегда горизонтально
tr: Her zaman yatay

source: Always perpendicular to the axis
ar: دائمًا عمودي على المحور
eo: Ĉiam perpendikulara al la akso
ru: Всегда перпендикулярно оси
tr: Her zaman eksene dikey

source: Always vertical
ar: دائمًا رأسي
eo: Ĉiam vertikala
ru: Всегда вертикально
tr: Her zaman dik

source: Tick label scale (relative to cex)
ar: مقياس لصيقة علامة التدريج (مقارنة بـ cex)
eo: Tick-etikedskalo (relative al cex)
ru: Масштаб подписей делений (относительно cex)
tr: Tik etiketi ölçeği (cex’e göreceli)

source: Points / Lines
ar: نقط / خطوط
eo: Punktoj / Linioj
ru: Точки/линии
tr: Noktalar/Çizgiler

source: Type of points/lines
ar: نوع النقط/الخطوط
eo: Tipo de punktoj/linioj
ru: Тип точек/линий
tr: Noktaların/çizgilerin türleri

source: Plot individual points
ar: ارسم نقطًا فردية
eo: Grafiku individuajn punktojn
ru: Построение отдельных точек
tr: Bireysel noktalar çizdir

source: Plot lines
ar: ارسم خطوطًا
eo: Grafiki liniojn
ru: Построение линий
tr: Çizgiler çizdir

source: Plot points connected by lines (both)
ar: ارسم نقطًا متصلة بخطوط (كلاهما)
eo: Grafiko punktoj ligitaj per linioj (ambaŭ)
ru: Построение точек, соединённых линиями (и то, и другое)
tr: Çizgilerle bağlanan noktalar çizdir (her ikisi de)

source: Plot points overlaid by lines
ar: ارسم نقطًا متراكبة بخطوط
eo: Grafiko punktoj supermetitaj per linioj
ru: Построение точек, на которые накладываются линии
tr: Üzerilerinden çizgiler geçen noktalar çizdir

source: Plot vertical lines from points to the zero axis (high-density)
ar: ارسم خطوطًا رأسية من النقط إلى المحور صفر (كثافة عالية)
eo: Grafiku vertikalajn liniojn de punktoj ĝis la nula akso (altdenseca)
ru: Построение вертикальных линий от точек до нулевой оси (высокая плотность)
tr: Noktalardan sıfır eksenine kadar dikey çizgiler çizdir (yüksek yoğunluklu)

source: Step-function plots: the left edge defines the point
ar: رسومات دالة الخطوة: الحافة اليسرى تحدد النقطة
eo: Paŝo-funkciaj grafikoj: la maldekstra rando difinas la punkton
ru: Графики ступенчатых функций: левый край определяет точку
tr: Adım işlevi grafikleri: Sol kenar noktayı tanımlar

source: Step-function plots: the right edge defines the point
ar: رسومات دالة الخطوة: الحافة اليمنى تحدد النقطة
eo: Paŝo-funkciaj grafikoj: la dekstra rando difinas la punkton
ru: Графики ступенчатых функций: правый край определяет точку
tr: Adım işlevi grafikleri: Sağ kenar noktayı tanımlar

source: Aspect ratio y/x
ar: نسبة العرض إلى الارتفاع y/x
eo: Bildformato y/x
ru: Соотношение сторон y/x
tr: X/Y en–boy oranı

source: Aspect ratio
ar: نسبة العرض إلى الارتفاع
eo: Bildformato
ru: Соотношение сторон
tr: En–boy oranı

source: Note that if Aspect is a finite positive value then the window is set up so that one data unit in the x direction is equal in length to asp * one data unit in the y direction.
ar: لاحظ أنه إذا كانت نسبة العرض إلى الارتفاع قيمة موجبة محدودة، فسيُضبط الإطار بحيث تكون وحدة بيانات واحدة في اتجاه x مساوية في الطول لـ asp * وحدة بيانات واحدة في اتجاه y.
eo: Notu ke se Aspekto estas finhava pozitiva valoro tiam la fenestro estas starigita tiel ke unu datumunuo en la x-direkto estas egala en longo al asp * unu datumunuo en la y-direkto.
ru: Обратите внимание: если «Соотношение» является конечным положительным значением, то окно настраивается таким образом, что одна единица данных по направлению x равна по длине asp * одна единица данных по направлению y.
tr: Oran sonlu bir pozitif değerse pencerenin, x yönündeki bir veri biriminin uzunluğu y yönündeki oran * bir veri birimine eşit olacak şekilde ayarlandığını unutmayın.

source: The special case Aspect == 1 produces plots where distances between points are represented accurately on screen. Values with Aspect > 1 can be used to produce more accurate maps when using latitude and longitude.
ar: الحالة الخاصة Aspect == 1 تنتج رسومات حيث تُمثّل المسافات بين النقط بدقة على الشاشة. يمكن استخدام قيم Aspect > 1 لإنتاج خرائط أكثر دقة عند استخدام خطوط العرض والطول.
eo: La speciala kazo Aspect == 1 produktas grafikojn kie distancoj inter punktoj estas reprezentitaj precize sur ekrano. Valoroj kun Aspect > 1 povas esti uzataj por produkti pli precizajn mapojn kiam oni uzas latitudon kaj longitudon.
ru: В том особом случае, когда соотношение == 1, будут создаваться графики, где расстояние между точками точно представлено на экране. Значения, где соотношение > 1, могут служить для создания более точных карт с использованием широты и долготы.
tr: Oran == 1 özel durumu, noktalar arasındaki uzaklıkların ekranda doğru şekilde temsil edildiği grafikler üretir. Enlem ve boylam kullanılırken en–boy oranı > 1 olan değerler daha doğru haritalar üretmek için kullanılabilir.

source: Grid
ar: شبكة
eo: Krado
ru: Сетка
tr: Izgara

source: Add Grid to the plot
ar: أضف شبكة إلى الرسم
eo: Aldonu Kradon al la grafiko
ru: Добавить к графику сетку
tr: Grafiğe ızgara ekle

source: Various graphical parameters for <b>plot.stepfun</b>. For detailed description of the individual parameters see the R reference on 'plot.stepfun'.
ar: معلمات رسومية مختلفة لـ <b>plot.stepfun</b>. لوصف مفصل للمعلمات الفردية، انظر دليل R على 'plot.stepfun'.
eo: Diversaj grafikaj parametroj por <b>plot.stepfun</b>. Por detala priskribo de la individuaj parametroj vidu la R-referencon sur 'plot.stepfun'.
ru: Различные графические параметры для <b>plot.stepfun</b>. Подробное описание отдельных параметров доступно в справке R по «plot.stepfun».
tr: <b>plot.stepfun</b> için çeşitli grafik parametreler. Bireysel parametrelerin ayrıntılı açıklaması için ‘plot.stepfun’ adresindeki R başvurusuna bakın.

source: This is supposed to be used as an embedded plugin. All the elements are arguments to the plot.stepfun function. This plugin is useful in constructing <b>ecdf</b> plots.
ar: من المفترض استخدام هذا كملحق مضمّن. جميع العناصر هي وسائط لدالة plot.stepfun. هذا الملحق مفيد في بناء رسومات <b>ecdf</b>.
eo: Ĉi tio supozeble estas uzata kiel enigita kromaĵo. Ĉiuj elementoj estas argumentoj al la funkcio plot.stepfun. Ĉi tiu kromaĵo estas utila por konstrui <b>ecdf</b>-grafikojn.
ru: Предназначается для использования в качестве встроенного модуля. Все элементы являются аргументами функции plot.stepfun. Этот модуль полезен при построении <b>ecdf</b>-графиков (эмпирическая кумулятивная функция распределения).
tr: Bunun gömülü bir eklenti olarak kullanılması gerekiyordu. Tüm ögeler, arsa.stepfun işlevinin argümanlarıdır. Bu eklenti <b>ecdf</b> grafiklerinin oluşturulmasında kullanışlıdır.

source: This is the <i>add</i> argument. This option might be disabled by the embedding plugin.
ar: هذا هو الوسيط <i>add</i>. قد يعطّل هذا الخيار بواسطة الملحق المضمِّن.
eo: Jen la argumento <i>aldoni</i>. Ĉi tiu elekteblo povus esti malŝaltita de la eniga kromaĵo.
ru: Это аргумент <i>add</i>. Этот параметр может быть отключён модулем встраивания.
tr: Bu, <i>add</i> argümanıdır. Bu seçenek gömme eklentisi tarafından devre dışı bırakılabilir.

source: This is the <i>lty</i> argument.
ar: هذا هو الوسيط <i>lty</i>.
eo: Jen la <i>lty</i> argumento.
ru: Это аргумент <i>lty</i>.
tr: Bu, <i>lty</i> argümanıdır.

source: This is the <i>do.points</i> argument. Uncheck this option if points are NOT to be drawn.
ar: هذا هو الوسيط <i>do.points</i>. أزل علامة من هذا الخيار إذا كان لا يجب رسم النقط.
eo: Jen la argumento <i>do.points</i>. Malmarku ĉi tiun elekteblon se punktoj NE estas tiritaj.
ru: Это аргумент <i>do.points</i>. Снимите этот флажок, если точки НЕ следует рисовать.
tr: Bu, <i>do.points</i> argümanıdır. Noktaların çizilmesi istenmiyorsa bu seçeneğin işaretini kaldırın.

source: This is the <i>col.points</i> argument. Leave this as 'default' for using the standard color settings from par().
ar: هذا هو الوسيط <i>col.points</i>. اتركه كـ 'مبدئي' لاستخدام إعدادات اللون القياسية من par().
eo: Jen la argumento <i>col.points</i>. Lasu ĉi tion kiel 'defaŭlta' por uzi la normajn kolorajn agordojn de par().
ru: Это аргумент <i>col.points</i>. Оставьте значение «по умолчанию», чтобы использовать стандартные параметры цвета из par().
tr: Bu, <i>col.points</i> argümanıdır. par()’daki standart renk ayarlarını kullanmak için bunu ‘öntanımlı’ olarak bırakın.

source: This is the <i>col.hor</i> argument.
ar: هذا هو الوسيط <i>col.hor</i>.
eo: Jen la argumento <i>col.hor</i>.
ru: Это аргумент <i>col.hor</i>.
tr: Bu, <i>col.hor</i> argümanıdır.

source: This is the <i>verticals</i> arguments. Uncheck this option if vertical lines are NOT to be drawn.
ar: هذا هو الوسيط <i>verticals</i>. أزل علامة من هذا الخيار إذا كان لا يجب رسم الخطوط الرأسية.
eo: Jen la <i>vertikalaj</i> argumentoj. Malmarku ĉi tiun elekteblon se vertikalaj linioj NE estas desegnitaj.
ru: Это аргумент <i>verticals</i>. Снимите этот флажок, если вертикальные линии НЕ следует рисовать.
tr: Bu, <i>verticals</i> argümanlarıdır. Dikey çizgiler çizilmeyecekse bu seçeneğin işaretini kaldırın.

source: This is the <i>col.vert</i> argument.
ar: هذا هو الوسيط <i>col.vert</i>.
eo: Jen la argumento <i>col.vert</i>.
ru: Это аргумент <i>col.vert</i>.
tr: Bu, <i>col.vert</i> argümanıdır.

source: The above two options are not for <b>plot.stepfun</b>, but rather for <b>ecdf</b>. These are visible only in the context of 'ecdf'. They are used to set the color for the horizontal lines at y = 0 and y = 1 respectively. Specifically, this is the <i>col.01line</i> argument to <b>ecdf</b>. If only one is provided (i.e the other is set as 'Default') then both the line are of the same (specified) color. Otherwise (i.e., when both the colors are provided) both the colors are provided as a character vector of length two.
ar: الخياران أعلاه ليسا لـ <b>plot.stepfun</b>، بل هما لـ <b>ecdf</b>. هما مرئيان فقط في سياق 'ecdf'. يُستعملان لضبط اللون للخطوط الأفقية عند y = 0 و y = 1 على التوالي. على وجه التحديد، هذا هو الوسيط <i>col.01line</i> لـ <b>ecdf</b>. إذا وفّر واحد فقط (أي ضُبط الآخر على 'مبدئي') فكلا الخطين يكون لهما نفس اللون (المحدد). وإلا (أي عندما يُوفّر كلا اللونين) يُوفّر كلا اللونين كمتجه أحرف بطول اثنين.
eo: La supraj du elektoj ne estas por <b>plot.stepfun</b>, sed prefere por <b>ecdf</b>. Tiuj ĉi estas videblaj nur en la kunteksto de 'ecdf'. Ili estas uzataj por agordi la koloron por la horizontalaj linioj ĉe y = 0 kaj y = 1 respektive. Specife, ĉi tiu estas la argumento <i>col.01line</i> al <b>ecdf</b>. Se nur unu estas disponigita (t.e. la alia estas agordita kiel 'Defaŭlta') tiam ambaŭ la linio estas de la sama (specifita) koloro. Alie (t.e., kiam ambaŭ la koloroj estas disponigitaj) ambaŭ la koloroj estas disponigitaj kiel signo vektoro de longo du.
ru: Два параметра выше предназначены не для <b>plot.stepfun</b>, а для <b>ecdf</b>. Они отображаются только в контексте «ecdf». Эти параметры используются, соответственно, для установки цвета горизонтальных линий при y = 0 и y = 1. В частности, это аргумент <i>col.01line</i> для <b>ecdf</b>. Если предоставлено значение только одного параметра (то есть другой параметр установлен в значение «По умолчанию»), то обе линии будут одного и того же (указанного) цвета. В ином случае (то есть при предоставлении обоих цветов) оба цвета предоставляются как символьный вектор длины два.
tr: Yukarıdaki iki seçenek <b>plot.stepfun</b> için değil, <b>ecdf</b> içindir. Bunlar yalnızca ‘ecdf’ bağlamında görülebilir. Sırasıyla y = 0 ve y = 1’deki yatay çizgilerin rengini ayarlamak için kullanılırlar. Özellikle bu, <b>ecdf</b>’nin <i>col.01line</i> argümanıdır. Yalnızca biri sağlanırsa (yani diğeri ‘öntanımlı’ olarak ayarlanırsa), her iki çizgi de aynı (belirtilen) renkte olur. Aksi takdirde (yani her iki renk de sağlandığında), her iki renk de iki uzunlukta bir karakter vektörü olarak sağlanır.

source: <i>default_dopoints</i>: Setting this to "true" ("false") toggles the state of the '<label id="do_points"/>' check box.
ar: <i>default_dopoints</i>: ضبط هذا على "true" ("false") يقلب حالة مربع الاختيار '<label id="do_points"/>'.
eo: <i>default_dopoints</i>: Agordi ĉi tion al "true" ("false") ŝanĝas la staton de la markobutono '<label id="do_points"/>'.
ru: <i>default_dopoints</i>: установка в значение «true» («false») переключает состояние флажка «<label id="do_points"/>».
tr: <i>default_dopoints</i>: Bunu "true" ("false") olarak ayarlamak, ‘<label id="do_points"/>’ onay kutusunun durumunu değiştirir.

source: <i>default_verticals</i>: Setting this to "true" ("false") toggles the state of the '<label id="verticals"/>' check box.
ar: <i>default_verticals</i>: ضبط هذا على "true" ("false") يقلب حالة مربع الاختيار '<label id="verticals"/>'.
eo: <i>default_verticals</i>: Agordi ĉi tion al "true" ("false") ŝanĝas la staton de la markobutono '<label id="verticals"/>'.
ru: <i>default_verticals</i>: установка в значение «true» («false») переключает состояние флажка «<label id="verticals"/>».
tr: <i>default_verticals</i>: Bunu "true" ("false") olarak ayarlamak, ‘<label id="verticals"/>’ onay kutusunun durumunu değiştirir.

source: <i>allow_col01line</i>: Setting this to "true" ("false") enables (disables) the display of the two frames ('<label id="frame_col_y0"/>' and '<label id="frame_col_y0"/>') for <i>col.01line</i> option to <b>ecdf</b>.
ar: <i>allow_col01line</i>: ضبط هذا على "true" ("false") يمكّن (يعطّل) عرض الإطارين ('<label id="frame_col_y0"/>' و '<label id="frame_col_y0"/>') لخيار <i>col.01line</i> لـ <b>ecdf</b>.
eo: <i>allow_col01line</i>: Agordi ĉi tion al "true" ("false") ebligas (malŝaltas) la montradon de la du kadroj ('<label id="frame_col_y0"/>' kaj ' <label id="frame_col_y0"/>') por <i>col.01line</i> elekteblo al <b>ecdf</b>.
ru: <i>allow_col01line</i>: установка в значение «true» («false») включает (отключает) отображение двух фреймов («<label id="frame_col_y0"/>» и «<label id="frame_col_y0"/>») для параметра <i>col.01line</i> функции <b>ecdf</b>.
tr: <i>allow_col01line</i>: Bunu "true" ("false") olarak ayarlamak, <b>ecdf</b>’nin <i>col.01line</i> seçeneği olan iki çerçevenin (‘<label id="frame_col_y0"/>’ ve ‘<label id="frame_col_y0"/>’) görüntülenmesini etkinleştirir/devre dışı bırakır.

source: Step function plot options
ar: خيارات رسم دالة الخطوة
eo: Paŝaj funkcioj grafiko-opcioj
ru: Параметры графика ступенчатой функции
tr: Adım işlevi çizdirme seçenekleri

source: Options
ar: خيارات
eo: Elektebloj
ru: Параметры
tr: Seçenekler

source: Add to current plot
ar: أضف إلى الرسم الحالي
eo: Aldonu al nuna grafiko
ru: Добавить к текущему графику
tr: Geçerli grafiğe ekle

source: Line type for all lines
ar: نوع الخط لجميع الخطوط
eo: Liniotipo por ĉiuj linioj
ru: Тип линии для всех линий
tr: Tüm çizgiler için çizgi türleri

source: Default
ar: مبدئي
eo: Defaŭlta
ru: По умолчанию
tr: Öntanımlı

source: Points
ar: نقط
eo: Punktoj
ru: Точки
tr: Noktalar

source: Draw points
ar: ارسم نقطًا
eo: Tiru punktojn
ru: Рисовать точки
tr: Çizim noktaları

source: Horizontal Lines
ar: خطوط أفقية
eo: Horizontalaj Linioj
ru: Горизонтальные линии
tr: Yatay çizgiler

source: Vertical lines
ar: خطوط رأسية
eo: Vertikalaj linioj
ru: Вертикальные линии
tr: Dikey çizgiler

source: Draw vertical lines
ar: ارسم خطوطًا رأسية
eo: Desegnu vertikalajn liniojn
ru: Рисовать вертикальные линии
tr: Dikey çizgiler çiz

source: For y = 0 line
ar: لأجل الخط ص = 0
eo: Por y = 0 linio
ru: Для строки y = 0
tr: y = 0 çizgisi için

source: For y = 1 line
ar: لأجل الخط ص = 1
eo: Por y = 1 linio
ru: Для строки y = 1
tr: y = 1 çizgisi için

# Author name
source: RKWard Team
ar: فريق أر كي وارد
eo: RKWard Teamo
ru: Команда RKWard
tr: RKWard Takımı

source: Internal plugin for automated testing
ar: ملحق داخلي للاختبار آلي
eo: Interna kromaĵo por aŭtomata testado
ru: Внутренний модуль для автоматизированного тестирования
tr: Otomatikleştirilmiş sınama için içsel eklenti

source: Various parameters for the <b>grid</b>. For detailed description of the individual parameters see the R reference on 'grid'. Note that this works only when standard (traditional S) graphics functions (see library(help="graphics")) are used to construct the plot. This does not work for trellis graphics devices (see <link href="rkward://rhelp/Lattice"/> for some information).
ar: معلمات مختلفة لـ <b>grid</b>. لوصف مفصل للمعلمات الفردية، انظر دليل R على 'grid'. لاحظ أن هذا يعمل فقط عندما تُستخدم دوال رسومات قياسية (S التقليدية) (انظر library(help="graphics")) لبناء الرسم. لا يعمل هذا لأجهزة رسومات التعريشة (انظر <link href="rkward://rhelp/Lattice"/> لبعض المعلومات).
eo: Diversaj parametroj por la <b>krado</b>. Por detala priskribo de la individuaj parametroj vidu la R-referencon pri 'krado'. Notu ke tio funkcias nur kiam normaj (tradiciaj S) grafikaj funkcioj (vidu library(help="graphics")) estas uzataj por konstrui la grafikon. Ĉi tio ne funkcias por kradaj grafikaj aparatoj (vidu <link href="rkward://rhelp/Lattice"/> por iuj informoj).
ru: Различные параметры для <b>grid</b>. Подробное описание отдельных параметров доступно в справке R по «grid». Обратите внимание: работает только в том случае, когда для построения графика используются стандартные функции (смотрите library(help="graphics")). Не работает для графических устройств trellis (подробнее здесь: <link href="rkward://rhelp/Lattice"/>).
tr: <b>grid</b> için çeşitli parametreler. Bireysel parametrelerin ayrıntılı açıklaması için ‘grid’ üzerine olan R başvurusuna bakın. Bunun yalnızca standart (geleneksel S) grafik işlevleri (bkz. library(help="graphics")) grafiği oluşturmak için kullanıldığında işe yaradığını unutmayın. Bu, Trellis grafik aygıtlarında işe yaramaz (bazı bilgiler için bkz. <link href="rkward://rhelp/Lattice"/>).

source: This may or may not be used as an embedded plugin. When used on a trellis device the produced error message is displayed.
ar: قد يُستعمل هذا كملحق مضمّن أو لا. عند استخدامه على جهاز تعريشة، تُعرض رسالة الخطأ المولدة.
eo: Ĉi tio povas aŭ ne esti uzata kiel enigita kromaĵo. Kiam estas uzata sur trellis-aparato, la produktita erarmesaĝo estas montrata.
ru: Может или не может использоваться как встроенный модуль. При использовании на устройстве trellis будет показано созданное сообщение об ошибке.
tr: Bu, gömülü bir eklenti olarak kullanılabilir veya kullanılmayabilir. Bir Trellis aygıtında kullanıldığında üretilen hata iletisi görüntülenir.

source: This is the <i>nx</i> argument. The default is NULL, in which case, the vertical lines are drawn at the xaxis ticks. Select None to not draw the vertical lines. Select 'Specify below' to provide a specified (to be specified below) number of vertical lines in the grid.
ar: هذا هو الوسيط <i>nx</i>. مبدئيًا هو NULL، وفي هذه الحالة، تُرسم الخطوط الرأسية عند علامات تدريج المحور x. اختر 'بلا' لكي لا ترسم الخطوط الرأسية. اختر 'حدد أدناه' لتوفير عدد محدد (يُحدد أدناه) من الخطوط الرأسية في الشبكة.
eo: Jen la argumento <i>nx</i>. La defaŭlta estas NULL, en kiu kazo, la vertikalaj linioj estas desegnitaj ĉe la aksaj tiktakoj. Elektu Neniun por ne desegni la vertikalajn liniojn. Elektu 'Specifiku sube' por provizi specifitan (specifotan sube) nombron da vertikalaj linioj en la krado.
ru: Это аргумент <i>nx</i>. Значение по умолчанию — NULL; в этом случае для делений на оси X рисуются вертикальные линии. Выберите «Нет», чтобы не рисовать вертикальные линии. Выберите «Указать ниже», чтобы в сетке было указанное ниже количество вертикальных линий.
tr: Bu <i>nx</i> argümanıdır. Öntanımlı değer NULL’dur; bu durumda dikey çizgiler x ekseni işaretlerinde çizilir. Dikey çizgileri çizmemek için Yok’u seçin. Izgarada belirli sayıda (aşağıda belirtilecek) dikey çizgi sağlamak için ‘Aşağıda belirt’i seçin.
