Repository: KDE/rkward
Catalog: po/*/rkward__distributions.po
Languages: ru

# NAME OF TRANSLATORS
source: Your names
ru: Олеся Герасименко

# EMAIL OF TRANSLATORS
source: Your emails
ru: translation-team@basealt.ru

source: Distributions
ru: Распределения

source: Distribution functions, plots, tests of (normal) distribution, central limit theorem. Part of the official RKWard distribution
ru: Функции распределения, графики, тесты (нормальности) распределения, центральная предельная теорема. Часть официального дистрибутива RKWard

source: Shapiro-Wilk Normality Test
ru: Тест на нормальность Шапиро — Уилка

source: Anderson-Darling Normality Test
ru: Тест на нормальность Андерсона — Дарлинга

source: Cramer-von Mises Normality Test
ru: Тест на нормальность Крамера фон Мизеса

source: Pearson chi-square Normality Test
ru: Тест на нормальность хи-квадрат Пирсона

source: Shapiro-Francia Normality Test
ru: Тест на нормальность Шапиро — Франсиа

source: Lilliefors (Kolmogorov-Smirnov) Normality Test
ru: Тест на нормальность Лиллиефорса (Колмогорова — Смирнова)

source: Jarque-Bera Normality Test
ru: Тест на нормальность Харке — Бера

source: Beta distribution calculator
ru: Калькулятор бета-распределения

source: Plot Beta distribution
ru: График бета-распределения

source: Binomial distribution calculator
ru: Калькулятор биномиального распределения

source: Plot binomial distribution
ru: График биномиального распределения

source: Cauchy distribution calculator
ru: Калькулятор распределения Коши

source: Plot Cauchy distribution
ru: График распределения Коши

source: Chi-squared distribution calculator
ru: Калькулятор распределения хи-квадрат

source: Plot Chi-squared distribution
ru: График распределения хи-квадрат

source: Exponential distribution calculator
ru: Калькулятор экспоненциального распределения

source: Plot Exponential distribution
ru: График экспоненциального распределения

source: F distribution calculator
ru: Калькулятор F-распределения

source: Plot F distribution
ru: График F-распределения

source: Gamma distribution calculator
ru: Калькулятор гамма-распределения

source: Plot Gamma distribution
ru: График гамма-распределения

source: Geometric distribution calculator
ru: Калькулятор геометрического распределения

source: Plot Geometric distribution
ru: График геометрического распределения

source: Gumbel distribution calculator
ru: Калькулятор распределения Гамбела

source: Hypergeometric distribution calculator
ru: Калькулятор гипергеометрического распределения

source: Plot Hypergeometric distribution
ru: График гипергеометрического распределения

source: Logistic distribution calculator
ru: Калькулятор логистического распределения

source: Plot Logistic distribution
ru: График логистического распределения

source: Log Normal distribution calculator
ru: Калькулятор логнормального распределения

source: Plot Log Normal distribution
ru: График логнормального распределения

source: Negative Binomial distribution calculator
ru: Калькулятор отрицательного биномиального распределения

source: Plot Negative Binomial distribution
ru: График отрицательного биномиального распределения

source: Normal distribution calculator
ru: Калькулятор нормального распределения

source: Plot Normal distribution
ru: График нормального распределения

source: Poisson distribution calculator
ru: Калькулятор распределения Пуассона

source: Plot Poisson distribution
ru: График распределения Пуассона

source: t distribution calculator
ru: Калькулятор t-распределения

source: Plot t distribution
ru: График t-распределения

source: Studentized Range (Tukey) distribution calculator
ru: Калькулятор распределения стьюдентизированного диапазона (Тьюки)

source: Plot Studentized Range (Tukey) distribution
ru: График распределения стьюдентизированного диапазона (Тьюки)

source: Uniform distribution calculator
ru: Калькулятор равномерного распределения

source: Plot Uniform distribution
ru: График равномерного распределения

source: Weibull distribution calculator
ru: Калькулятор распределения Вейбулла

source: Plot Weibull distribution
ru: График распределения Вейбулла

source: Wilcoxon Rank Sum distribution calculator
ru: Калькулятор распределения суммы рангов Вилкоксона

source: Plot Wilcoxon Rank Sum distribution
ru: График распределения суммы рангов Вилкоксона

source: Binomial CLT
ru: Биномиальное (ЦПТ)

source: Geometric CLT
ru: Геометрическое (ЦПТ)

source: Hypergeometric CLT
ru: Гипергеометрическое (ЦПТ)

source: Negative Binomial CLT
ru: Отрицательное биномиальное (ЦПТ)

source: Poisson CLT
ru: Пуассона (ЦПТ)

source: Wilcoxon CLT
ru: Вилкоксона (ЦПТ)

source: Beta CLT
ru: Бета (ЦПТ)

source: Chi-squared CLT
ru: Хи-квадрат (ЦПТ)

source: Exponential CLT
ru: Экспоненциальное (ЦПТ)

source: F CLT
ru: F (ЦПТ)

source: Gamma CLT
ru: Гамма (ЦПТ)

source: Logistic CLT
ru: Логистическое (ЦПТ)

source: Log Normal CLT
ru: Логнормальное (ЦПТ)

source: Normal CLT
ru: Нормальное (ЦПТ)

source: t CLT
ru: t (ЦПТ)

source: Uniform CLT
ru: Равномерное (ЦПТ)

source: Weibull CLT
ru: Вейбулла (ЦПТ)

source: Distribution Analysis
ru: Анализ распределения

source: Univariate continuous distributions
ru: Одномерные непрерывные распределения

source: Beta
ru: Бета

source: Cauchy
ru: Коши

source: Chi-squared
ru: Хи-квадрат

source: Exponential
ru: Экспоненциальное

source: Gamma
ru: Гамма

source: Gumbel
ru: Гамбела

source: Logistic
ru: Логистическое

source: Log Normal
ru: Логнормальное

source: Normal
ru: Нормальное

source: Tukey
ru: Тьюки

source: Uniform
ru: Равномерное

source: Weibull
ru: Вейбулла

source: Univariate discrete distributions
ru: Одномерные дискретные распределения

source: Binomial
ru: Биномиальное

source: Geometric
ru: Геометрическое

source: Hypergeometric
ru: Гипергеометрическое

source: Negative Binomial
ru: Отрицательное биномиальное

source: Poisson
ru: Пуассона

source: Wilcoxon Rank Sum
ru: Сумма рангов Вилкоксона

source: Beta distribution
ru: Бета-распределение

source: Provides a calculator for probabilities, quantiles, and densities in the Beta distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в бета-распределении.

source: Parameter of the Beta distribution
ru: Параметр бета-распределения

source: Non-centrality parameter
ru: Параметр нецентральности

source: Shape 1
ru: Форма 1

source: Shape 2
ru: Форма 2

source: non-centrality parameter (ncp)
ru: параметр нецентральности (ncp)

source: Binomial distribution
ru: Биномиальное распределение

source: Provides a calculator for probabilities, quantiles, and densities in the binomial distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в биномиальном распределении.

source: Note: For the binomial distribution, quantiles can be interpreted as number of successes in the given number of trials.
ru: Примечание: в случае биномиального распределения квантили можно считать количеством успехов для указанного количества испытаний.

source: Number of binomial trials
ru: Количество биномиальных испытаний

source: Probability of success in each trial. Note that this setting is <b>not</b> affected by the "log probabilities" setting, i.e. always specify the plain probability, here.
ru: Вероятность успеха в каждом испытании. Обратите внимание: на этот параметр <b>не</b> влияет значение параметра «логарифмических вероятностей», поэтому всегда указывайте здесь обычную вероятность.

source: Quantiles can be interpreted as number of successes in the given number of trials.
ru: Квантили можно считать количеством успехов для указанного количества испытаний.

source: Binomial trials
ru: Биномиальные испытания

source: Probability of success
ru: Вероятность успеха

source: Binomial probabilities, quantiles, densities
ru: Биномиальное: вероятности, квантили, плотности

source: Cauchy distribution
ru: Распределение Коши

source: Provides a calculator for probabilities, quantiles, and densities in the Cauchy distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в распределении Коши.

source: Location parameter (median) of the Cauchy distribution
ru: Параметр расположения (медиана) распределения Коши

source: Scale parameter of the Cauchy distribution
ru: Параметр масштаба распределения Коши

source: Location
ru: Расположение

source: Scale
ru: Масштаб

source: Chi-squared distribution
ru: Распределение хи-квадрат

source: Provides a calculator for probabilities, quantiles, and densities in the Chi-squared (χ²) distribution.
ru: Предоставляет калькулятор вероятностей, квантилей и плотностей в распределении хи-квадрат (χ²).

source: Degrees of freedom
ru: Степени свободы

source: Degrees of Freedom
ru: Степени свободы

source: non-centrality parameter
ru: параметр нецентральности

source: See RKWard help on <link href="rkward://component/plot_beta_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_beta_distribution"/>.

source: Beta Parameters
ru: Бета — параметры

source: Shape1 (a)
ru: Форма1 (a)

source: Shape2 (b)
ru: Форма2 (b)

# Distribution name
source: Beta
ru: Бета

source: Central Limit Theorem: Beta to Normal
ru: Центральная предельная теорема: от бета-распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_binomial_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_binomial_distribution"/>.

source: Binomial Parameters
ru: Биномиальное — параметры

source: Number of trials
ru: Количество испытаний

source: Probability of success on each trial
ru: Вероятность успеха при каждом испытании

# Distribution name
source: Binomial
ru: Биномиальное

source: Central Limit Theorem: Binomial to Normal
ru: Центральная предельная теорема: от биномиального распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_chi_squared_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_chi_squared_distribution"/>.

source: Chi squared Parameters
ru: Хи-квадрат — параметры

# Distribution name
source: Chi-Squared
ru: Хи-квадрат

source: Central Limit Theorem: Chi squared to Normal
ru: Центральная предельная теорема: от распределения хи-квадрат к нормальному распределению

source: Normal approximation to <label id="dist_name"/> Sample averages. Most of this help file is generic description of CLT plugins. Sample averages from a contending distribution (<label id="dist_name"/> here) are compared to a target Normal distribution. The comparison is made based on either histograms or distribution functions. For brevity, D will denote the contending distribution (<label id="dist_name"/> here).
ru: Аппроксимация нормальным распределением к выборочным средним значениям <label id="dist_name"/>. Большую часть этого файла справки занимает общее описание модулей ЦПТ. Выборочные средние значения из конкурирующего распределения (здесь — <label id="dist_name"/>) сравниваются с целевым нормальным распределением. Сравнение выполняется на основе либо гистограмм, либо функций распределения. Конкурирующее распределение (здесь — <label id="dist_name"/>) для краткости обозначается как «D».

source: Choose the <label id="dist_name"/> parameters, the sample sizes needed for CLT and a choice of function. The function specific options are provided in different tabs.
ru: Укажите параметры <label id="dist_name"/>, размеры выборок для ЦПТ и нужную функцию. Зависящие от функции параметры можно указать с помощью других вкладок.

source: These many samples (nAvg) are used to calculate sample average. For a fixed value of the parameters, one would be interested in seeing how the distribution of the sample averages change as this number increases.
ru: Это количество выборок (nAvg) используется для расчёта выборочного среднего значения. Если значение параметров зафиксировано, можно наблюдать за тем, как распределение выборочных средних значений изменяется с увеличением количества выборок.

source: These many sets-of-samples (nDist) are used to get some idea about the distribution of the sample averages. Each set provides an average. Then these averages are used to construct the 'Histogram' or the 'Distribution function'.
ru: Это количество наборов выборок (nDist) используется для получения представления о распределении выборочных средних значений. Каждый набор предоставляет среднее значение. Затем эти средние значения используются для построения «Гистограммы» или «Функции распределения».

source: Choose one of 'Histogram' or 'Distribution function' to compare the distribution of the sample averages of D with that of Normal distribution.
ru: Выберите один из вариантов («Гистограмма» или «Функция распределения») для сравнения распределения выборочных средних значений D с нормальным распределением.

source: Should the sample averages be normalised, by subtracting the mean, E(D), of D and dividing by the standard deviation, S(D)/sqrt(nAvg), where S(D) is the standard deviation of D? If done so, then the target Normal distribution is taken to be the standard one, that is, with mean 0 and variance 1. Otherwise the target distribution is Normal with the mean E(D) and standard deviation S(D)/sqrt(nAvg).
ru: Следует ли выполнять нормализацию выборочных средних значений путём вычитания среднего, E(D), D и деления на стандартное отклонение, S(D)/sqrt(nAvg), где S(D) является стандартным отклонением D? Если да, то целевое нормальное распределение считается стандартным, то есть со средним 0 и дисперсией 1. Если нет, то целевое распределение является нормальным со средним E(D) и стандартным отклонением S(D)/sqrt(nAvg).

source: Should a Normal curve be drawn? For the case of 'Histogram', nDist random samples are drawn from the target Normal distribution and their density values are plotted.
ru: Следует ли рисовать кривую нормального распределения? Когда выбрана «Гистограмма», nDist случайных выборок извлекается из целевого нормального распределения и строится график значений их плотности.

source: Pointtype for the Normal curve.
ru: Тип точек кривой нормального распределения.

source: Color of the Normal curve.
ru: Цвет кривой нормального распределения.

source: Various plot options.
ru: Различные параметры графика.

source: Preview button.
ru: Кнопка предпросмотра.

source: The 'Frequency' checkbox is unavailable because, in this situation, drawing the histogram with <i>freq=TRUE</i> does not make sense. Also, since histogram is the main plot, 'Add to current plot' checkbox has also been disabled. See RKWard help on <link href="rkward://component/histogram_options"/> for other histogram centric details.
ru: Флажок «Частота» недоступен, потому что в этой ситуации рисование гистограммы со значением <i>freq=TRUE</i> не имеет смысла. Кроме того, так как гистограмма является основным графиком, флажок «Добавить к текущему графику» также отключён. Другие сведения о гистограмме доступны в следующем разделе справки RKWard: <link href="rkward://component/histogram_options"/>.

source: Stepfunction options
ru: Параметры ступенчатой функции

source: See the help on the <link href="rkward://component/plot_stepfun_options"/> plugin. The 'Add to current plot' option is unavailable.
ru: Смотрите справку по модулю <link href="rkward://component/plot_stepfun_options"/>. Параметр «Добавить к текущему графику» недоступен.

source: Sample Averages
ru: Выборочные средние значения

source: Parameters
ru: Параметры

source: CLT Samples
ru: Выборки ЦПТ

source: Samples for Average
ru: Выборки для среднего значения

source: Samples for distribution
ru: Выборки для распределения

source: Choose type of function plot
ru: Выбор типа графика функции

source: Histogram and Density
ru: Гистограмма и плотность

source: ECDF and Distribution
ru: Эмпирическая кумулятивная функция распределения и распределение

source: Use normalised random variable
ru: Использовать нормализованную случайную переменную

source: Normal Curve Options
ru: Параметры кривой нормального распределения

source: Draw normal curve
ru: Рисовать кривую нормального распределения

source: Type of points/lines
ru: Тип точек/линий

source: Individual points
ru: Отдельные точки

source: Lines
ru: Линии

source: Points connected by lines (both)
ru: Точки, соединённые линиями (и то, и другое)

source: Points overlaid by lines
ru: Точки, на которые накладываются линии

source: Vertical lines (high-density)
ru: Вертикальные линии (высокая плотность)

source: Step-function on left edge
ru: Ступенчатая функция по левому краю

source: Step-function on right edge
ru: Ступенчатая функция по правому краю

source: Color
ru: Цвет

source: Plot Options
ru: Параметры графика

source: Preview
ru: Предпросмотр

source: Histogram
ru: Гистограмма

source: Histogram Options
ru: Параметры гистограммы

source: ECDF options
ru: Параметры эмпирической кумулятивной функции распределения

source: See RKWard help on <link href="rkward://component/plot_exponential_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_exponential_distribution"/>.

source: Exponential Parameters
ru: Экспоненциальное — параметры

source: Rate
ru: Интенсивность

# Distribution name
source: Exponential
ru: Экспоненциальное

source: Central Limit Theorem: Exponential to Normal
ru: Центральная предельная теорема: от экспоненциального распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_f_distribution"/>. For variance to exist we need the 'Denominator degrees of freedom' parameter to be greater than 4.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_f_distribution"/>. Для существования дисперсии параметр «Степени свободы знаменателя» должен быть больше 4.

source: F Parameters
ru: F — параметры

source: Numerator degrees of freedom
ru: Степени свободы числителя

source: Denominator degrees of freedom
ru: Степени свободы знаменателя

source: Central Limit Theorem: F to Normal
ru: Центральная предельная теорема: от F-распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_gamma_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_gamma_distribution"/>.

source: Gamma Parameters
ru: Гамма — параметры

source: Shape
ru: Форма

source: Rate (lambda) or 1/Scale
ru: Интенсивность (лямбда) или 1/масштаб

# Distribution name
source: Gamma
ru: Гамма

source: Central Limit Theorem: Gamma to Normal
ru: Центральная предельная теорема: от гамма-распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_geometric_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_geometric_distribution"/>.

source: Geometric Parameters
ru: Геометрическое — параметры

# Distribution name
source: Geometric
ru: Геометрическое

source: Central Limit Theorem: Geometric to Normal
ru: Центральная предельная теорема: от геометрического распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_hypergeometric_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_hypergeometric_distribution"/>.

source: Hypergeometric Parameters
ru: Гипергеометрическое — параметры

source: Number of white balls (m)
ru: Количество белых шаров (m)

source: Number of black balls (n)
ru: Количество чёрных шаров (n)

source: Number of balls drawn (k)
ru: Количество извлечённых шаров (k)

# Distribution name
source: Hypergeometric
ru: Гипергеометрическое

source: Central Limit Theorem: Hypergeometric to Normal
ru: Центральная предельная теорема: от гипергеометрического распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_logistic_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_logistic_distribution"/>.

source: Logistic Parameters
ru: Логистическое — параметры

# Distribution name
source: Logistic
ru: Логистическое

source: Central Limit Theorem: Logistic to Normal
ru: Центральная предельная теорема: от логистического распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_lognormal_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_lognormal_distribution"/>.

source: Lognormal Parameters (in log-scale)
ru: Логнормальное — параметры (по логарифмической шкале)

source: Mean
ru: Среднее

source: Standard deviation
ru: Стандартное отклонение

# Distribution name
source: Lognormal
ru: Логнормальное

source: Central Limit Theorem: Lognormal to Normal
ru: Центральная предельная теорема: от логнормального распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_negbinomial_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_negbinomial_distribution"/>.

source: Negative Binomial Parameters
ru: Отрицательное биномиальное — параметры

source: Target number of successful trials
ru: Целевое количество успешных испытаний

source: Dispersion
ru: Разброс

source: Success probability
ru: Вероятность успеха

source: Mean (mu)
ru: Среднее (мю)

source: Type of Parametrization
ru: Тип параметризации

# Distribution name
source: Negative Binomial
ru: Отрицательное биномиальное

source: Central Limit Theorem: Negative Binomial to Normal
ru: Центральная предельная теорема: от отрицательного биномиального распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_normal_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_normal_distribution"/>.

source: Normal Parameters
ru: Нормальное — параметры

# Distribution name
source: Normal
ru: Нормальное

source: Central Limit Theorem: Normal to Normal
ru: Центральная предельная теорема: от нормального распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_poisson_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_poisson_distribution"/>.

source: Poisson Parameters
ru: Пуассона — параметры

# Distribution name
source: Poisson
ru: Пуассона

source: Central Limit Theorem: Poisson to Normal
ru: Центральная предельная теорема: от распределения Пуассона к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_t_distribution"/>. For the variance to exist, the 'Degrees of freedom' parameter has to be greater than 2.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_t_distribution"/>. Для существования дисперсии параметр «Степени свободы» должен быть больше 2.

source: t Parameters
ru: t — параметры

source: Central Limit Theorem: t to Normal
ru: Центральная предельная теорема: от t-распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_uniform_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_uniform_distribution"/>.

source: Uniform Parameters
ru: Равномерное — параметры

source: Minimum
ru: Минимум

source: Maximum
ru: Максимум

# Distribution name
source: Uniform
ru: Равномерное

source: Central Limit Theorem: Uniform to Normal
ru: Центральная предельная теорема: от равномерного распределения к нормальному распределению

source: See RKWard help on <link href="rkward://component/plot_weibull_distribution"/>.
ru: Смотрите следующий раздел справки RKWard: <link href="rkward://component/plot_weibull_distribution"/>.

source: Weibull Parameters
ru: Вейбулла — параметры

# Distribution name
source: Weibull
ru: Вейбулла

source: Central Limit Theorem: Weibull to Normal
ru: Центральная предельная теорема: от распределения Вейбулла к нормальному распределению
