Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: Shows/raises the R Help Search window
ar: يعرض/يرفع نافذة بحث مساعدة R
ru: Показывает или поднимает окно поиска в документации R
tr: R yardım arama penceresini gösterir/yükseltir

source: Show the RKWard dashboard with links to important settings and documentation
ar: اعرض لوحة تحكم أر كي وارد مع روابط لإعدادات وتوثيق مهمين
ru: Показать страницу обзора RKWard со ссылками на важные параметры и документацию
tr: Önemli ayarlara ve belgelere bağlantılar içeren RKWard gösterge tablosunu göster

source: Previous Window
ar: النافذة السابقة
ru: Предыдущее окно
tr: Önceki Pencere

source: Next Window
ar: النافذة التالية
ru: Следующее окно
tr: Sonraki Pencere

source: Activate Document view
ar: نشط عرض المستند
ru: Активировать панель просмотра документов
tr: Belge Görünümünü Etkinleştir

source: Show/Hide %1
ar: اعرض/ أخفِ %1
ru: Показать/скрыть %1
tr: Göster/Gizle: %1

source: For technical reasons, the following dialog allows you to configure the keyboard shortcuts only for those parts of RKWard that are currently active. Therefore, if you want to configure keyboard shortcuts e.g. for use inside the script editor, you need to open a script editor window, and activate it.
ar: لأسباب فنية، يتيح لك الحوار التالي ضبط اختصارات لوحة المفاتيح فقط لأجزاء أر كي وارد النشطة حاليًا. لذلك، إن أردت ضبط اختصارات لوحة المفاتيح لاستخدامها مثلًا داخل محرر النصوص البرمجية، تحتاج إلى افتح نافذة محرر نصوص برمجية، ونشطها.
ru: По техническим причинам следующий диалог позволяет настроить комбинации клавиш только для активных в данный момент частей RKWard. Поэтому для настройки комбинаций клавиш, например, для редактора сценариев, необходимо открыть его окно и активировать его.
tr: Teknik nedenlerden dolayı, aşağıdaki iletişim kutusu yalnızca RKWard’ın o anda etkin olan bölümleri için klavye kısayollarını yapılandırmanıza olanak tanır. Bu nedenle, klavye kısayollarını yapılandırmak istiyorsanız; örneğin, betik düzenleyicisinin içinde kullanmak için bir betik düzenleyicisi penceresi açmanız ve onu etkinleştirmeniz gerekir.

source: Note
ar: ملاحظة
ru: Примечание
tr: Not

source: For technical reasons, the following dialog allows you to configure the toolbar buttons only for those parts of RKWard that are currently active. Therefore, if you want to configure tool buttons e.g. for use inside the script editor, you need to open a script editor window, and activate it.
ar: لأسباب فنية، يتيح لك الحوار التالي ضبط أزرار شريط الأدوات فقط لأجزاء أر كي وارد النشطة حاليًا. لذلك، إن أردت ضبط أزرار الأدوات لاستخدامها مثلًا داخل محرر النصوص البرمجية، تحتاج إلى افتح نافذة محرر نصوص برمجية، ونشطها.
ru: По техническим причинам следующий диалог позволяет настроить кнопки панели инструментов только для тех частей RKWard, которые активны в настоящий момент. Следовательно, чтобы настроить кнопки инструментов для использования, например, внутри редактора сценариев, потребуется открыть окно редактора сценариев и активировать его.
tr: Teknik nedenlerden dolayı, aşağıdaki iletişim kutusu yalnızca RKWard’ın o anda etkin olan bölümleri için araç çubuklarını yapılandırmanıza olanak tanır. Bu nedenle, araç çubuğu düğmelerini yapılandırmak istiyorsanız; örneğin, betik düzenleyicisinin içinde kullanmak için bir betik düzenleyicisi penceresi açmanız ve onu etkinleştirmeniz gerekir.

source: You have tried to embed a new R graphics device window in RKWard. However, this is not currently supported in this build of RKWard on Mac OS X. See https://rkward.kde.org/mac for more information.
ar: لقد حاولت تضمين نافذة جهاز رسومات بيانية R جديدة في أر كي وارد. ومع ذلك، لا يدعم هذا حاليًا في هذا البناء من أر كي وارد على Mac OS X. انظر https://rkward.kde.org/mac لمزيد من المعلومات.
ru: Выполнена попытка встроить в RKWard новое окно графического устройства R. Но такая возможность пока не поддерживается этой сборкой RKWard на Mac OS X. Дополнительные сведения: https://rkward.kde.org/mac.
tr: RKWard’a yeni bir R grafik aygıtı penceresi yerleştirmeyi denediniz. Ancak bu, şu anda macOS’teki RKWard’ın bu yapısında desteklenmemektedir. Daha fazla bilgi için https://rkward.kde.org/mac adresine bakın.

source: Could not embed R X11 window
ar: تعذر تضمين نافذة R X11
ru: Не удалось встроить окно X11 R
tr: R X11 penceresi gömülemiyor

source: You have tried to embed a new R graphics device window in RKWard. However, either no window was created, or RKWard failed to detect the new window. If you think RKWard should have done better, consider reporting this as a bug. Alternatively, you may want to adjust Settings->Configure RKWard->Onscreen Graphics.
ar: لقد حاولت تضمين نافذة جهاز رسومات بيانية R جديدة في أر كي وارد. ومع ذلك، إما لم تنشأ أي نافذة، أو أر كي وارد فشل في اكتشاف النافذة الجديدة. إن ظننت أن أر كي وارد كان يجب أن يعمل بشكل أفضل، فكر في الإبلاغ عن هذا كعلة. بدلاً من ذلك، قد ترغب في اضبط إعدادات->اضبط أر كي وارد->الرسومات البيانية على الشاشة.
ru: Выполнена попытка встроить в RKWard новое окно графического устройства R. Но произошло следующее: либо окно не было создано, либо RKWard не удалось обнаружить новое окно. Можно отправить отчёт об ошибке. Либо скорректируйте параметры в разделе «Настройка -> Настроить RKWard -> Экранная графика».
tr: RKWard’a yeni bir R grafik aygıtı penceresi gömmeyi denediniz. Ancak ya hiçbir pencere oluşturulmadı ya da RKWard yeni pencereyi algılayamadı. RKWard’ın daha iyisini yapması gerektiğini düşünüyorsanız bunu bir hata olarak bildirmeyi düşünün. Alternatif olarak, Ayarlar → RKWard Uygulamasını Yapılandır → Ekran Grafikleri’ni değiştirmek isteyebilirsiniz.

source: An error occurred
ar: حدث خطأ
ru: Произошла ошибка
tr: Bir hata oluştu

source: Graphics Device Window
ar: نافذة جهاز الرسومات البيانية
ru: Окно графического устройства
tr: Grafik Aygıtı Penceresi

source: The current window appears too large to fit on the screen. If this happens regularly, you may want to adjust the default graphics window size in Settings->Configure RKWard->Onscreen Graphics.
ar: تبدو النافذة الحالية كبيرة جدًا لتناسب الشاشة. إن حدث هذا بانتظام، قد ترغب في اضبط حجم نافذة الرسومات البيانية مبدئيًا في إعدادات->اضبط أر كي وارد->الرسومات البيانية على الشاشة.
ru: Похоже, размер текущего окна так велик, что оно не помещается на экране. Если такое происходит часто, можно скорректировать стандартный размер графического окна в разделе «Настройка -> Настроить RKWard -> Экранная графика».
tr: Geçerli pencere ekrana sığmayacak kadar büyük görünüyor. Bu durum düzenli olarak oluyorsa Ayarlar → RKWard Uygulamasını Yapılandır → Ekran Grafikleri bölümünden öntanımlı grafik penceresi boyutunu ayarlamak isteyebilirsiniz.

source: Large window
ar: نافذة كبيرة
ru: Большое окно
tr: Pencere Büyük

source: Closing device (saving history)
ar: جاري إغلاق الجهاز (حفظ السجل)
ru: Закрытие устройства (сохранение журнала)
tr: Aygıt kapatılıyor (geçmiş kaydediliyor)

source: Shutting down device number %1
ar: إيقاف تشغيل الجهاز رقم %1
ru: Выключение устройства с номером %1
tr: %1 numaralı aygıt kapatılıyor

source: <p>The graphics device is being closed, saving the last plot to the plot history. This may take a while, if the R backend is still busy. You can close the graphics device immediately, in case it is stuck. However, the last plot may be missing from the plot history, if you do this.</p>
ar: <p>جاري إغلاق جهاز الرسومات البيانية، حفظ آخر مخطط في سجل المخططات. قد يستغرق هذا بعض الوقت، إذا كانت خلفية R لا تزال مشغولة. يمكنك إغلاق جهاز الرسومات البيانية على الفور، في حال توقفه. ومع ذلك، قد يكون آخر مخطط مفقودًا من سجل المخططات، إن فعلت هذا.</p>
ru: <p>Выполняется закрытие графического устройства и сохранение последнего графика в журнал. Если серверное приложение R ещё занято, это может занять некоторое время. Если это продолжается слишком долго, можно выполнить немедленное закрытие графического устройства (но тогда в журнал может не попасть последний график).</p>
tr: <p>Grafik aygıtı kapatılıyor ve son çizim, grafik geçmişine kaydediliyor. R arka ucu hâlâ meşgulse bu biraz zaman alabilir. Sıkışması durumunda grafik aygıtını hemen kapatabilirsiniz. Ancak bunu yaparsanız son grafik çizimi geçmişinde eksik olabilir.</p>

source: <p>Note: On X11, the embedded window may be expurged, and you will have to close it manually in this case.</p>
ar: <p>ملاحظة: على X11، قد تُطرد النافذة المضمنة، وسيتعين عليك إغلاقها يدويًا في هذه الحالة.</p>
ru: <p>Примечание: в X11 встроенное окно может быть очищено, в этом случае придётся закрыть его вручную.</p>
tr: <p>Not: X11’de gömülü pencere silinebilir ve bu durumda onu elle kapatmanız gerekecektir.</p>

source: Close immediately
ar: أغلق فوراً
ru: Закрыть немедленно
tr: Anında Kapat

source: Specify fixed size
ar: حدد حجمًا ثابتًا
ru: Указание фиксированного размера
tr: Sabit Boyutu Belirt

source: Width
ar: العرض
ru: Ширина
tr: Genişlik

source: Height
ar: الارتفاع
ru: Высота
tr: Yükseklik

source: Activate graphics device number %1
ar: نشط جهاز الرسومات البيانية رقم %1
ru: Активировать графическое устройство с номером %1
tr: %1 numaralı grafik aygıtını etkinleştir

source: Copy contents of graphics device number %1 to output
ar: انسخ محتويات جهاز الرسومات البيانية رقم %1 إلى الناتج
ru: Скопировать данные графического устройства с номером %1 в вывод
tr: %1 numaralı grafik aygıtının içeriğini çıktıya kopyala

source: Print contents of graphics device number %1
ar: اطبع محتويات جهاز الرسومات البيانية رقم %1
ru: Распечатать данные графического устройства с номером %1
tr: %1 numaralı grafik aygıtının içeriğini yazdır

source: Specify R object
ar: حدد كائن R
ru: Указание объекта R
tr: R Nesnesi Belirt

source: Specify the R object name, you want to save the graph to
ar: حدد اسم كائن R، الذي تريد حفظ الرسم البياني فيه
ru: Укажите имя объекта R для сохранения графика
tr: Grafiğin kaydedileceği R nesnesinin adını belirt

source: Save contents of graphics device number %1 to object '%2'
ar: احفظ محتويات جهاز الرسومات البيانية رقم %1 في الكائن '%2'
ru: Сохранить данные графического устройства с номером %1 в объект «%2»
tr: %1 numaralı grafik aygıtının içeriğini “%2” nesnesine kaydet

source: Duplicate graphics device number %1
ar: ضاعف جهاز الرسومات البيانية رقم %1
ru: Дублировать графическое устройство с номером %1
tr: %1 numaralı grafik aygıtını çoğalt

source: Load next plot in device number %1
ar: حمل المخطط التالي في الجهاز رقم %1
ru: Загрузить следующий график в графическое устройство с номером %1
tr: %1 numaralı aygıta sonraki grafiği yükle

source: Loading plot from history
ar: تحميل المخطط من السجل
ru: Загрузка графика из журнала
tr: Grafik geçmişten yükleniyor

source: Load previous plot in device number %1
ar: حمل المخطط السابق في الجهاز رقم %1
ru: Загрузить предыдущий график в графическое устройство с номером %1
tr: %1 numaralı aygıta önceki grafiği yükle

source: Load first plot in device number %1
ar: حمل المخطط الأول في الجهاز رقم %1
ru: Загрузить первый график в графическое устройство с номером %1
tr: %1 numaralı aygıta ilk grafiği yükle

source: Load last plot in device number %1
ar: حمل المخطط الأخير في الجهاز رقم %1
ru: Загрузить последний график в графическое устройство с номером %1
tr: %1 numaralı aygıta son grafiği yükle

source: Load plot %1 in device number %2
ar: حمل المخطط %1 في الجهاز رقم %2
ru: Загрузить график %1 в устройство с номером %2
tr: %2 numaralı aygıta %1 grafiğini yükle

source: Append this plot to history (device number %1)
ar: ألحق هذا المخطط إلى السجل (الجهاز رقم %1)
ru: Добавить этот график в журнал (устройство номер %1)
tr: Bu grafiği geçmişe ekle (aygıt numarası %1)

source: Remove current plot from history (device number %1)
ar: أزل المخطط الحالي من السجل (الجهاز رقم %1)
ru: Удалить текущий график из журнала (устройство номер %1)
tr: Bu grafiği geçmişten kaldır (aygıt numarası %1)

source: This will clear the plot history for all device windows, not just this one. If this is not your intent, press cancel, below.
ar: سيمحو هذا سجل المخططات لجميع نوافذ الأجهزة، وليس هذه فقط. إن لم يكن هذا قصدك، اضغط على إلغاء، أدناه.
ru: Будет очищен журнал графиков для всех окон устройств, а не только для этого. Если этого делать не нужно, нажмите расположенную ниже кнопку «Отмена».
tr: Bu, yalnızca bunun değil, tüm aygıt pencerelerinin grafik geçmişini temizleyecektir. Amacınız bu değilse aşağıdaki iptal düğmesine basın.

source: Clear plot history
ar: امحُ سجل المخططات
ru: Очистить журнал графиков
tr: Grafik geçmişini temizle

source: Plot properties (device number %1)
ar: خصائص المخطط (الجهاز رقم %1)
ru: Свойства графика (устройство с номером %1)
tr: Grafik özellikleri (aygıt numarası %1)

source: <Unsaved plot>
ar: <مخطط غير محفوظ>
ru: <Несохранённый график>
tr: <kaydedilmemiş grafik>

source: Draw area follows size of window
ar: منطقة الرسم تتبع حجم النافذة
ru: Область рисования следует за размерами окна
tr: Çizdirme alanı pencerenin büyüklüğünü izler

source: Set fixed size 500x500
ar: اضبط حجمًا ثابتًا 500×500
ru: Установить фиксированный размер 500x500
tr: Büyüklüğü 500 × 500 Olarak Ayarla

source: Set fixed size 1000x1000
ar: اضبط حجمًا ثابتًا 1000×1000
ru: Установить фиксированный размер 1000x1000
tr: Büyüklüğü 1000 × 1000 Olarak Ayarla

source: Set fixed size 2000x2000
ar: اضبط حجمًا ثابتًا 2000×2000
ru: Установить фиксированный размер 2000x2000
tr: Büyüklüğü 2000 × 2000 Olarak Ayarla

source: Set specified fixed size...
ar: اضبط حجمًا ثابتًا محددًا...
ru: Установить указанный фиксированный размер...
tr: Belirtilen Büyüklüğü Ayarla…

source: Previous plot
ar: المخطط السابق
ru: Предыдущий график
tr: Önceki Grafik

source: First plot
ar: المخطط الأول
ru: Первый график
tr: İlk Grafik

source: Next plot
ar: المخطط التالي
ru: Следующий график
tr: Sonraki Grafik

source: Last plot
ar: المخطط الأخير
ru: Последний график
tr: Son Grafik

source: Go to plot
ar: اذهب إلى المخطط
ru: Перейти к графику
tr: Grafiğe Git

source: Append this plot
ar: ألحق هذا المخطط
ru: Добавить этот график
tr: Bu Grafiği İliştir

source: Remove this plot
ar: أزل هذا المخطط
ru: Удалить этот график
tr: Bu Grafiği Kaldır

source: Clear history
ar: امحُ التاريخ
ru: Очистить журнал
tr: Geçmişi Temizle

source: Plot properties
ar: خصائص المخطط
ru: Свойства графика
tr: Grafik Özellikleri

source: Make active
ar: اجعل نشطًا
ru: Сделать активным
tr: Etkin Yap

source: Copy to output
ar: انسخ إلى الناتج
ru: Скопировать в вывод
tr: Çıktıya Kopyala

source: Store as R object...
ar: خزن ككائن R...
ru: Сохранить как объект R…
tr: R Nesnesi Olarak Tut…

source: Duplicate
ar: كرّر
ru: Дублировать
tr: Çoğalt

source: Stop interaction
ar: أوقف التفاعل
ru: Прекратить взаимодействие
tr: Etkileşimi Durdur

source: The url you are trying to open ('%1') is not a local file or the filetype is not supported by RKWard. Do you want to open the url in the default application?
ar: الرابط الذي تحاول فتحه ('%1') ليس ملفًا محليًا أو نوع الملف غير مدعوم من أر كي وارد. هل تريد فتح الرابط في التطبيق المبدئي؟
ru: URL-адрес, по которому выполняется переход («%1»), не является адресом локального файла или является адресом файла, тип которого не поддерживается RKWard. Открыть данные в приложении по умолчанию?
tr: Açmaya çalıştığınız URL (“%1”) yerel bir dosya değil veya dosya türü RKWard tarafından desteklenmiyor. URL’yi öntanımlı uygulamada açmak istiyor musunuz?

source: Open in default application?
ar: افتح في التطبيق المبدئي؟
ru: Открыть в приложении по умолчанию?
tr: Öntanımlı Uygulama İle Aç?

source: Failed to open output file. Error message was '%1'
ar: فشل في فتح ملف الناتج. رسالة الخطأ كانت '%1'
ru: Не удалось открыть файл вывода. Получено сообщение об ошибке «%1»
tr: Çıktı dosyası açılamadı. Hata iletisi “%1” idi

source: You are about to edit object "%1", which is very large (%2 fields). RKWard is not optimized to handle very large objects in the built in data editor. This will use a lot of memory, and - depending on your system - might be very slow. For large objects it is generally recommended to edit using command line means or to split into smaller chunks before editing. On the other hand, if you have enough memory, or the data is simple enough (numeric data is easier to handle, than factor), editing may not be a problem at all. You can configure this warning (or turn it off entirely) under Settings->Configure RKWard->General. Really edit object?
ar: أنت على وشك تحرير الكائن "%1"، وهو كبير جدًا (حقول %2). أر كي وارد غير محسّن للتعامل مع الكائنات الكبيرة جدًا في محرر البيانات المضمن. سيستخدم هذا الكثير من الذاكرة، و - اعتمادًا على نظامك - قد يكون بطيئًا جدًا. بالنسبة للكائنات الكبيرة يوصى عمومًا بالتحرير باستخدام وسائل سطر الأوامر أو بالتقسيم إلى أجزاء أصغر قبل التحرير. من ناحية أخرى، إن كانت لديك ذاكرة كافية، أو كانت البيانات بسيطة بما فيه الكفاية (البيانات الرقمية أسهل في التعامل، من العامل)، قد لا يكون التحرير مشكلة على الإطلاق. يمكنك اضبط هذا التحذير (أو إيقاف تشغيله بالكامل) ضمن إعدادات->اضبط أر كي وارد->عام. هل تحرر الكائن حقًا؟
ru: Будет выполнено редактирование объекта «%1», который имеет очень большой размер (количество полей — %2). Программа RKWard не оптимизирована для обработки очень больших объектов во встроенном редакторе данных. Потребуется много памяти и — в зависимости от системы — времени. Большие объекты обычно рекомендуется редактировать с помощью инструментов командной строки (или разделять такие объекты на части меньшего размера перед редактированием). С другой стороны, если имеется значительный объём памяти или данные достаточно просты (числовые данные проще обрабатывать, чем факторы), то редактирование не составит никаких проблем. Это предупреждение можно настроить (или полностью отключить) с помощью параметров в разделе «Настройка -> Настроить RKWard -> Основное». Выполнить редактирование объекта?
tr: Çok büyük (%2 alan) “%1” nesnesini düzenlemek üzeresiniz. RKWard, yerleşik veri düzenleyicisinde çok büyük nesneleri işlemek için eniyilenmemiştir. Bu, çok fazla bellek kullanacaktır ve sisteminize bağlı olarak çok yavaş olabilir. Büyük nesneler için genellikle komut satırı araçları kullanılarak düzenleme yapılması veya düzenlemeden önce daha küçük parçalara bölünmesi önerilir. Öte yandan, yeterli belleğiniz varsa veya veri yeterince basitse (sayısal verileri işlemek, faktörlere göre daha kolaydır), düzenleme hiç sorun olmayabilir. Bu uyarıyı Ayarlar → RKWard Uygulamasını Yapılandır → Genel altında yapılandırabilirsiniz (veya tümüyle kapatabilirsiniz). Nesne gerçekten düzenlensin mi?

source: About to edit very large object
ar: على وشك تحرير كائن كبير جدًا
ru: Редактирование очень большого объекта
tr: Çok büyük bir nesneyi düzenlenmek üzere

source: Save Workplace layout
ar: احفظ تخطيط مساحة العمل
ru: Сохранить компоновку рабочей зоны
tr: Çalışma Alanı Yerleşimini Kaydet

source: Restore Workplace layout
ar: استعد تخطيط مساحة العمل
ru: Восстановить компоновку рабочей зоны
tr: Çalışma Alanı Yerleşimini Geri Yükle

source: Close all
ar: أغلق الكل
ru: Закрыть все
tr: Tümünü Kapat

source: Window Left
ar: النافذة اليسرى
ru: Окно слева
tr: Pencere Sola

source: Window Right
ar: النافذة اليمنى
ru: Окно справа
tr: Pencere Sağa

source: Split Ve&rtical
ar: اقسم رأ&سيًّا
ru: Разделить по &вертикали
tr: &Dikey Böl

source: Split the currently active view into two views, vertically.
ar: اقسم العرض النشط حاليًا إلى عرضين، رأسيًا.
ru: Разделить текущую активную область просмотра на две, по вертикали.
tr: Şu anda etkin olan görünümü dikey olarak iki görünüme bölün.

source: Split &Horizontal
ar: اقسم أف&قيًّا
ru: Разделить по &горизонтали
tr: &Yatay Böl

source: Split the currently active view into two views, horizontally.
ar: اقسم العرض النشط حاليًا إلى عرضين، أفقيًا.
ru: Разделить текущую активную область просмотра на две, по горизонтали.
tr: Şu anda etkin olan görünümü yatay olarak iki görünüme bölün.

source: R workspace browser
ar: متصفح مساحة عمل R
ru: Обзор рабочей области R
tr: R Çalışma Alanı Tarayıcısı

source: R Workspace
ar: مساحة عمل R
ru: Рабочая область R
tr: R Çalışma Alanı

source: Edit
ar: حرّر
ru: Изменить
tr: Düzenle

source: View
ar: اعرض
ru: Просмотреть
tr: Görüntüle

source: Copy to new symbol
ar: انسخ إلى رمز جديد
ru: Скопировать в новый символ
tr: Yeni Simgeye Kopyala

source: Copy to .GlobalEnv
ar: انسخ إلى .GlobalEnv
ru: Скопировать в .GlobalEnv
tr: .GlobalEnv e Kopyala

source: New object from clipboard
ar: كائن جديد من الحافظة
ru: Новый объект из буфера обмена
tr: Panodan Yeni Nesne

source: Unload Package
ar: أفرغ الحزمة
ru: Выгрузить пакет
tr: Paketi Çıkar

source: Load / Unload Packages
ar: حمل / أفرغ الحزم
ru: Загрузить или выгрузить пакеты R
tr: Paketleri Yükle/Çıkar

source: Copy object
ar: انسخ الكائن
ru: Скопировать объект
tr: Nesneyi Kopyala

source: Enter the name to copy to
ar: أدخل الاسم للنسخ إليه
ru: Введите имя для копирования
tr: Kopyalanacak adı girin

source: An object named '%1' already exists in the GlobalEnv. Created the copy as '%2' instead.
ar: كائن يحمل اسم '%1' موجود بالفعل في GlobalEnv. جرى إنشاء النسخة كـ '%2' بدلاً من ذلك.
ru: Объект с именем «%1» уже существует в GlobalEnv. Создана копия с именем «%2».
tr: GlobalEnv’de “%1” adlı bir nesne halihazırda var. Bunun yerine “%2” kopyası olarak oluşturuldu.

source: Name already in use
ar: الاسم مستخدم بالفعل
ru: Имя уже используется
tr: Ad Halihazırda Kullanımda

source: Rename object
ar: أعد تسمية الكائن
ru: Переименовать объект
tr: Nesneyi Yeniden Adlandır

source: Enter the new name
ar: أدخل الاسم الجديد
ru: Введите новое имя
tr: Yeni adı girin

source: View in editor (read-only)
ar: اعرض في المحرر (للقراءة فقط)
ru: Просмотреть в редакторе (только чтение)
tr: Düzenleyicide görüntüle (saltokunur)

source: Your workspace contains more than 10.000 top level objects. RKWard is not optimized for this situation, and you may experience lag between R commands. Should this situation constitute a regular use case for your work, please let us know at rkward-devel@kde.org, so we can consider possible solutions.
ru: Рабочая область содержит более 10 000 объектов верхнего уровня. Программа RKWard в таких случаях работает неоптимально, между выполнением команд R могут возникать задержки. Если такое количество объектов обычно действительно нужно при работе с программой, сообщите об этом разработчикам через рассылку rkward-devel@kde.org, чтобы получить консультацию по возможным решениям проблемы.
tr: Çalışma alanınız 10.000’den fazla üst düzey nesne içeriyor. RKWard bu durum için eniyilenmemiştir ve R komutları arasında gecikmeler yaşayabilirsiniz. Bu durumun işiniz için düzenli bir kullanım durumu teşkil etmesi halinde, lütfen rkward-devel@kde.org adresinden bize bildirin, böylece olası çözümleri değerlendirebiliriz.

source: No further import methods are available at this time. Things you can try, include: <ul><li>Check for the availability of additional import plugins</li><li>Save your data to a different format in the original application</li><li>Ask for advice on rkward-users@kde.org</li></ul>
ru: Не осталось никаких других способов импорта. Можно попробовать сделать следующее: <ul><li>проверить, доступны ли дополнительные модули импорта</li><li>сохранить данные в другом формате в исходном приложении</li><li>обратиться за помощью в рассылку rkward-users@kde.org</li></ul>
tr: Şu anda başka bir içe aktarma yöntemi kullanılabilir değil. Deneyebileceğiniz şeyler arasında şunlar bulunur: <ul><li>Ek içe aktarma eklentilerinin kullanılabilirliğini denetle</li><li>Veriyi özgün uygulamada farklı bir biçimde kaydet</li><li>rkward-users@kde.org adresinden tavsiye isteyin</li></ul>

source: Many more people on rkward-devel@kde.org
ru: Многие другие люди в списке рассылки rkward-devel@kde.org
tr: rkward-devel@kde.org posta listesindeki birçok kişi

source: <b>There have been errors and / or warnings. See below for a transcript</b>
tr: <b>Hatalar ve/veya uyarılar oluştu. Yazıdökümü için aşağıya bakın</b>

source: Output:
tr: Çıktı:

source: Errors / Warnings
tr: Hatalar/Uyarılar

source: Errors / Warnings:
tr: Hatalar/Uyarılar:

source: Error opening script file %1
ru: Ошибка открытия файла сценария %1
tr: %1 betik dosyası açılırken hata oluştu
