Repository: KDE/rkward
Catalog: po/*/rkward__plots.po
Languages: ar, eo, ru

source: Slope of shading lines, given as an angle in degrees (counter-clockwise). This option is only available, if shading lines are drawn, as controlled by the density options above.
ar: ميل خطوط التظليل، معطى كزاوية بالدرجات (عكس اتجاه عقارب الساعة). هذا الخيار متاح فقط إذا رُسِمت خطوط تظليل، كما ضُبِطَ بخيارات الكثافة أعلاه.
eo: Deklivo de ombraj linioj, donitaj kiel angulo en gradoj (maldekstrume). Ĉi tiu elekteblo disponeblas nur, se ombraj linioj estas desegnitaj, kiel regas la supre densecaj elektoj.
ru: Наклон линий штриховки, указанный как угол в градусах (против часовой стрелки). Этот параметр доступен только в том случае, если рисуются линии штриховки (в соответствии с указанными выше параметрами плотности).

source: The slope of shading lines can be varied per pie slice. Set this to values other than 0 to get different slopes of shading lines for each slice. This option is only available, if shading lines are drawn, as controlled by the density options above.
ar: يمكن تغيير ميل خطوط التظليل لكل شريحة فطيرة. اضبط هذا على قيم غير 0 للحصول على ميول مختلفة لخطوط التظليل لكل شريحة. هذا الخيار متاح فقط إذا رُسِمت خطوط تظليل، كما ضُبِطَ بخيارات الكثافة أعلاه.
eo: La deklivo de ombraj linioj povas esti variita per torttranĉo. Agordu ĉi tion al valoroj krom 0 por akiri malsamajn deklivojn de ombraj linioj por ĉiu tranĉaĵo. Ĉi tiu elekteblo disponeblas nur, se ombraj linioj estas desegnitaj, kiel regas la supre densecaj elektoj.
ru: Наклон линий штриховки может быть разным для разных секторов круговой диаграммы. Установите отличные от нуля значения, чтобы наклон линий штриховки различался в зависимости от сектора. Этот параметр доступен только в том случае, если рисуются линии штриховки (в соответствии с указанными выше параметрами плотности).

source: Colors
ar: الألوان
eo: Koloroj
ru: Цвета

source: Default (pastel)
ar: مبدئي (باستيل)
eo: Defaŭlta (pastelo)
ru: По умолчанию (пастель)

source: Grayscale
ar: تدرج رمادي
eo: Grizskalo
ru: Оттенки серого

source: Rainbow colors
ar: ألوان قوس قزح
eo: Ĉielarkaj koloroj
ru: Цвета радуги

source: clockwise
ar: مع عقارب السّاعة
eo: dekstrume
ru: по часовой стрелке

source: Radius
ar: نصف القطر
eo: Radiuso
ru: Радиус

source: Shading
ar: التظليل
eo: Volvado
ru: Штриховка

source: density
ar: كثافة
eo: denseco
ru: плотность

source: increment in density
ar: زيادة في الكثافة
eo: pliigo en denseco
ru: приращение плотности

source: angle
ar: الزاوية
eo: angulo
ru: угол

source: increment in angle
ar: زيادة في الزاوية
eo: pliigo en angulo
ru: приращение угла

source: This is an implementation of the standard (traditional S) graphics function <b>plot</b>.
ar: هذا تطبيق لدالة الرسوم القياسية (S التقليدية) <b>plot</b>.
eo: Ĉi tio estas efektivigo de la norma (tradicia S) grafika funkcio <b>grafiko</b>.
ru: Это реализация <b>plot</b>, стандартной функции построения графиков.

source: Choose the X and Y variables and customize the options to draw the plot.
ar: اختر المتغيرات س وص وخصص الخيارات لرسم المخطط.
eo: Elektu la X kaj Y-variablojn kaj agordu la eblojn por desegni la grafikon.
ru: Выберите переменные X и Y и настройте параметры рисования графика.

source: Note: <b>plot</b> is a generic function. The type of plot you will actually get depends on the type of the input variables. For instance, for numeric vectors a scatterplot is produced (see below), while for data.frames as scatterplot matrix is plotted, etc. This is often useful to provide a meaningful visualization of the data, but does not allow for fine grained control.
ar: ملاحظة: <b>plot</b> دالة عامة. نوع الرسم الذي ستحصل عليه فعليًا يعتمد على نوع متغيرات الإدخال. على سبيل المثال، للمتجهات الرقمية يُنتِج مخطط انتشار (انظر أدناه)، بينما لإطارات البيانات يُرسم مصفوفة مخطط انتشار، وما إلى ذلك. هذا مفيد غالبًا لتوفير تصور ذي معنى للبيانات، ولكنه لا يسمح بتحكم دقيق.
eo: Noto: <b>grafiko</b> estas ĝenerala funkcio. La speco de grafiko, kiun vi efektive ricevos, dependas de la tipo de la eniga variabloj. Ekzemple, por nombraj vektoroj oni produktas disvastigon (vidu malsupre), dum por data.frames kiel disvastigmatrico estas grafikita, ktp. Tio ofte estas utila por disponigi signifan bildigon de la datenoj, sed ne permesas fajnan grajnan regon.
ru: Примечание: <b>plot</b> — обобщённая функция. Тип графика, который будет создан, зависит от типа входящих переменных. Например, для числовых векторов будет создан график рассеяния (смотрите ниже), а для data.frame — график матрицы рассеяния, и так далее. Такие диаграммы часто полезны для визуализации данных, но для них не предусмотрены возможности тонкой настройки.

source: This is the <i>x</i> argument. And it is required to draw any plot. In the simplest case of plotting variables of class type integer/numeric, when "Y Variable" is not provided, this is actually the y-coordinate and the indices of the plotting variable is taken as the x-coordinate. See R reference on 'plot' for more details.
ar: هذه هي الوسيط <i>x</i>. وهي مطلوبة لرسم أي مخطط. في أبسط حالة لرسم متغيرات من النوع عدد صحيح/رقمي، عندما لا يُقدَّم "المتغير ص"، يكون هذا في الواقع إحداثي ص وتؤخذ فهارس متغير الرسم كإحداثي س. انظر مرجع R حول 'plot' لمزيد من التفاصيل.
eo: Jen la argumento <i>x</i>. Kaj necesas desegni ajnan grafikon. En la plej simpla kazo de desegnado de variabloj de klasa tipo entjero/numera, kiam "Y Variable" ne estas provizita, tio estas fakte la y-koordinato kaj la indeksoj de la grafika variablo estas prenita kiel la x-koordinato. Vidu R-referencon sur 'grafiko' por pliaj detaloj.
ru: Это аргумент <i>x</i>. Он обязателен для рисования любого графика. В простейшем случае построения графика переменных с типом класса «целое число» / «число», когда «Переменная Y» не указана, это фактически координата y, а индексы переменной для построения считаются координатой x. Дополнительные сведения доступны в справке R по функции «plot».

source: This is the <i>y</i> argument. Note that this is not always needed, and does not have an effect for some types of x variables.
ar: هذه هي الوسيط <i>y</i>. لاحظ أن هذا لا يلزم دائمًا، وليس له تأثير لبعض أنواع المتغيرات س.
eo: Jen la argumento <i>y</i>. Notu, ke tio ne ĉiam bezonas, kaj ne efikas por iuj specoj de x-variabloj.
ru: Это аргумент <i>y</i>. Обратите внимание, что он нужен не всегда и не влияет на некоторые типы переменных x.

source: Further generic plot options. Refer to <link href="rkward://component/plot_options"/> for details. Note that some of these settings may not have an effect, depending on the type of plot actually produced.
ar: خيارات رسم عامة أخرى. ارجع إلى <link href="rkward://component/plot_options"/> للاطلاع على التفاصيل. لاحظ أن بعض هذه الإعدادات قد لا يكون لها تأثير، اعتمادًا على نوع الرسم المُنتَج فعليًا.
eo: Pliaj ĝeneralaj grafiko-elektebloj. Vidu al <link href="rkward://component/plot_options"/> por detaloj. Notu, ke iuj el ĉi tiuj agordoj eble ne efikas, depende de la speco de grafiko efektive produktita.
ru: Другие универсальные параметры графика. Подробнее здесь: <link href="rkward://component/plot_options"/>. Обратите внимание, что некоторые из этих параметров могут ни на что не влиять (зависит от типа создаваемого графика).

source: X variable
ar: المتغير س
eo: X variablo
ru: Переменная X

source: Y variable
ar: المتغير ص
eo: Y-variablo
ru: Переменная Y

source: Unequal number of X and Y variables given
ar: عُدِدَ عدد غير متساوٍ من المتغيرات س و ص
eo: Neegala nombro de X kaj Y variabloj donita
ru: Указано неравное количество переменных X и Y

# R code comment
source: find range of X/Y values needed
ar: ابحث عن نطاق قيم س/ص المطلوبة
eo: trovi gamon de X/Y-valoroj bezonataj
ru: найти диапазон необходимых значений X/Y

source: X variables
ar: المتغيرات س
eo: X variabloj
ru: Переменные X

source: Y variables
ar: المتغيرات ص
eo: Y-variabloj
ru: Переменные Y

source: 'X' variables
ar: المتغيرات 'س'
eo: 'X' variabloj
ru: Переменные «X»

source: 'Y' variables
ar: المتغيرات 'ص'
eo: 'Y' variabloj
ru: Переменные «Y»

source: General plot options
ar: خيارات الرسم العامة
eo: Ĝeneralaj grafiko-opcioj
ru: Общие параметры графика

source: Points / lines
ar: نقاط / خطوط
eo: Punktoj/linioj
ru: Точки/линии

source: Same type for all variables
ar: النوع نفسه لجميع المتغيرات
eo: Sama tipo por ĉiuj variabloj
ru: Один и тот же тип для всех переменных

source: Different for each variable
ar: مختلف لكل متغير
eo: Malsama por ĉiu variablo
ru: Свой тип для каждой переменной

source: Type of all points/lines
ar: نوع جميع النقاط/الخطوط
eo: Tipo de ĉiuj punktoj/linioj
ru: Тип всех точек/линий

source: Plot individual points
ar: ارسم النقاط الفردية
eo: Grafiku individuajn punktojn
ru: Построение отдельных точек

source: Plot lines
ar: ارسم خطوط
eo: Grafiki liniojn
ru: Построение линий

source: Plot points connected by lines (both)
ar: ارسم نقاطًا موصولة بخطوط (كلاهما)
eo: Grafiko punktoj ligitaj per linioj (ambaŭ)
ru: Построение точек, соединённых линиями (и то, и другое)

source: Plot points overlaid by lines
ar: ارسم نقاطًا مُركَّبًا عليها خطوط
eo: Grafiko punktoj supermetitaj per linioj
ru: Построение точек, на которые накладываются линии

source: Plot vertical lines from points to the zero axis (high-density)
ar: ارسم خطوطًا عمودية من النقاط إلى المحور الصفري (كثافة عالية)
eo: Grafiku vertikalajn liniojn de punktoj ĝis la nula akso (altdenseca)
ru: Строить вертикальные линии от точек до нулевой оси (высокая плотность)

source: Step-function plots: the left edge defines the point
ar: رسوم دالة الخطوة: الحافة اليسرى تحدد النقطة
eo: Paŝo-funkciaj grafikoj: la maldekstra rando difinas la punkton
ru: Графики ступенчатых функций: левый край определяет точку

source: Step-function plots: the right edge defines the point
ar: رسوم دالة الخطوة: الحافة اليمنى تحدد النقطة
eo: Paŝo-funkciaj grafikoj: la dekstra rando difinas la punkton
ru: Графики ступенчатых функций: правый край определяет точку

source: Vector of type specifiers
ar: متجه من محددات النوع
eo: Vektoro de tipspecifiloj
ru: Вектор спецификаторов типа

source: Same color for all variables
ar: اللون نفسه لجميع المتغيرات
eo: Sama koloro por ĉiuj variabloj
ru: Один и тот же цвет для всех переменных

source: Enter value - for diff.col. enter a vector -<br/> eg: c(1,2) or c('red','green')
ar: أدخل قيمة - للون المختلف أدخل متجهًا -<br/> مثل: c(1,2) أو c('red','green')
eo: Enigu valoron - por diff.col. enigu vektoron -<br/> ekz.: c(1,2) aŭ c('ruĝa', 'verda')
ru: Введите значение — для diff.col. введите вектор —<br/> пример: c(1,2) или c('red','green')

source: Size
ar: الحجم
eo: Grandeco
ru: Размер

source: Same for all variables
ar: نفس الشيء لجميع المتغيرات
eo: Same por ĉiuj variabloj
ru: Один и тот же для всех переменных

source: A numerical value giving the amount by which plotting text and symbols should be scaled relative to the default.
ar: قيمة رقمية تعطي مقدار تدرج نصوص ورموز الرسم بالنسبة إلى المبدئي.
eo: Nombra valoro donanta la kvanton laŭ kiu grafika teksto kaj simboloj devus esti skalitaj relative al la defaŭlta.
ru: Числовое значение, которое указывает коэффициент масштабирования текста и символов на графике относительно их стандартных размеров.

source: Enter value - for diff.size. enter a vector -
ar: أدخل قيمة - لحجم مختلف أدخل متجهًا -
eo: Enigu valoron - por dif.grandeco. enigu vektoron -
ru: Введите значение — для diff.size. введите вектор —

source: Symbol
ar: الرمز
eo: Simbolo
ru: Символ

source: Either an integer specifying a symbol or a single character to be used as the default in plotting points.
ar: إما عدد صحيح يحدد رمزًا أو حرف واحد لاستخدامه كمبدئي في رسم النقاط.
eo: Aŭ entjero specifanta simbolon aŭ ununuran signon por esti uzata kiel defaŭlta en desegnado de punktoj.
ru: Либо целое число, указывающее символ, либо единственный символ для использования в качестве значения по умолчанию при построении точек.

source: Enter value - for diff.symbol. enter a vector -
ar: أدخل قيمة - لرمز مختلف أدخل متجهًا -
eo: Enigu valoron - por diff.symbol. enigu vektoron -
ru: Введите значение — для diff.symbol. введите вектор —

source: Scatterplot matrix plot produces scatterplot matrices with univariate displays down the diagonal.
ar: رسم مصفوفة مخطط الانتشار يُنتِج مصفوفات مخطط انتشار مع عروض أحادية المتغير على القطر.
eo: Disvastplota matrica grafiko produktas disvastigmatricojn kun unuvariaj ekranoj laŭ la diagonalo.
ru: При построении графика матрицы рассеяния создаётся точечный график с одномерным отображением по диагонали.

source: Choose one or more objects to be plotted. Choose the diagonal plot and how the scatterplots should be plotted from the options tab.
ar: اختر كائنًا واحدًا أو أكثر لترسمه. اختر رسم القطر وكيف يجب رسم مخططات الانتشار من لسان الخيارات.
eo: Elektu unu aŭ plurajn objektojn por esti komplotataj. Elektu la diagonalan grafikon kaj kiel la disvastigojn devus esti grafikitaj de la opciolangeto.
ru: Выберите один или несколько объектов для построения графика. Выберите диагональный график и способ построения графика рассеяния на вкладке параметров.

source: Select a data matrix or a numeric data frame or more than one variables from a data matrix
ar: اختر مصفوفة بيانات أو إطار بيانات رقمي أو أكثر من متغير واحد من مصفوفة بيانات
eo: Elektu datummatricon aŭ nombran datumkadron aŭ pli ol unu variablojn el datummatrico
ru: Выберите матрицу данных, числовой фрейм данных или более одной переменной из матрицы данных

source: Select which plot should be plotted in the diagonal among
ar: اختر أي رسم يجب رسمه في القطر من بين
eo: Elektu kiun grafikon devus esti grafikaĵo en la diagonalo inter
ru: График для построения на диагонали:

source: Density plot. See <link href="rkward://rhelp/density"/>
ar: رسم الكثافة. انظر <link href="rkward://rhelp/density"/>
eo: Densa grafiko. Vidu <link href="rkward://rhelp/density"/>
ru: График плотности. Подробнее: <link href="rkward://rhelp/density"/>

source: Boxplot. See <link href="rkward://rhelp/boxplot"/>
ar: رسم الصندوق. انظر <link href="rkward://rhelp/boxplot"/>
eo: Skatolo. Vidu <link href="rkward://rhelp/boxplot"/>
ru: Коробчатый график. Подробнее: <link href="rkward://rhelp/boxplot"/>

source: Histogram. See <link href="rkward://rhelp/histogram"/>
ar: مخطط بياني تكراري. انظر <link href="rkward://rhelp/histogram"/>
eo: Histogramo. Vidu <link href="rkward://rhelp/histogram"/>
ru: Гистограмма. Подробнее: <link href="rkward://rhelp/histogram"/>

source: QQplot. See <link href="rkward://rhelp/qqplot"/>
ar: رسم QQ. انظر <link href="rkward://rhelp/qqplot"/>
eo: QQplot. Vidu <link href="rkward://rhelp/qqplot"/>
ru: График «квантиль-квантиль». Подробнее: <link href="rkward://rhelp/qqplot"/>

source: No plot. Do not plot anything in the diagonal
ar: لا يوجد رسم. لا ترسم أي شيء في القطر
eo: Neniu grafiko. Ne grafiku ion ajn en la diagonalo
ru: Не рисовать. Не рисовать ничего на диагонали

source: Select it if you want points to be plotted in scatterplots.
ar: اختره إذا أردت رسم نقاط في مخططات الانتشار.
eo: Elektu ĝin se vi volas, ke punktoj estu grafikataj en disaj diagramoj.
ru: Включите этот параметр, если на графиках рассеяния следует рисовать отдельные точки.

source: Select it if you want a lowess smooth to be plotted in scatterplots.
ar: اختره إذا أردت رسم تنعيم لوويسي في مخططات الانتشار.
eo: Elektu ĝin, se vi volas, ke malsupra glata estu grafikaĵo en disaj diagramoj.
ru: Включите этот параметр, если на графиках рассеяния следует рисовать локально взвешенное сглаживание (LOWESS)

source: Select it if you want data-concentration ellipses to be plotted in scatterplots. The ellipses are plotted at levels 0.5 and 0.9.
ar: اختره إذا أردت رسم قطوع ناقصة لتركيز البيانات في مخططات الانتشار. تُرسَم القطوع الناقصة عند مستويات 0.5 و 0.9.
eo: Elektu ĝin se vi volas, ke datumkoncentrigaj elipsoj estu grafikataj en disaj diagramoj. La elipsoj estas punktitaj ĉe niveloj 0.5 kaj 0.9.
ru: Включите этот параметр, если на графиках рассеяния следует рисовать эллипсы концентрации данных. Эллипсы рисуются на уровнях 0,5 и 0,9.

source: Diagonal panels
ar: ألسنة القطر
eo: Diagonalaj paneloj
ru: Диагональные панели

source: Density plot
ar: رسم الكثافة
eo: Densa grafiko
ru: График плотности

source: QQplot
ar: رسم QQ
ru: График «квантиль-квантиль»

source: No plot
ar: لا يوجد رسم
eo: Neniu grafiko
ru: Не рисовать

source: Plot points
ar: ارسم النقاط
eo: Grafiko punktoj
ru: Рисовать точки

source: Plot smooth
ar: ارسم تنعيم
eo: Grafiko glata
ru: Рисовать сглаживание

source: Plot data concentration ellipses
ar: ارسم قطوع ناقصة لتركيز البيانات
eo: Grafiku datumajn koncentriĝajn elipsojn
ru: Рисовать эллипсы концентрации данных

source: This produces a stem-and-leaf plot.
ar: هذا يُنتِج رسم ساق وورقة.
eo: Ĉi tio produktas tigo-kaj-folian grafikon.
ru: Будет создан график «стебель и листья».

source: Choose the data to produce the stem-and-leaf plot. See <link href="rkward://rhelp/stem"/>. For a more sophisticated stem-and-leaf plot refer to the <link href="http://cran.r-project.org/src/contrib/Descriptions/Rcmdr.html">Rcmdr package</link>.
ar: اختر البيانات لإنتاج رسم ساق وورقة. انظر <link href="rkward://rhelp/stem"/>. لرسم ساق وورقة أكثر تعقيدًا، ارجع إلى حزمة <link href="http://cran.r-project.org/src/contrib/Descriptions/Rcmdr.html">Rcmdr</link>.
eo: Elektu la datumojn por produkti la tigo-kaj-folian grafikon. Vidu <link href="rkward://rhelp/stem"/>. Por pli kompleksa tigo-kaj-folio grafiko referu al la <link href="http://cran.r-project.org/src/contrib/Descriptions/Rcmdr.html">Rcmdr-pakaĵo</link>.
ru: Выберите данные для создания графика «стебель и листья». Подробнее здесь: <link href="rkward://rhelp/stem"/>. Для построения более сложного графика «стебель и листья» требуется <link href="http://cran.r-project.org/src/contrib/Descriptions/Rcmdr.html">пакет Rcmdr</link>.

source: Select the data to be computed. The vectors need to be numeric.
ar: اختر البيانات المراد حسابها. يجب أن تكون المتجهات رقمية.
eo: Elektu la datumojn por esti komputitaj. La vektoroj devas esti nombraj.
ru: Выберите данные для вычисления. Векторы должны быть числовыми.

source: This controls the length of the plot. A scale of 2 will make the plot roughly twice as long as the default.
ar: يتحكم هذا في طول الرسم. مقياس 2 سيجعل الرسم أطول مرتين تقريبًا من المبدئي.
eo: Ĉi tio regas la longon de la grafiko. Skalo de 2 faros la grafikon proksimume duoble pli longa ol la defaŭlta.
ru: Этот параметр управляет длиной графика. Масштаб «2» сделает график примерно в два раза длиннее стандартного.

source: This controls the width of the plot.
ar: يتحكم هذا في عرض الرسم.
eo: Ĉi tio kontrolas la larĝon de la grafiko.
ru: Этот параметр управляет шириной графика.

source: This defines the tolerance.
ar: هذا يحدد التسامح.
eo: Ĉi tio difinas la toleremon.
ru: Этот параметр определяет допуск.

source: Stem-and-Leaf Plots
ar: رسوم الساق والورقة
eo: Tigo-kaj-Foliaj Grafikoj
ru: Графики «стебель и листья»

source: Basic settings
ar: الإعدادات الأساسية
eo: Bazaj agordoj
ru: Основные параметры

source: variable:
ar: المتغير:
eo: variablo:
ru: переменная:

source: Plot length (scale)
ar: طول الرسم (مقياس)
eo: Grafikolongo (skalo)
ru: Длина графика (масштаб)

source: Plot width
ar: عرض الرسم
eo: Larĝo de la grafiko
ru: Ширина графика

source: Tolerance
ar: التسامح
eo: Toleremo
ru: Допуск

source: Group
ar: المجموعة
eo: Grupo
ru: Группа

source: variable
ar: المتغير
eo: varianta
ru: переменная

source: Treatment of identical values
ar: معالجة القيم المتطابقة
eo: Traktado de identaj valoroj
ru: Обработка одинаковых значений

source: Overplot
ar: ارسم فوق
eo: Trografiko
ru: Наложение

source: Jitter
ar: التردد
eo: Tremo
ru: Шум

source: Stack
ar: مكدس
eo: Pilo
ru: Стопка

source: Offset
ar: الإزاحة
eo: Deŝovo
ru: Смещение

source: Horizontal
ar: أفقي
eo: Horizontala
ru: Горизонтальная

source: Vertical
ar: عمودي
eo: Vertikala
ru: Вертикальная

# Author name
source: RKWard Team
ar: فريق أر كي وارد
eo: RKWard Teamo
ru: Команда RKWard
