Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: A command in the R backend is trying to change the character encoding. While RKWard offers support for this, and will try to adjust to the new locale, this operation may cause subtle bugs, if data windows are currently open. Also the feature is not well tested, yet, and it may be advisable to save your workspace before proceeding. If you have any data editor opened, or in any doubt, it is recommended to close those first (this will probably be auto-detected in later versions of RKWard). In this case, please choose 'Cancel' now, then close the data windows, save, and retry.
ar: يحاول أمر في الواجهة الخلفية لـ R تغيير ترميز الأحرف. بينما يقدم أر كي وارد الدعم لذلك، وسيحاول التكيف مع اللغة الجديدة، قد تتسبب هذه العملية في أخطاء بسيطة، إذا كانت نوافذ البيانات مفتوحة حاليًا. أيضًا، هذه الميزة لم تُختَبرْ جيدًا بعد، وقد يكون من المستحسن حفظ مساحة عملك قبل المتابعة. إذا كان لديك أي محرر بيانات مفتوح، أو كنت في أي شك، فمن المستحسن إغلاق تلك النوافذ أولاً (من المحتمل أن يجري اكتشاف هذا آليًا في الإصدارات اللاحقة من أر كي وارد). في هذه الحالة، يرجى اختيار 'إلغاء' الآن، ثم إغلاق نوافذ البيانات، والحفظ، وإعادة المحاولة.
ru: Команда в серверном приложении R выполняет попытку изменить кодировку символов. Несмотря на то, что это поддерживается RKWard и программа попытается подстроиться под новую локаль, такая операция может привести к появлению неявных ошибок, если в настоящее время имеются открытые окна с данными. Кроме того, эта возможность ещё недостаточно тщательно протестирована, поэтому перед продолжением рекомендуется сохранить рабочую область. Если открыты какие-либо редакторы данных или имеются сомнения, рекомендуется закрыть соответствующие окна (вероятно, в последующих версиях RKWard будет автоматически проверять наличие таких окон). В этом случае нажмите «Отмена», закройте окна с данными, выполните сохранение и повторите попытку.
tr: R arka ucundaki bir komut karakter kodlamasını değiştirmeye çalışıyor. RKWard bunun için destek sunsa ve yeni yerel ayara uyum sağlamaya çalışsa da, veri pencereleri o anda açıksa bu işlem ince hatalara neden olabilir. Ayrıca özellik henüz iyi bir şekilde sınanmamıştır ve sürdürmeden önce çalışma alanınızı kaydetmeniz önerilebilir. Açık herhangi bir veri düzenleyiciniz varsa veya herhangi bir şüphede kaldıysanız önce bunları kapatmanız önerilir (bu büyük olasılıkla RKWard’ın sonraki sürümlerinde kendiliğinden algılanacaktır). Bu durumda lütfen şimdi “İptal”i seçin, ardından veri pencerelerini kapatın, kaydedin ve yeniden deneyin.

source: Locale change
ar: تغيير اللغة
ru: Изменение локали
tr: Yerel Ayar Değişikliği

source: Changing the locale was canceled by user
ar: أُلغي تغيير اللغة من قبل المستخدم
ru: Изменение локали отменено пользователем
tr: Yerel ayarları değiştirme, kullanıcı tarafından iptal edildi

source: Attempt to start recording, while already recording commands. Ignoring.
ar: محاولة بدء التسجيل، أثناء تسجيل الأوامر بالفعل. تجاهُل.
ru: Попытка начать запись, когда команды уже записываются. Игнорируется.
tr: Komutları kaydederken kaydetmeyi başlatma deneniyor. Yok sayılıyor.

source: Could not open file for writing. Not recording commands
ar: تعذَّر فتح الملف للكتابة. لا نسجل الأوامر
ru: Не удалось открыть файл для записи. Запись команд не ведётся
tr: Dosya, yazmak için açılamadı. Komutlar kaydedilmiyor

source: Error: unrecognized request '%1'
ar: خطأ: طلب غير معرّف '%1'
ru: Ошибка: нераспознанный запрос «%1»
tr: Hata: Tanımlanamayan istek “%1”

source: R backend requests information
ar: الواجهة الخلفية لـ R تطلب معلومات
ru: Серверному приложению R требуется информация
tr: R arka ucu bilgi talep ediyor

source: The R backend will be shut down immediately. This means, you can not use any more functions that rely on it. I.e. you can do hardly anything at all, not even save the workspace (but if you're lucky, R already did that). What you can do, however, is save any open command-files, the output, or copy data out of open data editors. Quit RKWard after that. Sorry!
ar: ستُغلَق الواجهة الخلفية لـ R فورًا. هذا يعني أنك لا تستطيع استخدام أي وظائف أخرى تعتمد عليها. أي، لا يمكنك فعل أي شيء تقريبًا، ولا حتى حفظ مساحة العمل (لكن إذا كنت محظوظًا، فربما R فعل ذلك بالفعل). ومع ذلك، ما يمكنك فعله هو حفظ أي ملفات أوامر مفتوحة، أو الإخراج، أو نسخ البيانات من محررات البيانات المفتوحة. أغلق أر كي وارد بعد ذلك. آسف!
ru: Работа серверного приложения R будет немедленно завершена. Это означает отсутствие возможности использовать зависящие от него функции; вряд ли можно будет сделать хоть что-нибудь, даже сохранить рабочую область (но если повезло, то это уже сделано R). Тем не менее, можно сохранить открытые файлы команд, вывод или скопировать данные из открытых редакторов данных. После сохранения данных выполните выход из RKWard.
tr: R arka ucu hemen kapatılacak. Bu, ona bağlı olan daha fazla işlevi kullanamayacağınız anlamına gelir. Yani neredeyse hiçbir şey yapamazsınız, hatta çalışma alanını bile kurtaramazsınız (ama eğer şanslıysanız R bunu zaten yapmıştır). Yapabileceğiniz tek şey, açık komut dosyalarını/çıktıyı kaydetmek veya açık veri düzenleyicilerden veri kopyalamaktır. Bundan sonra RKWard’dan çıkın. Üzgünüm!

source: R engine has died
ar: محرك R مات
ru: Движок R прекратил работу
tr: R işletkesi öldü

source: Graphics Device Number %1
ar: رقم جهاز الرسوميات %1
ru: Графическое устройство номер %1
tr: Grafik Aygıtı Numarası %1

# Window title
source: %1 (Active)
ar: %1 (نشط)
ru: %1 (активно)
tr: %1 (Etkin)

# Window title
source: %1 (Inactive)
ar: %1 (خامل)
ru: %1 (неактивно)
tr: %1 (Etkin Değil)

source: <h2>Locating point(s)</h2><p>Use left mouse button to select point(s). Any other mouse button to stop.</p>
ar: <h2>تحديد الموقع (المواقع)</h2><p>استخدم زر الفأرة الأيسر لتحديد النقطة (النقاط). أي زر فأرة آخر للتوقف.</p>
ru: <h2>Указание расположения точек</h2><p>Используйте левую кнопку мыши для выбора точек. Выбор можно остановить нажатием любой другой кнопки мыши.</p>
tr: <h2>Noktaları Bulmak</h2><p>Noktayı/noktaları seçmek için farenin sol düğmesini kullanın. Durdurmak için başka bir fare düğmesine basın.</p>

source: <p>Press Enter to see next plot, or click 'Cancel' to abort.</p>
ar: <p>اضغط على مفتاح Enter لرؤية المخطط التالي، أو انقر على 'إلغاء' للإجهاض.</p>
ru: <p>Нажмите клавишу «Ввод» для просмотра следующего графика или кнопку «Отмена» для прерывания.</p>
tr: <p>Sonraki grafiği görmek için “Giriş”e veya iptal etmek için “İptal”e tıklayın.</p>

source: Ok to show next plot?
ar: هل موافق على إظهار المخطط التالي؟
ru: Перейти к показу следующего графика?
tr: Sonraki grafiği gösterelim mi?

source: There has been an error while trying to connect the on-screen graphics backend. This means, on-screen graphics using the RKWard device will not work in this session.
ar: حدث خطأ أثناء محاولة توصيل الواجهة الخلفية للرسوميات على الشاشة. هذا يعني أن الرسوميات على الشاشة باستخدام جهاز أر كي وارد لن تعمل في هذه الجلسة.
ru: При попытке подключения к серверному приложению показа графики на экране произошла ошибка. Это означает, что экранная графика, связанная с использованием устройства RKWard, будет недоступна в этом сеансе.
tr: Ekran grafikleri arka ucuna bağlanmaya çalışırken bir hata oluştu. Bu, RKWard aygıtını kullanan ekran grafiklerinin bu oturumda çalışmayacağı anlamına gelir.

source: Expected connection token %1, but read connection token %2
ar: الرمز المميز للاتصال المتوقع %1، ولكن قُرئ الرمز المميز للاتصال %2
ru: Ожидался маркер подключения %1, но прочитан маркер подключения %2
tr: %1 bağlantı jetonu bekleniyordu; ancak %2 bağlantı jetonu okundu

source: Error while connection graphics backend
ar: خطأ أثناء توصيل الواجهة الخلفية للرسوميات
ru: Ошибка при соединении с серверным приложением для обработки графики
tr: Grafik arka ucuna bağlanırken hata

source: Device type "%1" is unknown to RKWard
ar: نوع الجهاز "%1" غير معروف لدى أر كي وارد

source: rk.download_appimage() requires XiMpLe >= 0.11.3, but only found %1. Please update XiMpLe.
ar: يَتطَلَّب rk.download_appimage() حزمة XiMpLe >= 0.11.3، لكن وُجِدَ %1 فقط. حَدِّث XiMpLe من فضلك.

source: Target directory '%1' does not exist
ar: مُجَلَّد الوجهة '%1' ليس موجودًا

source: Target file '%1' already exists, use the "overwrite" argument to replace it:
ar: ملف الوجهة '%1' موجود بالفعل، اسْتَخدِم الوسيط "overwrite" لِاستبداله:

source: Creating backup of current AppImage: %1
ar: أنشئ نسخة احتياطية من AppImage الحالية: %1

source: Something went wrong with the download! Restored previous AppImage from backup.
ar: حدث خطأ ما أثناء التنزيل! أُعيد AppImage السابق من النسخة الاحتياطية.

source: Something went wrong with the download!
ar: حدث خطأ ما أثناء التنزيل!

source: Download successful, setting file permissions.
ar: التنزيل ناجح، اضبط أذونات الملف.

source: Removing backup of previous AppImage.
ar: أَزِل نسخة AppImage السابقة الاحتياطية.

source: Something went wrong with the download! Restoring previous AppImage from backup.
ar: حدث خطأ ما أثناء التنزيل! أَعِد AppImage السابق من النسخة الاحتياطية.

source: Failed to copy CSS file '%1' to '%2'
ar: فشل في نسخ ملف CSS '%1' إلى '%2'

source: Submenu %1 cannot be redefined as a leaf item.
ar: لا يُمكِن إعادة تعريف القائمة الفرعية %1 كَعنصر ورقي.

source: Menu path %1 is not defined
ar: مسار القائمة %1 غير مُعرَّف

source: Leaf menu item %1 cannot be redefined as a submenu.
ar: لا يُمكِن إعادة تعريف عنصر القائمة الورقي %1 كقائمة فرعية.

source: No file name specified
ar: لم يُحدّد اسم الملفّ

source: Invalid output id. Use rk.output() to obtain a valid output handle.
ar: معرِّف إخراج غير صالح. استخدِم rk.output() للحصول على مُعامِل إخراج صالح.

source: The software <tt>pdflatex</tt> is required for rendering PDF previews. The easiest way to install it is by running <tt>install.packages("tinytex"); library("tinytex"); install_tinytex()</tt>
ar: البرنامج <tt>pdflatex</tt> مطلوب لتصيير معاينات PDF. أسهل طريقة لتركيبه هي بتشغيل <tt>install.packages("tinytex"); library("tinytex"); install_tinytex()</tt>
ru: Для обеспечения предварительного просмотра PDF требуется программа <tt>pdflatex</tt>. Проще всего установить её следующим образом: <tt>install.packages("tinytex"); library("tinytex"); install_tinytex()</tt>
tr: PDF önizlemelerini sunmak için <tt>pdflatex</tt> yazılımı gereklidir. Kurmanın en kolay yolu <tt>install.packages("tinytex"); library("tinytex"); install_tinytex()</tt> komutudur.

source: Rendering the preview failed
ar: فشل تصيير المعاينة
ru: Не удалось обработать данные для выполнения предварительного просмотра
tr: Önizleme sunulamadı

source: <h1>Unsupported format</h1><p>The preview cannot be shown, here, because the output format is neither HTML, nor PDF. You can try opening it in an external application, using the link, below, or you can change the preview mode to 'R Markdown (HTML)'.</p>
ar: <h1>صيغة غير مدعومة</h1><p>لا يمكن عرض المعاينة، هنا، لأن صيغة المخرج ليست HTML، ولا PDF. يمكنك محاولة فتحها في تطبيق خارجي، باستخدام الرابط، أدناه، أو يمكنك تغيير نمط المعاينة إلى 'R Markdown (HTML)'.</p>
ru: <h1>Неподдерживаемый формат</h1><p>Здесь нельзя выполнить предварительный просмотр, так как выходной формат — не HTML и не PDF. Перейдите по ссылке ниже, чтобы открыть файл во внешнем приложении. Также можно изменить режим предварительного просмотра на «R Markdown (HTML)».</p>
tr: <h1>Desteklenmeyen biçim</h1><p>Önizleme burada gösterilemiyor; çünkü çıktı biçimi ne HTML ne de PDF. Aşağıdaki bağlantıyı kullanarak dış bir uygulamada açmayı deneyebilirsiniz veya önizleme kipini “R Markdown (HTML)” olarak değiştirebilirsiniz.</p>

source: Plot window created
ar: أُنشئت نافذة المخطط

source: Plot window closed
ar: أُغلِقت نافذة المخطط

source: Plot updated (click to show)
ar: حُدِّث المخطط (انقر لعرضه)

source: Please install package R2HTML to enable output!
ar: ثَبِّت حزمة R2HTML لتمكين الإخراج من فضلك!

source: Unnamed parameter lists are deprecated in rk.header()
ar: قوائم المَعلمات غير المسماة هي مُهملة في rk.header()

source: Printing object of class '%1' is not implemented
ar: طباعة كائن من الفئة '%1' ليست مُطبَّقة

source: The 'katepart' component could not be loaded. RKWard cannot run without katepart, and will exit, now. Please install katepart, and try again.
ar: تعذَّر تحميل مكون 'katepart'. لا يمكن لـ أر كي وارد العمل بدون katepart، وسيغلق البرنامج الآن. يرجى تثبيت katepart والمحاولة مرة أخرى.
ru: Не удалось загрузить компонент «katepart». RKWard не может работать без katepart, поэтому сейчас будет выполнен выход из программы. Установите katepart и запустите программу снова.
tr: “katepart” bileşeni yüklenemedi. RKWard, katepart olmadan çalışamaz ve şimdi çıkacaktır. Lütfen katepart’ı kurun ve yeniden deneyin.

source: 'katepart' component could not be found
ar: تعذَّر العثور على مكون 'katepart'
ru: Не удалось найти компонент «katepart»
tr: “katepart” Bileşeni Bulunamadı

source: R Console
ar: وحدة تحكم R
ru: Консоль R
tr: R Konsolu

source: Scrollbar minimap
ar: خريطة مصغرة لشريط التمرير
ru: Мини-карта в полосе прокрутки
tr: Sarma Çubuğu Mini Haritası

source: Dynamic word wrap
ar: لفّ الكلمات حركيًّا
ru: Динамический перенос строк
tr: Devingen Sözcük Kaydırma

source: Syntax error
ar: خطأ في الصياغة
ru: Синтаксическая ошибка
tr: Sözdizim hatası

source: Select command history file to load
ar: اختر ملف سجل الأوامر لتحميله
ru: Выбор файла журнала команд для загрузки
tr: Yüklenecek komut geçmişi dosyasını seç

source: R history files [*.Rhistory](*.Rhistory);;All files [*](*)
ar: ملفات سجل R [*.Rhistory](*.Rhistory);;كل الملفات [*](*)
ru: Файлы журнала R [*.Rhistory](*.Rhistory);;Все файлы [*](*)
tr: R geçmiş dosyaları [*.Rhistory](*.Rhistory);;Tüm dosyalar [*](*)

source: Select filename to save command history
ar: اختر اسم الملف لحفظ سجل الأوامر
ru: Выбор файла для сохранения журнала команд
tr: Komut geçmişini kaydetmek için dosya adını seç

source: R history files [*.Rhistory] (*.Rhistory);;All files [*] (*)
ar: ملفات سجل R [*.Rhistory] (*.Rhistory);;كل الملفات [*] (*)
ru: Файлы журнала R [*.Rhistory] (*.Rhistory);;Все файлы [*] (*)
tr: R geçmiş dosyaları [*.Rhistory](*.Rhistory);;Tüm dosyalar [*](*)

source: Interrupt running command
ar: اقطَع الأمر قيد التشغيل
ru: Прервать выполняющуюся команду
tr: Çalışan Komutu Yarıda Kes

source: Copy selection literally
ar: انسَخ التحديد حرفيًا
ru: Скопировать выделенное без обработки
tr: Seçimi Olduğu Gibi Kopyala

source: Copy commands, only
ar: انسَخ الأوامر فقط
ru: Скопировать только команды
tr: Yalnızca Komutları Kopyala

source: Print Console
ar: اطبَع وحدة التحكم
ru: Печать
tr: Konsolu Yazdır

source: Import command history...
ar: استورِد سجل الأوامر...
ru: Импорт журнала команд…
tr: Komut Geçmişi İçe Aktar…

source: Export command history...
ar: صدِّر سجل الأوامر...
ru: Экспорт журнала команд…
tr: Komut Geçmişini Dışa Aktar…

source: You have configured RKWard to pipe script editor commands through the R Console. However, another command is currently active in the console. Do you want to append it to the command in the console, or do you want to reset the console, first? Press cancel if you do not wish to run the new command, now.
ar: لقد ضَبَطتَ أر كي وارد لتمرير أوامر محرر النص البرمجي عبر وحدة تحكم R. ومع ذلك، هناك أمر آخر نشط حاليًا في وحدة التحكم. هل تريد إلحاقه بالأمر في وحدة التحكم، أو هل تريد إعادة ضبط وحدة التحكم أولاً؟ اضغط على إلغاء إذا كنت لا ترغب في تشغيل الأمر الجديد الآن.
ru: Программа RKWard настроена на передачу команд редактора сценариев через консоль R, но в консоли сейчас выполняется другая команда. Добавить команду редактирования к команде в консоли или сначала сбросить содержимое консоли? Нажмите «Отмена», если не нужно выполнять команду редактирования сейчас.
tr: RKWard’ı komut dosyası düzenleyicisi komutlarını R Konsolu aracılığıyla iletecek biçimde yapılandırdınız. Ancak şu anda konsolda başka bir komut etkin. Bunu konsoldaki komuta eklemek mi istiyorsunuz yoksa önce konsolu sıfırlamak mı istiyorsunuz? Yeni komutu şimdi çalıştırmak istemiyorsanız “İptal”e basın.

source: R Console is busy
ar: وحدة تحكم R مشغولة
ru: Консоль R занята
tr: R Konsolu meşgul

source: Append
ar: ألحق
ru: Добавить
tr: İliştir

source: Reset, then submit
ar: أعِد الضبط، ثم أرسِل
ru: Сбросить, затем отправить
tr: Sıfırla ve Gönder

source: &File
ar: &ملف
ru: &Файл
tr: &Dosya

source: &View
ar: &عرض
ru: &Вид
tr: &Görünüm

source: &Run
ar: &شغّل
ru: &Запуск
tr: &Çalıştır

source: <p>You are about to start an RKWard dialog from outside of RKWard, probably by clicking on an 'rkward://'-link, somewhere. In case you have found this link on an external website, please bear in mind that R can be used to run arbitrary commands on your computer, <b>potentially including downloading and installing malicious software</b>. If you do not trust the source of the link you were following, you should press 'Cancel', below.</p><p>In case you click 'Continue', no R code will be run, unless and until you click 'Submit' in the dialog window, and you are encouraged to review the generated R code, before doing so.</p><p><i>Note</i>: Checking 'Do not ask again' will suppress this message for the remainder of this session, only.
ar: <p>أنت على وشك بدء حوار أر كي وارد من خارج أر كي وارد، ربما عن طريق النقر على رابط 'rkward://'، في مكان ما. في حال عثرت على هذا الرابط في موقع ويب خارجي، يرجى أن تضع في اعتبارك أن R يمكن استخدامه لتشغيل أوامر عشوائية على حاسوبك، <b>بما في ذلك احتمال تنزيل وتثبيت برامج ضارة</b>. إذا كنت لا تثق بمصدر الرابط الذي كنت تتابعه، يجب أن تضغط على 'إلغاء'، أدناه.</p><p>في حال نقرت على 'متابعة'، فلن يجري تشغيل أي شيفرة R، إلا إذا نقرت على 'إرسال' في نافذة الحوار، ويشجعك البرنامج على مراجعة شيفرة R المولّدة، قبل القيام بذلك.</p><p><i>ملاحظة</i>: تحديد 'لا تسأل مرة أخرى' سيكبت هذه الرسالة لبقية هذه الجلسة فقط.
ru: <p>Диалоговое окно RKWard будет открыто вне RKWard (вероятно, где-то была нажата ссылка «rkward://»). Если эта ссылка находится на внешнем веб-сайте, учтите, что с помощью R можно запускать на компьютере произвольные команды; <b>это подразумевает возможность загрузки и установки вредоносного программного обеспечения</b>. Если источник ссылки не вызывает доверия, следует нажать расположенную ниже кнопку «Отмена».</p><p>Если нажать «Продолжить», то код R будет выполнен только после нажатия «Отправить» в диалоговом окне (перед этим будет предложено просмотреть сгенерированный код R).</p><p><i>Примечание</i>: установка флажка «Больше не спрашивать» приведёт к подавлению этого сообщения только до конца текущего сеанса.
tr: <p>Büyük olasılıkla bir yerlerdeki “rkward://” bağlantısına tıklayarak RKWard’ın dışından bir RKWard iletişim kutusu başlatmak üzeresiniz. Bu bağlantıyı dış bir web sitesinde bulmanız durumunda, R’nin bilgisayarınızda <b>kötü amaçlı yazılımların indirilmesi ve kurulması da dahil olmak üzere</b> rastgele komutlar çalıştırmak için kullanılabileceğini lütfen unutmayın. Takip ettiğiniz bağlantının kaynağına güvenmiyorsanız aşağıdaki “İptal”e basmalısınız.</p><p>“Sürdür”e tıklatmanız durumunda, iletişim penceresinde “Gönder”e tıklamadığınız sürece hiçbir R kodu çalıştırılmayacaktır ve bunu yapmadan önce oluşturulan R kodunu incelemeniz önerilir.</p><p><i>Not</i>: “Bir daha sorma” seçeneğinin işaretlenmesi bu iletinin yalnızca bu oturumun geri kalanı boyunca gizlenmesine neden olacaktır.

source: A note on external links
ar: ملاحظة حول الروابط الخارجية
ru: Примечание о внешних ссылках
tr: Dış Bağlantılar Üzerine

source: Setting up plugins...
ar: جاري إعداد الملحقات...
ru: Настройка модулей…
tr: Eklentiler ayarlanıyor…

source: New RKWard plugin packs (listed below) have been found, and have been activated, automatically. To de-activate selected plugin packs, use Settings->Configure RKWard->Plugins.
ar: عُثر على حزم ملحقات أر كي وارد جديدة (المدرجة أدناه)، وجرى تفعيلها آليًا. لإلغاء تفعيل حزم ملحقات محددة، استخدم إعدادات->اضبط أر كي وارد->ملحقات.
ru: Найдены и автоматически активированы новые пакеты модулей RKWard (список приведён ниже). Чтобы отключить выбранные пакеты модулей, воспользуйтесь пунктом меню «Настройка -> Настроить RKWard -> Модули».
tr: Yeni RKWard eklenti paketleri (aşağıda listelenmiştir) kendiliğinden bulundu ve etkinleştirildi. Seçili eklenti paketlerini devre dışı bırakmak için “Ayarlar → RKWard Uygulamasını Yapılandır → Eklentiler”i kullanın.

source: New plugins found
ar: عُثر على ملحقات جديدة
ru: Найдены новые модули
tr: Yeni Eklentiler Bulundu

source: The following RKWard pluginmap files could not be loaded, and have been disabled. This could be because they are broken, not compatible with this version of RKWard, or not meant for direct loading (see the 'Details' for more information). They have been disabled.
ar: تعذَّر تحميل ملفات خريطة ملحقات أر كي وارد التالية، وجرى تعطيلها. قد يكون هذا لأنها معطوبة، أو غير متوافقة مع هذا الإصدار من أر كي وارد، أو لم يُقصَد تحميلها مباشرة (راجع 'التفاصيل' لمزيد من المعلومات). جرى تعطيلها.
ru: Не удалось загрузить следующие файлы карт модулей RKWard; они могут быть повреждены, несовместимы с этой версией RKWard или не предназначаться для прямой загрузки (просмотрите «Подробности», чтобы получить больше информации). Соответствующие карты модулей были отключены.
tr: Aşağıdaki RKWard eklenti eşlemi dosyaları yüklenemedi ve devre dışı bırakıldı. Bunun nedeni bunların bozuk olması, RKWard’ın bu sürümüyle uyumlu olmaması veya doğrudan yükleme amaçlı olmaması olabilir (daha fazla bilgi için “Ayrıntılar”a bakın). Engellenmiş olabilirler.

source: Failed to load some plugin maps
ar: فشل في تحميل بعض خرائط الملحقات
ru: Не удалось загрузить некоторые карты модулей
tr: Bazı Eklenti Eşlemleri Yüklenemedi

source: Some errors were encountered while loading the following RKWard pluginmap files. This could be because individual plugins are broken or not compatible with this version of RKWard (see the 'Details' for more information). Other plugins were loaded, successfully, however.
ar: صودفت بعض الأخطاء أثناء تحميل ملفات خريطة ملحقات أر كي وارد التالية. قد يكون هذا بسبب أن الملحقات الفردية معطوبة أو غير متوافقة مع هذا الإصدار من أر كي وارد (راجع 'التفاصيل' لمزيد من المعلومات). ومع ذلك، حُمِّلت ملحقات أخرى بنجاح.
ru: При загрузке следующих файлов карт модулей RKWard произошли ошибки; отдельные модули могут быть повреждены или несовместимы с этой версией RKWard (просмотрите «Подробности», чтобы получить больше информации). Остальные модули были успешно загружены.
tr: Aşağıdaki RKWard eklenti eşlemi dosyaları yüklenirken bazı hatalarla karşılaşıldı. Bunun nedeni bireysel eklentilerin bozuk olması veya RKWard’ın bu sürümüyle uyumlu olmaması olabilir (daha fazla bilgi için “Ayrıntılar”a bakın). Ancak diğer eklentiler başarıyla yüklendi.

source: Note: You will not be warned about these pluginmap files again, until you upgrade RKWard, or remove and re-add them in Settings->Configure RKWard->Plugins.
ar: ملاحظة: لن يجري تحذيرك بشأن ملفات خريطة الملحقات هذه مرة أخرى، حتى ترقّي أر كي وارد، أو تُزيلها وتعيد إضافتها في إعدادات->اضبط أر كي وارد->ملحقات.
ru: Примечание: предупреждение об этих файлах карт модулей появится снова только в том случае, если будет выполнено обновление RKWard или удаление и повторное добавление этих карт («Настройка -> Настроить RKWard -> Модули»).
tr: Not: RKWard’ı yükseltene veya Ayarlar → RKWard Uygulamasını Yapılandır → Eklentiler bölümünden kaldırıp yeniden ekleyene kadar bu eklenti eşlemi dosyaları hakkında bir daha uyarılmayacaksınız.

source: Carbon Copy Settings
ar: إعدادات نسخة كربونية
ru: Параметры копирования
tr: Karbon Kopya Ayarları

source: Workspace
ar: مساحة العمل
ru: Рабочая область
tr: Çalışma Alanı

source: Files
ar: الملفات
ru: Обзор файловой системы
tr: Dosyalar

source: Pending Jobs
ar: مهامّ مرجأة
ru: Задания в очереди
tr: Bekleyen İşler

source: Debugger Frames
ar: إطارات المُصحّح
ru: Фреймы отладчика
tr: Hata Ayıklayıcısı Çerçeveleri

source: Debugger Console
ar: وحدة تحكم المُصحّح
ru: Консоль отладчика
tr: Hata Ayıklayıcısı Konsolu

source: RKWard Debug Messages
ar: رسائل تصحيح أر كي وارد
ru: Сообщения отладки RKWard
tr: RKWard Hata Ayıklama İletileri
