Repository: KDE/rkward
Catalog: po/*/rkward__plots.po
Languages: ar, eo, ru

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Oliver Kellogg
ru: Олеся Герасименко

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: olivermkellogg@gmail.com
ru: translation-team@basealt.ru

source: Plots
ar: الرسوم البيانية
eo: Grafikoj
ru: Графики

source: Plugins for producing various plots. Part of the official RKWard distribution
ar: ملحقات لإنشاء مخططات متنوعة. جزء من توزيعة أر كي وارد الرسمية
eo: Kromaĵoj por produkti diversajn grafikojn. Parto de la oficiala RKWard-distribuo
ru: Модули для создания различных графиков. Часть официального дистрибутива RKWard

source: Barplot
ar: مخطط الأعمدة
eo: Barploto
ru: Столбчатый график

source: Box Plot
ar: مخطط الصندوق
eo: Skatola diagramo
ru: Коробчатый график

source: Density Plot
ar: مخطط الكثافة
eo: Densa Grafiko
ru: График плотности

source: Dotchart
ar: مخطط النقط
ru: Точечная диаграмма

source: ECDF Plot
ar: مخطط ECDF
eo: ECDF Grafiko
ru: График эмпирической кумулятивной функции распределения

source: Generic Plot
ar: مخطط عام
eo: Ĝenerala Grafiko
ru: Типовой график

source: Histogram
ar: مدرج تكراري
eo: Histogramo
ru: Гистограмма

source: Pareto Chart
ar: مخطط باريتو
eo: Pareto-diagramo
ru: Диаграмма Парето

source: Piechart
ar: مخطط دائري
ru: Круговая диаграмма

source: Scatterplot
ar: مخطط الانتشار
eo: Disvastigilo
ru: График рассеяния

source: Scatterplot Matrix
ar: مصفوفة مخططات الانتشار
eo: Matrico de disvastigoj
ru: Матрица рассеяния

source: Stem-and-Leaf Plot
ar: مخطط الساق والورقة
eo: Tigo-kaj-Folia Grafiko
ru: График «стебель и листья»

source: Stripchart
ar: مخطط الشريط
eo: Striodiagramo
ru: Ленточная диаграмма

source: Variable
ar: متغير
eo: Variablo
ru: Переменная

# R code comment
source: barplot is a bit picky about attributes, so we need to convert to vector or matrix explicitly
ar: مخطط الأعمدة انتقائي قليلاً بشأن السمات، لذا نحتاج إلى التحويل إلى متجه أو مصفوفة صراحةً
eo: barplot estas iom elektema pri atributoj, do ni devas eksplicite konverti al vektoro aŭ matrico
ru: Функция barplot довольно требовательна к атрибутам, поэтому будет необходимо преобразовать данные в вектор или матрицу явным образом

source: Creates a bar plot with vertical bars.
ar: يُنشئ مخطط أعمدة ذات أشرطة رأسية.
eo: Kreas bargrafiko kun vertikalaj stangoj.
ru: Создаёт столбчатый график с вертикальными столбцами.

source: Choose a matrix, vector or a factor to be plotted. Further options are available on the second tab.
ar: اختر مصفوفة، أو متجهًا، أو عاملاً (factor) لترسمه. تتوفر خيارات إضافية في الألسنة الأخرى.
eo: Elektu matricon, vektoron aŭ faktoron por esti grafika. Pliaj ebloj haveblas sur la dua langeto.
ru: Выберите матрицу, вектор или фактор для построения графика. На второй вкладке доступны другие параметры.

source: If your data needs to be tabulated / aggregated before plotting, check this option. Refer to <link href="rkward://component/one_var_tabulation"/> for details on the dependent options.
ar: إذا احتاجت بياناتك إلى جدولة / تجميع قبل الرسم، حدّد هذا الخيار. ارجع إلى <link href="rkward://component/one_var_tabulation"/> لمعرفة التفاصيل حول الخيارات التابعة.
eo: Se viaj datumoj devas esti entabeligitaj/agregitaj antaŭ komploto, marku ĉi tiun elekteblon. Vidu al <link href="rkward://component/one_var_tabulation"/> por detaloj pri la dependaj elektebloj.
ru: Установите этот флажок, если перед построением графика требуется табулировать или агрегировать данные. Подробные сведения о зависимых параметрах: <link href="rkward://component/one_var_tabulation"/>.

source: If your data is already suitable for plotting, directly, specify it here. Otherwise, leave this empty, and check the "Tabulate" option, above.
ar: إذا كانت بياناتك مناسبة للرسم مباشرةً، عَيّنها هنا. وإلا، اترك هذا فارغًا، وحدّد خيار "الجدولة" في الأعلى.
eo: Se viaj datumoj jam taŭgas por grafikaĵo, rekte specifu ĝin ĉi tie. Alie, lasu ĉi tion malplena, kaj marku la elekteblon "Tabulado", supre.
ru: Если данные уже подходят для непосредственного построения графика, укажите это здесь. Если это не так, ничего не указывайте и установите выше флажок «Табулировать».

source: If there are very many categories in your data, it may make sense to limit the amount of categories that will be displayed. Check this, if you want to set a limit. See Refer to <link href="rkward://component/limit_vector_length"/> for details on the dependent options.
ar: إذا كان هناك الكثير من الفئات في بياناتك، فقد يكون من المنطقي تحديد كمية الفئات التي ستُعرض. حدّد هذا إذا أردت تعيين حد. انظر <link href="rkward://component/limit_vector_length"/> لمعرفة التفاصيل حول الخيارات التابعة.
eo: Se estas tre multaj kategorioj en viaj datumoj, eble havas sencon limigi la kvanton de kategorioj kiuj estos montrataj. Marku ĉi tion, se vi volas agordi limon. Vidu Riferu al <link href="rkward://component/limit_vector_length"/> por detaloj pri la dependaj elektebloj.
ru: Если в данных очень много категорий, стоит ограничить количество категорий, которые будут показаны. Установите этот флажок, чтобы задать ограничение. Подробные сведения о зависимых параметрах: <link href="rkward://component/limit_vector_length"/>.

source: Method for assigning labels to the plot. "default" means, the labels are chosen automatically. If no labels are available, this will generally print the values. The other options allow you to specify the labels as literal string, or as an R statement (e.g. if the names are stored in a different variable in the workspace).
ar: طريقة لتعيين لصائق للمخطط. "مبدئي" يعني أن اللصائق تُختار آليًا. إذا لم تتوفر لصائق، فستطبع هذه العملية القيم بشكل عام. تسمح لك الخيارات الأخرى بتعيين اللصائق كسلسلة نصية حرفية، أو كعبارة R (مثل إذا كانت الأسماء مخزنة في متغير مختلف ضمن مساحة العمل).
eo: Metodo por atribui etikedojn al la grafiko. "defaŭlte" signifas, ke la etikedoj estas elektitaj aŭtomate. Se neniuj etikedoj estas haveblaj, ĉi tio ĝenerale presas la valorojn. La aliaj elektebloj permesas al vi specifi la etikedojn kiel laŭvortan ĉenon, aŭ kiel R-deklaron (ekz. se la nomoj estas konservitaj en malsama variablo en la laborspaco).
ru: Способ нанесения подписей на график. Значение «по умолчанию» означает, что подписи будут выбираться автоматически. Если доступных подписей нет, то обычно будут выводиться значения. Другие параметры позволяют использовать в качестве подписей текстовые строки или инструкции R (например, если названия хранятся в другой переменной рабочей области).

source: Since these settings are reused in further plugins, they are documented on a page of their own: See <link href="rkward://component/barplot_embed"/>.
ar: بما أن هذه الإعدادات يُعاد استخدامها في ملحقات أخرى، فهي موضَّحة في صفحة خاصة بها: انظر <link href="rkward://component/barplot_embed"/>.
eo: Ĉar ĉi tiuj agordoj estas reuzataj en pliaj kromprogramoj, ili estas dokumentitaj sur propra paĝo: Vidu <link href="rkward://component/barplot_embed"/>.
ru: Так как эти параметры используются в других модулях, для их описания предусмотрена отдельная страница документации: <link href="rkward://component/barplot_embed"/>.

source: Variables
ar: المتغيّرات
eo: Variabloj
ru: Переменные

source: Matrix, Vector or Factor
ar: مصفوفة، أو متجه، أو عامل
eo: Matrico, Vektoro aŭ Faktoro
ru: Матрица, вектор или фактор

source: - or -
ar: - أو -
eo: - aŭ -
ru: - или -

source: Tabulate data before plotting
ar: جَدْوِل البيانات قبل الرسم
eo: Tabelu datumojn antaŭ grafiko
ru: Табулировать данные перед построением графика

source: Tabulation Options
ar: خيارات الجدولة
eo: Tabulado-Ebloj
ru: Параметры табулирования

source: Limit
ar: الحد
eo: Limo
ru: Ограничение

source: Limit number of groups
ar: حَدِّد عدد المجموعات
eo: Limigu nombron da grupoj
ru: Ограничить количество групп

source: Limit Categories
ar: حَدِّد الفئات
eo: Limigi Kategoriojn
ru: Ограничение категорий

source: Bar labels
ar: لصائق الشريط
eo: Bret-etikedoj
ru: Подписи столбцов

source: Default labels
ar: اللصائق المبدئية
eo: Defaŭltaj etikedoj
ru: Стандартные подписи

source: Custom labels
ar: لصائق مخصصة
eo: Propraj etikedoj
ru: Пользовательские подписи

source: From R expression
ar: من تعبير R
eo: El R-esprimo
ru: Из выражения R

source: Expression to use for labels
ar: التعبير الواجِب استخدامه للَّصائق
eo: Esprimo por uzi por etikedoj
ru: Выражение для создания подписей

source: Labels (separated by ';')
ar: اللصائق (افصِل بينها بـ '؛')
eo: Etikedoj (apartitaj per ';')
ru: Подписи (разделённые «;»)

source: Options
ar: خيارات
eo: Elektebloj
ru: Параметры

source: Barplot Options
ar: خيارات مخطط الأعمدة
eo: Barplot Opcioj
ru: Параметры столбчатого графика

# R code comment
source: split sample by grouping variables
ar: اقسم العينة بمتغيرات التجميع
eo: dividi specimenon grupigante variablojn
ru: разделить выборку переменными группировки

# R code comment
source: adjust width and position of boxes to achieve dodging
ar: اضبط عرض وموضع الصناديق لتحقيق التجنب
eo: ĝustigu larĝon kaj pozicion de skatoloj por atingi eviti
ru: скорректировать ширину и позицию коробок для достижения уклонения

# R code comment
source: convert single sample variables to list
ar: حَوِّل متغيرات العينة الواحدة إلى قائمة
eo: konverti ununurajn specimenajn variablojn al listo
ru: преобразовывать единственные переменные выборки в список

source: Boxplot
ar: مخطط الصندوق
eo: Skatolo
ru: Коробчатый график

source: Outcome variable
ar: متغير النتيجة
eo: Rezulta variablo
ru: Выходная переменная

source: Grouping variable(s)
ar: متغير (متغيرات) التجميع
eo: Grupigvariablo(j)
ru: Переменные группировки

source: Variable(s)
ar: المتغير (المتغيرات)
eo: Variablo(j)
ru: Переменные

# R code comment
source: actual boxplot function
ar: دالة مخطط الصندوق الفعلية
eo: reala kestplotfunkcio
ru: сама функция построения коробчатого графика

# R code comment
source: Calculate geometric mean
ar: احسب المتوسط الهندسي
eo: Kalkuli geometrian meznombrecon
ru: Рассчитать геометрическое среднее

# R code comment
source: Calculate harmonic mean
ar: احسب المتوسط التوافقي
eo: Kalkuli harmonian meznombrecon
ru: Рассчитать гармоническое среднее

# R code comment
source: Calculate the interquartile mean
ar: احسب متوسط المدى الربيعي
eo: Kalkulu la interkvartila meznombro
ru: Рассчитать межквартильное среднее

# R code comment
source: calculates the mean for all data and adds a point at the corresponding position
ar: يحسب المتوسط لكل البيانات ويُضِف نقطة في الموضع المطابق
eo: kalkulas la meznombre por ĉiuj datumoj kaj aldonas punkton ĉe la responda pozicio
ru: рассчитывает среднее для всех данных и добавляет точку в соответствующей позиции

source: Creates a box plot of one or more variables.
ar: يُنشئ مخطط صندوق لمتغير واحد أو أكثر.
eo: Kreas skatolon de unu aŭ pluraj variabloj.
ru: Создаёт коробчатый график для одной или нескольких переменных.

source: Choose numerical data to be plotted. Data can be organized in separate vectors, or in a single outcome variable and one or more grouping variables.
ar: اختر البيانات العددية لترسمها. نظِّم البيانات في متجهات منفصلة، أو في متغير نتيجة واحد ومتغير تجميع واحد أو أكثر.
eo: Elektu nombrajn datumojn por esti grafikaj. Datenoj povas esti organizitaj en apartaj vektoroj, aŭ en ununura rezultvariablo kaj unu aŭ pluraj grupaj variabloj.
ru: Выберите числовые данные для построения графика. Данные могут быть организованы как отдельные векторы или единственная выходная переменная и одна или несколько переменных группировки.

source: Select the format of your data. This can either be separate numerical vectors, or a single outcome variable split by one or more grouping variables.
ar: اختر تنسيق بياناتك. يمكن أن يكون هذا إما متجهات عددية منفصلة، أو متغير نتيجة واحد مقسومًا على متغير تجميع واحد أو أكثر.
eo: Elektu la formaton de viaj datumoj. Ĉi tio povas aŭ esti apartaj nombraj vektoroj, aŭ ununura rezulta variablo dividita per unu aŭ pluraj grupaj variabloj.
ru: Выберите формат данных. Это могут быть либо отдельные числовые векторы, либо единственная выходная переменная, разделённая одной или несколькими переменными группировки.

source: For separate variables mode: Select one or more numerical vectors.
ar: لنمط المتغيرات المنفصلة: اختر متجهًا عدديًا واحدًا أو أكثر.
eo: Por apartaj variabloreĝimo: Elektu unu aŭ plurajn nombrajn vektorojn.
ru: Для режима отдельных переменных: выберите один или несколько числовых векторов.

source: For single(grouped) variable mode: Select one numerical vector as the outcome variable.
ar: لنمط المتغير الواحد (المجمَّع): اختر متجهًا عدديًا واحدًا كمتغير نتيجة.
eo: Por ununura (grupigita) varia reĝimo: Elektu unu nombran vektoron kiel rezultan variablon.
ru: Для режима единственной (группированной) переменной: выберите один числовой вектор как выходную переменную.

source: For single(grouped) variable mode: Select one or more vectors by which to group the outcome variable. Group variables should have the same length as the outcome variable.
ar: لنمط المتغير الواحد (المجمَّع): اختر متجهًا واحدًا أو أكثر لتجميع متغير النتيجة بواسطته. يجب أن يكون لمتغيرات التجميع نفس طول متغير النتيجة.
eo: Por ununura (grupigita) varia reĝimo: Elektu unu aŭ plurajn vektorojn per kiuj grupigi la rezultan variablon. Grupvariabloj devus havi la saman longon kiel la rezultvariablo.
ru: Для режима единственной (группированной) переменной: выберите один или несколько векторов для группировки выходной переменной. Групповые переменные должны иметь ту же длину, что и выходная переменная.

source: For single(grouped) variable mode: Dodging boxes within one or more groups can be a nice option when the outcome is split by several group variables. This allows you to select, across how many group variables, boxes should be dodged ("0" for no dodging, "1" to dodge only the first group variable).
ar: لنمط المتغير الواحد (المجمَّع): قد يكون تجنّب الصناديق ضمن مجموعة واحدة أو أكثر خيارًا جيدًا عندما يُقسَم متغير النتيجة بواسطة عدة متغيرات تجميع. يسمح هذا لك بالاختيار، عبر كم عدد متغيرات التجميع، يجب تجنّب الصناديق ("0" لعدم التجنّب، "1" لتجنّب متغير التجميع الأول فقط).
eo: Por unuopa (grupigita) varia reĝimo: Eviti skatolojn ene de unu aŭ pluraj grupoj povas esti bela opcio kiam la rezulto estas dividita de pluraj grupaj variabloj. Ĉi tio ebligas al vi elekti, laŭ kiom da grupvariabloj, skatoloj estu evititaj ("0" por neniu evitado, "1" por eviti nur la unuan grupvariablon).
ru: Для режима единственной (группированной) переменной: возможность уклонения коробок внутри одной или нескольких групп может оказаться полезной, когда результат разделён несколькими групповыми переменными. Этот параметр позволяет выбрать количество групповых переменных, от которых будут уклоняться коробки («0» — без уклонения, «1» — уклонение только от первой групповой переменной).

source: Allows to change the width of the boxes, relative to the entire plot.
ar: يسمح بتغيير عرض الصناديق، بالنسبة إلى المخطط بالكامل.
eo: Permesas ŝanĝi la larĝon de la skatoloj, relative al la tuta grafiko.
ru: Позволяет изменять ширину коробок относительно всего графика.

source: Orientation of the plot: horizontal or vertical.
ar: اتجاه المخطط: أفقي أو رأسي.
eo: Orientiĝo de la grafiko: horizontala aŭ vertikala.
ru: Ориентация графика: горизонтальная или вертикальная.

source: Whether to draw notches
ar: هل تَرغب في رسم الثلمات
eo: Ĉu desegni noĉojn
ru: Следует ли рисовать засечки

source: Whether to draw outliers (if any). Outliers are draw as dots, if this option is checked.
ar: هل تَرغب في رسم القيم الشاذة (إن وجدت). القيم الشاذة تُرسم كنقاط إذا حدّدت هذا الخيار.
eo: Ĉu desegni eksteraĵojn (se ekzistas). Outliers estas desegnataj kiel punktoj, se ĉi tiu elekteblo estas markita.
ru: Следует ли рисовать выбросы (если имеются). Выбросы рисуются как точки, если этот флажок установлен.

source: Whether to draw a mark indicating the mean.
ar: هل تَرغب في رسم علامة تشير إلى المتوسط.
eo: Ĉu desegni markon indikantan la meznombre.
ru: Следует ли рисовать отметку, обозначающую среднее.

source: Trim applies only to the arithmetic mean. By default trim is set to zero. It defines the fraction of observations to be trimmed from each end of a variable before the arithmetic mean is computed.
ar: التشذيب ينطبق فقط على المتوسط الحسابي. يُضبط التشذيب على الصفر مبدئيًا. يحدد الجزء من الملاحظات التي يجب تشذيبها من كل طرف من متغير قبل حساب المتوسط الحسابي.
eo: Trim validas nur por la aritmetika meznombro. Defaŭlte tajlado estas agordita al nulo. Ĝi difinas la frakcion de observaĵoj por esti tajlita de ĉiu fino de variablo antaŭ ol la aritmetika meznombro estas komputita.
ru: Обрезка применяется только к арифметическому среднему. По умолчанию она равна нулю. Этот параметр определяет долю наблюдений, которые будут обрезаны по краям диапазона переменной перед вычислением арифметического среднего.

source: If the mean is to be indicated: Symbol to use as mark.
ar: إذا أردت الإشارة إلى المتوسط: الرمز الواجِب استخدامه كعلامة.
eo: Se la meznombro estas indikita: Simbolo por uzi kiel markon.
ru: Если будет обозначено среднее: символ для использования в качестве отметки.

source: Use this option to select a specific type of mean. The arithmetic mean is the default. Others include the geometric mean, the harmonic mean and interquartile mean (IQM).
ar: استخدم هذا الخيار لاختيار نوع محدد من المتوسط. المتوسط الحسابي هو المبدئي. تشمل الأنواع الأخرى المتوسط الهندسي، والمتوسط التوافقي، ومتوسط المدى الربيعي (IQM).
eo: Uzu ĉi tiun opcion por elekti specifan tipon de meznombro. La aritmetika meznombro estas la defaŭlta. Aliaj inkludas la geometrian meznombrecon, la harmonian meznombrecon kaj interkvartilan meznombrecon (IQM).
ru: Этот параметр позволяет выбрать определённый тип среднего. По умолчанию используется арифметическое среднее. Среди других вариантов: геометрическое среднее, гармоническое среднее и межквартильное среднее.

source: Whether to draw a mark indicating the standard deviation.
ar: هل تَرغب في رسم علامة تشير إلى الانحراف المعياري.
eo: Ĉu desegni markon indikantan la norman devion.
ru: Следует ли рисовать отметку, обозначающую стандартное отклонение.

source: If the standard deviation is to be indicated: Symbol to use as mark for the upper sd.
ar: إذا أردت الإشارة إلى الانحراف المعياري: الرمز الواجِب استخدامه كعلامة للانحراف المعياري العلوي.
eo: Se la norma devio estas indikita: Simbolo por uzi kiel markon por la supra sd.
ru: Если будет обозначено стандартное отклонение: символ для использования в качестве отметки верхнего предела.

source: If the standard deviation is to be indicated: Symbol to use as mark for the lower sd.
ar: إذا أردت الإشارة إلى الانحراف المعياري: الرمز الواجِب استخدامه كعلامة للانحراف المعياري السفلي.
eo: Se la norma devio estas indikita: Simbolo por uzi kiel markon por la malsupra sd.
ru: Если будет обозначено стандартное отклонение: символ для использования в качестве отметки нижнего предела.

source: Size of mean / sd indicators. This option is only available, if at least one of mean or sd are to be drawn.
ar: حجم مؤشرات المتوسط/الانحراف المعياري. اجعل هذا الخيار متوفرًا فقط إذا رُسِمَ المتوسط أو الانحراف المعياري على الأقل.
eo: Grandeco de mezumo/sd-indikiloj. Ĉi tiu elekteblo disponeblas nur, se almenaŭ unu el meznombro aŭ sd estas desegnita.
ru: Размер отметок среднего и стандартного отклонения. Этот параметр доступен только в том случае, если будет нарисовано хотя бы одно из двух.

source: Color of mean / sd indicators. This option is only available, if at least one of mean or sd are to be drawn.
ar: لون مؤشرات المتوسط/الانحراف المعياري. اجعل هذا الخيار متوفرًا فقط إذا رُسِمَ المتوسط أو الانحراف المعياري على الأقل.
eo: Koloro de mezumo/sd-indikiloj. Ĉi tiu elekteblo disponeblas nur, se almenaŭ unu el meznombro aŭ sd estas desegnita.
ru: Цвет отметок среднего и стандартного отклонения. Этот параметр доступен только в том случае, если будет нарисовано хотя бы одно из двух.

source: General plot Options
ar: خيارات المخطط العامة
eo: Ĝeneralaj grafiko Opcioj
ru: Общие параметры графика

source: Since these settings are reused in further plugins, they are documented on a page of their own: See <link href="rkward://component/plot_options"/>.
ar: بما أن هذه الإعدادات يُعاد استخدامها في ملحقات أخرى، فهي موضَّحة في صفحة خاصة بها: انظر <link href="rkward://component/plot_options"/>.
eo: Ĉar ĉi tiuj agordoj estas reuzataj en pliaj kromprogramoj, ili estas dokumentitaj sur propra paĝo: Vidu <link href="rkward://component/plot_options"/>.
ru: Так как эти параметры используются в других модулях, для их описания предусмотрена отдельная страница документации: <link href="rkward://component/plot_options"/>.

source: Data format
ar: تنسيق البيانات
eo: Formato de datumoj
ru: Формат данных

source: Separate variables
ar: متغيرات منفصلة
eo: Apartaj variabloj
ru: Отдельные переменные

source: Single (grouped) variable
ar: متغير واحد (مجمَّع)
eo: Unuopa (grupigita) variablo
ru: Единственная (группированная) переменная

source: Variable(s):
ar: المتغير (المتغيرات):
eo: Variablo(j):
ru: Переменные:

source: Outcome variable:
ar: متغير النتيجة:
eo: Rezulta variablo:
ru: Выходная переменная:

source: Group variable(s):
ar: متغير (متغيرات) التجميع:
eo: Grupvariablo(j):
ru: Групповые переменные:

source: Dodged groups
ar: المجموعات المتجنَّبة
eo: Evitataj grupoj
ru: Группы, от которых выполняется уклонение

source: Labels
ar: لصائق
eo: Etikedoj
ru: Подписи

source: Labeling
ar: التعليق باللصائق
eo: Etikedado
ru: Создание подписей

source: Box width
ar: عرض الصندوق
eo: Larĝo de skatolo
ru: Ширина коробки

source: orientation
ar: الاتّجاه
eo: orientiĝo
ru: ориентация

source: horizontal
ar: أفقي
eo: horizontala
ru: горизонтальная

source: vertical
ar: رأسي
eo: vertikala
ru: вертикальная

source: Draw Notches
ar: ارسم الثلمات
eo: Desegnu Noĉojn
ru: Рисовать засечки

source: Draw Outliers
ar: ارسم القيم الشاذة
eo: Desegnu Outliers
ru: Рисовать выбросы

source: Size and color of marks
ar: حجم ولون العلامات
eo: Grandeco kaj koloro de markoj
ru: Размер и цвет отметок

source: size
ar: حجم
eo: grandeco
ru: размер

source: Color
ar: اللون
eo: Koloro
ru: Цвет

source: Show mean
ar: أظهِر المتوسط
eo: Montru meznombron
ru: Показать среднее

source: mean symbol
ar: رمز المتوسط
eo: signifas simbolo
ru: символ среднего

source: Type of mean
ar: نوع المتوسط
eo: Tipo de meznombro
ru: Тип среднего

source: Arithmetic mean
ar: المتوسط الحسابي
eo: Aritmetika meznombro
ru: Арифметическое среднее

source: Geometric mean
ar: المتوسط الهندسي
eo: Geometria meznombro
ru: Геометрическое среднее

source: Harmonic mean
ar: المتوسط التوافقي
eo: Harmonia meznombro
ru: Гармоническое среднее

source: Interquartile mean (IQM)
ar: متوسط المدى الربيعي (IQM)
eo: Interkvartila meznombro (IQM)
ru: Межквартильное среднее

source: Trim of arithmetic mean
ar: تشذيب المتوسط الحسابي
eo: Trim de aritmetika meznombro
ru: Обрезка арифметического среднего

source: show standard deviation
ar: أظهِر الانحراف المعياري
eo: montri norman devion
ru: показать стандартное отклонение

source: standard deviation symbol (upper)
ar: رمز الانحراف المعياري (العلوي)
eo: simbolo de norma devio (supra)
ru: символ стандартного отклонения (верхний предел)

source: standard deviation symbol (lower)
ar: رمز الانحراف المعياري (السفلي)
eo: simbolo de norma devio (pli malalta)
ru: символ стандартного отклонения (нижний предел)

source: Plot Options
ar: خيارات المخطط
eo: Grafikaj Opcioj
ru: Параметры графика

source: Highest density regions
ar: مناطق الكثافة العليا
eo: Plej alta denseca regiono
ru: Области наивысшей плотности

source: Length
ar: الطول
eo: Longo
ru: Длина

source: Plot an estimated density curve. Highest density regions can be marked up.
ar: ارسم منحنى كثافة مُقدَّر. يمكن وضع علامة على مناطق الكثافة العليا.
eo: Grafiku laŭtaksan denseckurbon. Plej altdensecaj regionoj povas esti markitaj.
ru: График кривой оцениваемой плотности. Области наивысшей плотности будут отмечены.
