Repository: KDE/rkward
Catalog: po/*/rkward__item_response_theory.po
Languages: ar, eo

source: Item-fit statistics (Rasch, LTM, 3PM)
ar: إحصائيات توفيق البند (راش، نموذج المعلمتين اللوجستي، نموذج الثلاث معلمات)
eo: Item-taŭgaj statistikoj (Rasch, LTM, 3PM)

source: Person-fit statistics (Rasch, LTM, 3PM)
ar: إحصائيات توفيق الشخص (راش، نموذج المعلمتين اللوجستي، نموذج الثلاث معلمات)
eo: Person-taŭga statistiko (Rasch, LTM, 3PM)

source: Wald test (RSM, PCM)
ar: اختبار والد (نموذج مقياس التصنيف، نموذج الاعتماد الجزئي)
eo: Wald-testo (RSM, PCM)

source: Andersen LR Plot (RSM, PCM)
ar: مخطط نسبة الأرجحية لأندرسن (نموذج مقياس التصنيف، نموذج الاعتماد الجزئي)
eo: Andersen LR grafiko (RSM, PCM)

source: Plot fitted Rasch model
ar: ارسم النموذج الموفَّق لراش
eo: Grafiko konvenis Rasch-modelon

source: Plot fitted two parameter logistic model
ar: ارسم النموذج الموفَّق للمعلَّمتين اللوجستي
eo: Grafiko konvenis du parametran loĝistikan modelon

source: Plot fitted Birnbaum three parameter model
ar: ارسم النموذج الموفَّق لبيرنباوم بثلاث معلمات
eo: Grafiko konvenis Birnbaum tri parametromodelon

source: Plot fitted graded response model
ar: ارسم نموذج الاستجابة المتدرجة الموفَّق
eo: Grafiko konvenis gradigitan respondmodelon

source: Plot fitted rating scale model
ar: ارسم نموذج مقياس التصنيف الموفَّق
eo: Grafiko konvenita taksa skalmodelo

source: Plot fitted partial credit model
ar: ارسم نموذج الاعتماد الجزئي الموفَّق
eo: Grafiko konvenis partan kreditmodelon

source: Analysis
ar: تحليل
eo: Analizo

source: Dichotomous data
ar: بيانات مقسمة ثنائيًا
eo: Dikotomaj datumoj

source: Polytomous data
ar: بيانات متعددة التصنيفات
eo: Politomaj datumoj

source: Tests
ar: اختبارات
eo: Testoj

source: Plots
ar: مخططات
eo: Grafikoj

source: Two parameter logistic model plot
ar: مخطط نموذج المعلمتين اللوجستي
eo: Du parametra loĝistika modelgrafiko

# R code comment
source: two steps are needed to plot standard error curves
ar: اِحتاج خطوتين لرسم منحنيات الخطأ المعياري
eo: du paŝoj estas necesaj por grafiki normajn erarkurbojn

# R code comment
source: first some values are generated...
ar: اِبدأ بتوليد بعض القيم...
eo: unue iuj valoroj estas generitaj...

# R code comment
source: ... and then they're used to plot the curves:
ar: ... ثم استعمِلها لرسم المنحنيات:
eo: ... kaj tiam ili kutimas grafiki la kurbojn:

# Item response theory
source: Ability
ar: القدرة
eo: Kapablo

source: Standard Error
ar: خطأ معياري
eo: Norma Eraro

source: Standard Error of Measurement
ar: خطأ القياس المعياري
eo: Norma Eraro de Mezurado

source: Plotting fitted 2PL model
ar: ارسم النموذج الموفَّق للمعلَّمتين اللوجستي
eo: Grafiko konvenis 2PL-modelon

source: Model
ar: نموذج
eo: Modelo

source: Choose fitted model to plot:
ar: اختر النموذج الموفَّق للرسم:
eo: Elektu taŭgan modelon por komploti:

source: Only objects of class ltm are valid!
ar: كائنات فئة نموذج المعلَّمتين اللوجستي (ltm) فقط صالحة!
eo: Nur objektoj de klaso ltm validas!

source: Plot type
ar: نوع المخطط
eo: Tipo de grafiko

source: Type of plot
ar: نوع الرسم
eo: Tipo de grafiko

source: Plot item(s)
ar: ارسم بندًا (بنودًا)
eo: Grafiku objekto(j)n

source: Plot test information
ar: ارسم معلومات الاختبار
eo: Informu testinformojn

source: Plot standard error
ar: ارسم الخطأ المعياري
eo: Grafika norma eraro

source: Scatterplot of standardized loadings (2-factor model)
ar: مخطط التبعثر للأحمال الموحَّدة (نموذج العاملين)
eo: Disklamo de normigitaj ŝargoj (2-faktora modelo)

source: Type of item plot
ar: نوع مخطط البند
eo: Tipo de elemento grafiko

source: Item characteristic curve
ar: منحنى خاصية البند
eo: Item karakteriza kurbo

source: Item information curve
ar: منحنى معلومات البند
eo: Ero-informkurbo

source: Optional item selection
ar: اختيار بند اختياري
eo: Laŭvola elekto de objektoj

source: List of items (plot all if empty)
ar: قائمة البنود (ارسمها كلها إذا كانت فارغة)
eo: Listo de eroj (grafiki ĉion se malplena)

source: Range of latent variable values
ar: مدى قيم المتغير الكامن
eo: Gamo de latentaj variaj valoroj

source: From:
ar: من:
eo: De:

source: To:
ar: إلى:
eo: Al:

source: Annotation
ar: التعليق التوضيحي
eo: Komentario

source: Annotate plotted lines
ar: اكتب تعليقًا على الخطوط المرسومة
eo: Komentu grafikajn liniojn

source: Show legend
ar: اِعرض دليل
eo: Montri klarigeton

source: Plain lines, no annotation
ar: خطوط بسيطة، لا تعليق توضيحي
eo: Simplaj linioj, neniu komentario

source: Generic plot options
ar: خيارات الرسم العامة
eo: Ĝeneralaj grafiko-opcioj

source: Rasch model plot
ar: مخطط نموذج راش
eo: Rasch modelgrafiko

source: Plotting fitted Rasch model
ar: ارسم النموذج الموفَّق لراش
eo: Grafikante konvenis Rasch-modelon

source: Birnbaum three parameter model plot
ar: مخطط نموذج بيرنباوم لثلاث معلمات
eo: Birnbaum tri parametra modelgrafiko

source: Plotting fitted 3PL model
ar: ارسم النموذج الموفَّق للثلاث معلمات
eo: Grafiko konvenis 3PL-modelon

source: Only objects of class tpm are valid!
ar: كائنات فئة نموذج الثلاث معلمات (tpm) فقط صالحة!
eo: Nur objektoj de klaso tpm validas!

source: Graded response model plot
ar: مخطط نموذج الاستجابة المتدرجة
eo: Gradigita respondmodela grafiko

source: Plotting fitted graded response model
ar: ارسم نموذج الاستجابة المتدرجة الموفَّق
eo: Grafiko konvenita gradigita respondmodelo

source: Only objects of class grm are valid!
ar: كائنات فئة نموذج الاستجابة المتدرجة (grm) فقط صالحة!
eo: Nur objektoj de klaso grm validas!

source: Item operation characteristic curve
ar: منحنى خاصية عملية البند
eo: Item operacio karakteriza kurbo

source: Item operation characteristic curve (inverse)
ar: منحنى خاصية عملية البند (عكسي)
eo: Elementa operacio karakteriza kurbo (inversa)

source: Category (plot all if set to 0)
ar: الفئة (ارسم الجميع إذا ضُبِطَت على 0)
eo: Kategorio (grafiki ĉion se agordita al 0)

source: Partial credit model plot
ar: مخطط نموذج الاعتماد الجزئي
eo: Parta kreditmodela grafiko

source: Plotting fitted partial credit model
ar: ارسم نموذج الاعتماد الجزئي الموفَّق
eo: Grafiko konvenis partan kreditmodelon

source: Plot up to 4 items in one figure
ar: ارسم حتى 4 بنود في شكل واحد
eo: Grafiku ĝis 4 erojn en unu figuro

source: Ask before next figure is drawn
ar: اِسأل قبل رسم الشكل التالي
eo: Demandu antaŭ ol la sekva figuro estas desegnita

source: Range of person parameters
ar: مدى معلمات الشخص
eo: Gamo de person-parametroj

source: Range of probability to solve
ar: مدى احتمال الحل
eo: Gamo de probablo por solvi

source: Rating scale model plot
ar: مخطط نموذج مقياس التصنيف
eo: Taksa skalmodela grafiko

source: Plotting fitted rating scale model
ar: ارسم نموذج مقياس التصنيف الملائم
eo: Grafikante ĝustigitan taksan skalmodelon

source: Andersen's LR test
ar: اختبار النسبة الاحتمالية لـ أندرسن
eo: La LR-testo de Andersen

source: Andersen LR-Test
ar: اختبار النسبة الاحتمالية لـ أندرسن
eo: Andersen LR-Testo

source: Choose fitted model to test (plot):
ar: اختر النموذج الملائم للاختبار (الرسم):
eo: Elektu taŭgan modelon por testi (grafiko):

source: Full raw score split
ar: تقسيم الدرجات الخام الكاملة
eo: Plena kruda poentaro dividita

source: Use vector to define groups
ar: استخدم متجهًا لتحديد المجموعات
eo: Uzu vektoron por difini grupojn

source: Can be numeric, character or a factor
ar: يمكن أن يكون رقميًا، أو حرفيًا، أو عاملاً
eo: Povas esti numera, signo aŭ faktoro

source: Plot options
ar: خيارات الرسم
eo: Grafiko-opcioj

source: Confidence intervals
ar: فترات الثقة
eo: Konfidaj intervaloj

source: Compute standard errors
ar: احسب الأخطاء المعيارية
eo: Kalkuli normajn erarojn

source: Confidence level:
ar: مستوى الثقة:
eo: Konfida nivelo:

source: Confidence bands
ar: نطاقات الثقة
eo: Konfidaj bandoj

source: Annotate items (item names)
ar: أضف لصائق للعناصر (أسماء العناصر)
eo: Prenu erojn (ero-nomojn)

source: Annotate items (rank number of betas)
ar: أضف لصائق للعناصر (رقم رتبة بيتا)
eo: Komenti erojn (rango nombro de betaoj)

source: Plain dots, no annotation
ar: نقاط عادية، بدون لصائق
eo: Simplaj punktoj, neniu komentario

source: Interactive labeling
ar: إضافة لصائق تفاعلية
eo: Interaga etikedado

# Author name
source: RKWard Team
ar: فريق أر كي وارد
eo: RKWard Teamo
