Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: Previous outer statement
ar: العبارة الخارجية السابقة

source: Next toplevel statement
ar: العبارة العلوية التالية

source: Previous toplevel statement
ar: العبارة العلوية السابقة

source: Next code chunk
ar: مقطع الرمز التالي

source: Previous code chunk
ar: مقطع الرمز السابق

source: Select current statement
ar: اختر العبارة الحالية

source: Select current code chunk
ar: اختر مقطع الرمز الحالي

source: Run
ar: شغّل

source: Run current statement, and advance
ar: شغّل العبارة الحالية، وتقدّم

# noun: type of preview
source: <b>Preview Mode</b>
ar: <b>وضع المعاينة</b>

source: <b>Options</b>
ar: <b>خيارات</b>

source: Unable to open "%1"
ar: لا أستطيع فتح "%1"
ru: Не удалось открыть «%1»
tr: “%1” açılamıyor

source: Could not open command file
ar: لا أستطيع فتح ملف الأوامر
ru: Не удалось открыть файл команд
tr: Komut dosyası açılmadı

source: Script Editor
ar: محرّر السّكربتات
ru: Редактор сценариев
tr: Betik Düzenleyicisi

source: Insert line break and run
ar: أدخل فاصل سطر وشغّل
ru: Вставить разрыв строки и запустить
tr: Satır Sonu Ekle ve Çalıştır

source: Run block
ar: شغّل الكتلة
ru: Запустить блок
tr: Bloğu Çalıştır

source: Mark selection as block
ar: علّم التحديد ككتلة
ru: Отметить выделение как блок
tr: Seçimi Blok Olarak İmle

source: Unmark block
ar: أزل تعليم الكتلة
ru: Снять отметку блока
tr: Seçimin İmini Kaldır

source: CD to script directory
ar: CD إلى مجلد النص البرمجي
ru: Перейти в каталог сценария
tr: Betik Dizinine Git

source: Change the working directory to the directory of this script
ar: غيّر مجلد العمل إلى مجلد هذا النص البرمجي
ru: Сменить рабочий каталог на каталог этого сценария
tr: Çalışma dizinini bu betiğin dizinine değiştir

# Checkable action: the preview gets updated while typing
source: Update as you type
ar: حدّث أثناء الكتابة
ru: Обновление по мере набора
tr: Yazarken Bul

source: When this option is enabled, an update of the preview will be triggered every time you modify the script. When this option is disabled, the preview will be updated whenever you save the script, only.
ar: عند تفعيل هذا الخيار، يبدأ تحديث المعاينة في كل مرة تعدّل النص البرمجي. عند تعطيل هذا الخيار، تحدّث المعاينة كلما حفظت النص البرمجي، فقط.
ru: Когда этот параметр включён, при изменении сценария каждый раз будет выполняться обновление области предварительного просмотра. Когда этот параметр отключён, область предварительного просмотра будет обновляться только при сохранении сценария.
tr: Bu seçenek etkinleştirildiğinde, komut dosyasını her değiştirdiğinizde bir önizleme güncellemesi tetiklenecektir. Bu seçenek devre dışı bırakıldığında, önizleme yalnızca betiği her kaydettiğinizde güncellenecektir.

source: Save Script...
ar: احفظ السكربت...
ru: Сохранить сценарий…
tr: Betiği Kaydet…

source: Save Script As...
ar: احفظ البرنامج النصي كـ ...
ru: Сохранить сценарий как…
tr: Betiği Farklı Kaydet…

source: [modified]
ar: [معدّل]
ru: [изменено]
tr: [değiştirildi]

source: The document "%1" has been modified. Close it anyway?
ar: عدّل المستند "%1". هل تريد إغلاقه على أي حال؟
ru: Документ «%1» изменён. Всё равно закрыть его?
tr: “%1” belgesi değiştirildi. Yine de kapatılsın mı?

source: File not saved
ar: الملف لم يحفظ
ru: Файл не сохранён
tr: Dosya Kaydedilmedi

source: No preview
ar: لا معاينة
ru: Без предварительного просмотра
tr: Önizleme yok

source: Disable preview
ar: عطّل المعاينة
ru: Отключить предварительный просмотр
tr: Önizlemeyi Devre Dışı Bırak

source: R Markdown
ar: مارك‌داون R

source: Preview of rendered R Markdown
ar: معاينة R Markdown المصرّح
ru: Предварительный просмотр обработанного файла R Markdown
tr: Sunulan R Markdown’un önizlemesi

source: Preview the script as rendered from RMarkdown format (.Rmd)
ar: استعرض النص البرمجي كما جرى تصييره من تنسيق RMarkdown (الامتداد Rmd.)

source: Render format
ar: صيّر التنسيق

source: Render as HTML
ar: صيّر كـ HTML

source: Render as PDF
ar: صيّر كـ PDF

source: Auto Format
ar: تنسيق آلي

source: RKWard Output
ar: ناتج أر كي وارد
ru: Вывод RKWard
tr: RKWard Çıktısı

source: Preview of generated RKWard output
ar: استعراض لناتج أر كي وارد المولّد
ru: Предварительный просмотр сгенерированного вывода RKWard
tr: Üretilen R çıktısının önizlemesi

source: Preview any output to the RKWard Output Window. This preview will be empty, if there is no call to <i>rk.print()</i> or other RKWard output commands.
ar: استعرض أي ناتج إلى نافذة ناتج أر كي وارد. يكون هذا الاستعراض فارغًا، إن لم يكن هناك استدعاء للدالة <i>rk.print()</i> أو أوامر ناتج أر كي وارد أخرى.
ru: Предварительный просмотр данных, которые передаются в окно вывода RKWard. Будет пустым, если не выполнялся вызов <i>rk.print()</i> или других команд вывода RKWard.
tr: Herhangi bir çıktıyı RKWard Çıkış Penceresinde önizleyin. <i>rk.print()</i>’e veya diğer RKWard çıktı komutlarına çağrı yapılmadığı takdirde bu önizleme boş olacaktır.

source: Preview of script running in interactive R Console
ar: استعراض للنص البرمجي قيد التشغيل في محطة R التفاعلية
ru: Предварительный просмотр сценария, выполняемого в интерактивной консоли R
tr: Etkileşimli R konsolunda çalışan betiğin önizlemesi

source: Preview the script as if it was run in the interactive R Console
ar: استعرض النص البرمجي كما لو جرى تشغيله في محطة R التفاعلية
ru: Предварительный просмотр сценария, как если бы он выполнялся в интерактивной консоли R
tr: Komut dosyasını etkileşimli R Konsolunda çalıştırılmış gibi önizle

source: Echo statements
ar: عبارات الصدى

source: Continue on error
ar: واصل عند الخطأ

source: Evaluation environment
ar: بيئة التقييم

source: Evaluate code directly in .GlobalEnv. Assignments can access <b>and modify</b> objects in .GlobalEnv.
ar: قيّم الشيفرة مباشرةً في .GlobalEnv. يمكن للتعيينات أن تصل إلى كائنات في .GlobalEnv و<b>تعدلها</b>.

source: Scoped
ar: محدد النطاق

source: Evaluate code in a child scope of .GlobalEnv. Objects in .GlobalEnv can be accessed, but regular assignments using the <tt>&lt;-</tt>-operator will not modify them. (Other assignment operations could still modify them!)
ar: قيّم الشيفرة في نطاق فرعي من .GlobalEnv. يمكن الوصول إلى الكائنات في .GlobalEnv، لكن التعيينات العادية باستخدام المعامل <tt>&lt;-</tt> لن تعدلها. (يمكن لعمليات التعيين الأخرى أن تعدلها!)

source: Local
ar: المحليّة

source: Evaluate code in true local environment. Objects in .GlobalEnv are not on the search path, and will not be modified by regular assignments using the <tt>&lt;-</tt>-operator. (Other assignment operations could still modify them!)
ar: قيّم الشيفرة في بيئة محلية حقيقية. الكائنات في .GlobalEnv ليست على مسار البحث، ولن تعدلها التعيينات العادية باستخدام المعامل <tt>&lt;-</tt>. (يمكن لعمليات التعيين الأخرى أن تعدلها!)

source: Plot
ar: ارسم
ru: График
tr: Grafik

source: Preview of generated plot
ar: استعراض للمخطط المولّد
ru: Предварительный просмотр сгенерированного графика
tr: Üretilen grafiğin önizlemesi

source: Preview any onscreen graphics produced by running this script. This preview will be empty, if there is no call to <i>plot()</i> or other graphics commands.
ar: استعرض أي رسومات بيانية على الشاشة أنتجها تشغيل هذا النص البرمجي. يكون هذا الاستعراض فارغًا، إن لم يكن هناك استدعاء للدالة <i>plot()</i> أو أوامر رسومات بيانية أخرى.
ru: Предварительный просмотр экранной графики, созданной путём запуска этого сценария (ничего не будет показано, если не выполнялся вызов <i>plot()</i> или других команд графики).
tr: Bu betiği çalıştırarak üretilen tüm ekran grafiklerini önizleyin. <i>plot()</i> veya diğer grafik komutlarına çağrı yapılmadığı takdirde bu önizleme boş olacaktır.

source: <p>The preview feature <b>tries</b> to avoid making any lasting changes to your workspace, by default (technically, by making use of a <i>local</i> evaluation environment; some preview modes allow optional control about the evaluation environment). However, <b>there are cases where using the preview feature may cause unexpected side-effects</b>.</p><p>In particular, this is the case for scripts that contain explicit assignments to <i>globalenv()</i>, or for scripts that alter files on your filesystem. Further, attaching/detaching packages or package namespaces will affect the entire running R session.</p><p>Please keep this in mind when using the preview feature, and especially when using the feature on scripts originating from untrusted sources.</p>
ar: <p>خاصية الاستعراض <b>تحاول</b> تجنب إحداث أي تغييرات دائمة في مساحة عملك، بشكل مبدئي (تقنيًا، عن طريق الاستفادة من بيئة تقييم <i>محلية</i>؛ تتيح بعض أوضاع الاستعراض تحكمًا اختياريًا في بيئة التقييم). ومع ذلك، <b>هناك حالات قد يسبب فيها استخدام خاصية الاستعراض آثارًا جانبية غير متوقعة</b>.</p><p>هذا هو الحال بشكل خاص بالنسبة للنصوص البرمجية التي تحتوي على تعيينات صريحة إلى <i>globalenv()</i>، أو للنصوص البرمجية التي تغير الملفات على نظام ملفاتك. علاوة على ذلك، سيؤثر إرفاق/فصل الحزم أو مساحات أسماء الحزم على جلسة R الجاري تشغيلها بالكامل.</p><p>الرجاء مراعاة هذا عند استخدام خاصية الاستعراض، وخاصة عند استخدام الخاصية على النصوص البرمجية الآتية من مصادر غير موثوقة.</p>

source: Potential side-effects of previews
ar: آثار جانبية محتملة للاستعراضات
ru: Потенциальные побочные эффекты предварительного просмотра
tr: Önizlemelerin olası yan etkileri

source: An error occurred while trying to create an autosave of the script file '%1':
ar: وقع خطأ أثناء محاولة إنشاء حفظ آلي لملف النص البرمجي '%1':
ru: Ошибка при попытке автосохранения файла сценария «%1»:
tr: “%1” betiğinin kendiliğinden kaydı oluşturulmaya çalışılırken bir hata oluştu:

source: Unnamed
ar: غير مسمًّى
ru: Без имени
tr: Adsız

source: %1 (Active)
ar: %1 (نشط)
ru: %1 (активно)
tr: %1 (Etkin)

source: %1 (Unused)
ar: %1 (غير مستخدمة)
ru: %1 (не используется)
tr: %1 (Kullanılmıyor)

source: &Tools Move
ar: تحريك &الأدوات
ru: &Инструменты
tr: &Araçları Taşı

source: Incomplete statement.
ar: عبارة غير مكتملة.
ru: Неполная инструкция.
tr: Tamamlanmamış ifade.

source: Syntax error.
ar: خطأ في الصياغة.
ru: Синтаксическая ошибка.
tr: Sözdizim hatası.

source: An unspecified error occurred while running the command.
ar: وقع خطأ غير محدد أثناء تشغيل الأمر.
ru: При выполнении команды произошла неизвестная ошибка.
tr: Komut çalıştırılırken belirtilmeyen bir hata oluştu.

source: Configure
ar: اضبط
ru: Настроить
tr: Yapılandır

source: Next (step over)
ar: التالي (تجاوز الخطوة)
ru: Далее (шаг с обходом)
tr: Sonraki (Üzerinden Geç)

source: Evaluate the next statement, stepping over function calls.
ar: قيّم العبارة التالية، متجاوزًا استدعاءات الدوال.
ru: Обработать следующую инструкцию без входа в вызовы функций.
tr: İşlev çağrılarının üzerinden geçerek bir sonraki ifadeyi değerlendirin.

source: Next (step into)
ar: التالي (ادخل خطوة)
ru: Далее (шаг с заходом)
tr: Sonraki (Araya Gir)

source: Evaluate the next statement, stepping into function calls.
ar: قيّم العبارة التالية، وادخل في استدعاءات الدوال.
ru: Обработать следующую инструкцию с входом в вызовы функций.
tr: İşlev çağrılarına adım atarak sonraki ifadeyi değerlendirin.

source: Step out
ar: اخرج
ru: Шаг с выходом
tr: Dışarı Çık

source: <p>Continue until the caller of this function is reached (unless another debug statement is hit, earlier)</p><p><b>Note:</b> In some cases, the calling function will never be reached, because the call was the last step in the caller. In these cases, the behavior is identical to 'Continue'.</p>
ar: <p>تابع حتى يصل إلى المستدعَي لهذه الدالة (ما لم يصل إلى عبارة تصحيح أخرى، في وقت سابق)</p><p><b>ملاحظة:</b> في بعض الحالات، لن يصل إلى الدالة المستدعِية أبدًا، لأن الاستدعاء كان الخطوة الأخيرة في المستدعِي. في هذه الحالات، السلوك مطابق لـ «تابع».</p>
ru: <p>Продолжать до достижения инициатора вызова этой функции (если только раньше не встретится другая инструкция отладки)</p><p><b>Примечание:</b> в некоторых случаях вызывающая функция никогда не будет достигнута, потому что данный вызов был последним шагом в инициаторе вызова. В таких случаях поведение будет идентично «Продолжить».</p>
tr: <p>Bu işlevi çağırana ulaşılana kadar sürdürün (başka bir hata ayıklama ifadesine daha önce ulaşılmadığı sürece)</p><p><b>Not:</b> Bazı durumlarda çağrı işlevine hiçbir zaman ulaşılamaz çünkü çağrı arayanın son adımıdır. Bu durumlarda davranış “Sürdür” ile aynıdır.</p>

source: Finish current
ar: أنهِ الحالي
ru: Завершить
tr: Geçerliyi Bitir

source: Finish current loop or function.
ar: أنهِ الحلقة الحالية أو الدالة الحالية.
ru: Завершить текущий цикл или функцию.
tr: Geçerli döngüyü veya işlevi bitirin.

source: Continue
ar: تابع
ru: Продолжить
tr: Sürdür

source: Continue evaluation.
ar: واصل التقييم.
ru: Продолжить вычисление.
tr: Değerlendirmeyi sürdürün.

source: Exit debugger and return to top-level statement.
ar: اخرج من المصحح وعد إلى عبارة المستوى الأعلى.
ru: Выйти из отладчика и вернуться к инструкции верхнего уровня.
tr: Hata ayıklayıcısından çıkın ve en üst düzey ifadeye dönün.

source: This window cannot be closed, while a debugger is active. If you have no idea what this means, and you want to get out, press the 'Cancel' button on the right hand side of this window.
ar: لا يمكن إغلاق هذه النافذة، بينما مصحح الأخطاء نشط. إن لم تكن لديك فكرة عما يعنيه هذا، وتريد الخروج، اضغط على زر 'إلغاء' على الجانب الأيمن من هذه النافذة.
ru: Это окно нельзя закрыть, пока работает отладчик. Если непонятно, что это значит, и нужно просто избавиться от этого окна, нажмите расположенную справа кнопку «Отмена».
tr: Bir hata ayıklayıcısı etkinken bu pencere kapatılamaz. Bunun ne anlama geldiği hakkında hiçbir fikriniz yoksa ve çıkmak istiyorsanız bu pencerenin sağ tarafındaki “İptal” düğmesine basın.

source: <p>This window is used for displaying RKWard related debug messages. It is targeted primarily at (plugin) developers. It does <b>not</b> offer any features for debugging R code.</p><p>Note that the list of messages is cleared every time you close the window.</p><p>Type and severity level of messages can be controlled from Settings->Configure RKWard->Debug</p>
ar: <p>تستخدم هذه النافذة لعرض رسائل تصحيح الأخطاء المتعلقة بـ أر كي وارد. وهي تستهدف بشكل أساسي مطوري (الإضافات). لا تقدم <b>أي</b> ميزات لتصحيح شيفرة R.</p><p>لاحظ أن قائمة الرسائل تمحى في كل مرة تغلق فيها النافذة.</p><p>يمكن التحكم في نوع الرسائل ومستوى شدتها من إعدادات->اضبط أر كي وارد->تصحيح الأخطاء</p>
ru: <p>Это окно используется для показа сообщений отладки, связанных с RKWard, и предназначается в основном для разработчиков (модулей). Оно <b>не</b> предоставляет каких-либо функций для отладки кода R.</p><p>Обратите внимание, что при закрытии окна всегда выполняется очистка списка сообщений.</p><p>Типом и уровнем критичности сообщений можно управлять в разделе «Настройка -> Настроить RKWard -> Отладка»</p>
tr: <p>Bu pencere RKWard ile ilgili hata ayıklama iletilerini görüntülemek için kullanılır. Öncelikle (eklenti) geliştiricilerini hedef alır. R kodunda hata ayıklamaya yönelik herhangi bir özellik <b>sunmaz</b>.</p><p>Pencereyi her kapattığınızda ileti listesinin temizlendiğini unutmayın.</p><p>Tür ve öncelik derecesi, Ayarlar → RKWard Uygulamasını Yapılandır → Hata Ayıklama bömlümünden denetlenebilir.</p>

source: About this window
ar: عن هذه النافذة
ru: Об этом окне
tr: Bu Pencere Hakkında

source: Working directory
ar: دليل العمل
ru: Рабочий каталог
tr: Çalışma Dizini

source: Rename
ar: غيّر الاسم
ru: Переименовать
tr: Yeniden Adlandır

source: Rename...
ar: غيّر الاسم...
ru: Переименовать…
tr: Yeniden Adlandır…

source: New name for '%1':
ar: اسم جديد لـ '%1':
ru: Новое имя «%1»:
tr: “%1” için yeni ad:

source: Find:
ar: اعثر:
ru: Искать:
tr: Bul:

source: Fields:
ar: الحقول:
ru: Поля:
tr: Alanlar:

source: All
ar: الكلّ
ru: Все
tr: Tümü

source: All but keywords
ar: الكل ما عدا الكلمات المفتاحية
ru: Все, кроме ключевых слов
tr: Anahtar sözcükler dışında tümü

source: Keywords
ar: الكلمات المفتاحيّة
ru: Ключевые слова
tr: Anahtar sözcükler

source: Package:
ar: الحزمة:
ru: Пакет:
tr: Paket:

source: Case sensitive
ar: حسّاس لحالة الأحرف
ru: С учётом регистра
tr: BÜYÜK/küçük harf duyarlı

source: Fuzzy matching
ar: مطابقة غامضة
ru: Неточное совпадение
tr: Bulanık eşleşme

source: Find
ar: اعثر
ru: Найти
tr: Bul

source: Help search
ar: بحث المساعدة
ru: Поиск в документации
tr: Yardım ara

source: Find HTML help for %1
ar: ابحث عن مساعدة HTML لـ %1
ru: Найти HTML-справку по %1
tr: %1 için HTML Yardımı Bul

source: No help found on '%1'. Maybe the corresponding package is not installed/loaded, or maybe you mistyped the command. Try using Help->Search R Help for more options.
ar: لا توجد مساعدة جرى العثور عليها حول '%1'. ربما الحزمة المقابلة ليست مثبتة/محملة، أو ربما أخطأت في كتابة الأمر. حاول استخدام مساعدة->ابحث في مساعدة R لمزيد من الخيارات.
ru: Не удалось найти справку по «%1». Возможно, соответствующий пакет не был установлен или загружен (или была допущена ошибка при вводе команды). Дополнительные результаты можно получить с помощью пункта меню «Справка -> Поиск в справке по R».
tr: “%1” üzerinde yardım bulunamadı. Belki ilgili paket kurulmamış/yüklenmemiştir veya komutu yanlış yazmış olabilirsiniz. Daha fazla seçenek için Yardım → R Yardımında Ara’yı kullanmayı deneyin.

source: No help found
ar: لا توجد مساعدة جرى العثور عليها
ru: Справка не найдена
tr: Yardım Bulunamadı

source: All installed packages
ar: جميع الحزم المثبتة
ru: Все установленные пакеты
tr: Tüm kurulu paketler

source: All loaded packages
ar: جميع الحزم المحملة
ru: Все загруженные пакеты
tr: Tüm yüklü paketler

source: Topic
ar: الموضوع
ru: Тема
tr: Konu

source: Package
ar: الحزمة
ru: Пакет
tr: Paket

source: Save as
ar: احفظ ك‍
ru: Сохранить как
tr: Farklı Kaydet

source: RKWard output file %s does not (yet) exist
ar: ملف ناتج أر كي وارد %s لا يوجد (بعد)
ru: Файл вывода RKWard %s (ещё) не существует
tr: RKWard çıktı dosyası %s (henüz) yok

source: [Active]
ar: [نشط]
ru: [Активно]
tr: [Etkin]

# noun, the output
source: Output %1
ar: الخرج %1

source: Output Window
ar: نافذة الناتج
ru: Окно вывода
tr: Çıktı Penceresi

source: &Refresh Output
ar: &حدث الناتج
ru: &Обновить вывод
tr: &Çıktıyı Yenile

source: Page does not exist or is broken
ar: الصفحة غير موجودة أو معطلة
ru: Страница не существует или повреждена
tr: Sayfa yok veya bozuk

source: Do you really want to clear the output? This will also remove all image files used in the output. It will not be possible to restore it.
ar: هل تريد حقًا محو الناتج؟ سيزيل هذا أيضًا جميع ملفات الصور المستخدمة في الناتج. لن يكون استعادته ممكنًا.
ru: Очистить вывод? Это действие также приведёт к удалению всех файлов изображений, содержащихся в выводе. Восстановление будет невозможно.
tr: Çıktıyı temizlemeyi gerçekten istiyor musunuz? Bu aynı zamanda çıktıda kullanılan tüm görsel dosyalarını da kaldıracaktır. Onu geri yüklemek olanaklı değildir.

source: Flush output?
ar: امسح الناتج؟
ru: Сбросить буфер вывода?
tr: Çıktıyı Temizle?

source: Flushing output
ar: مسح الناتج
ru: Сброс буфера вывода
tr: Çıktı temizleniyor

source: Zoom In
ar: قرّب
ru: Увеличить масштаб
tr: Yakınlaştır

source: Zoom Out
ar: بعّد
ru: Уменьшить масштаб
tr: Uzaklaştır

source: Default &Encoding
ar: ال&ترميز المبدئي
ru: &Кодировка по умолчанию
tr: Öntanımlı &Kodlama

source: Set the encoding to assume in case no explicit encoding has been set in the page or in the HTTP headers.
ar: اضبط الترميز لافتراضه في حالة لم يجري تعيين ترميز صريح في الصفحة أو في ترويسات HTTP.
ru: Установите кодировку, которая будет использоваться, когда на странице или в HTTP-заголовках нет явного указания кодировки.
tr: Sayfada veya HTTP başlıklarında açık bir kodlamanın ayarlanmaması durumunda kodlamayı öntanımlı şekilde ayarlayın.

source: Export Page as HTML
ar: صدر الصفحة كـ HTML
ru: Экспорт страницы в HTML
tr: Sayfayı HTML Olarak Dışa Aktar

source: Save Output
ar: احفظ الناتج
ru: Сохранить вывод
tr: Çıktıyı Kaydet

source: Save Output As
ar: احفظ المخرجات كـ
ru: Сохранить вывод как
tr: Çıktıyı Farklı Kaydet

source: &Clear Output
ar: ا&محُ الخرج
ru: &Очистить вывод
tr: &Çıktıyı Temizle

source: &Revert to last saved state
ar: &عد إلى آخر حالة محفوظة
ru: &Вернуться к последнему сохранённому состоянию
tr: &Son Kayıtlı Duruma Geri Döndür

source: Set Output as &Active
ar: اجعل الناتج &نشطًا
ru: Установить вывод как &активный
tr: Çıktıyı &Etkin Olarak Ayarla

source: Set this output as the file to append output to.
ar: اجعل هذا الناتج هو الملف لإلحاق الناتج به.
ru: Сделать этот вывод файлом, в который будет добавляться вывод.
tr: Bu çıktıyı, çıktının iliştirileceği dosya olarak ayarlayın.

source: Print output
ar: اطبع الناتج
ru: Распечатать вывод
tr: Çıktıyı Yazdır

source: Print page
ar: اطبع الصفحة
ru: Распечатать страницу
tr: Sayfayı Yazdır

source: No Title
ar: لا يوجد عنوان
ru: Без названия
tr: Başlık Yok

source: <h1>Help page missing</h1> <p>The help page for this component has not yet been written (or is broken). Please consider contributing it.</p>
ar: <h1>صفحة المساعدة مفقودة</h1> <p>لم تجرَ كتابة صفحة المساعدة لهذا المكون بعد (أو أنها معطلة). يرجى التفكير في المساهمة فيها.</p>
ru: <h1>Страница справки отсутствует</h1> <p>Страница справки для этого компонента ещё не написана (или повреждена). Можно поучаствовать в развитии проекта, создав её.</p>
tr: <h1>Yardım sayfası eksik</h1> <p>Bu bileşenin yardım sayfası henüz yazılmadı (veya bozuk). Lütfen katkıda bulunmayı düşünün.</p>

source: Use %1 now
ar: استخدم %1 الآن
ru: Использовать %1 сейчас
tr: Şimdi %1 Kullan

source: Summary
ar: الملخّص
ru: Сводка
tr: Özet

source: Usage
ar: الاستخدام
ru: Использование
tr: Kullanım

source: Choose another file
ar: اختر ملفًا آخر
ru: Выбрать другой файл
tr: Başka Dosya Seç

source: GUI settings
ar: إعدادات الواجهة
ru: Параметры графического интерфейса пользователя
tr: Arayüz Ayarları

source: Related functions and pages
ar: الدوال والصفحات ذات الصلة
ru: Связанные функции и страницы
tr: İlgili işlevler ve sayfalar

source: Technical details
ar: التفاصيل التقنية
ru: Технические подробности
tr: Teknik ayrıntılar

source: About
ar: عن
ru: Описание
tr: Hakkında

source: <h1>On this page:</h1>
ar: <h1>في هذه الصفحة:</h1>
ru: <h1>На этой странице:</h1>
tr: <h1>Bu sayfada:</h1>

source: Unnamed GUI element
ar: عنصر واجهة رسومية غير مسمى
ru: Безымянный элемент графического интерфейса пользователя
tr: Adsız Arayüz Ögesi

source: R Reference on '%1'
ar: مرجع R حول '%1'
ru: Ссылка R на «%1»
tr: “%1” Üzerinde R Başvurusu

source: BROKEN REFERENCE
ar: مرجع معطوب
ru: НЕРАБОЧАЯ ССЫЛКА
tr: BOZUK BAŞVURU

source: Help on %1
ar: مساعدة عن %1
ru: Справка по %1
tr: %1 Üzerine Yardım

source: Configure %1
ar: اضبط %1
ru: Настроить %1…
tr: Yapılandır: %1

source: No PDF viewer component found
ar: لم يعثر على مكون عارض PDF
ru: Не найден компонент средства просмотра PDF
tr: Bir PDF görüntüleyicisi bileşeni bulunamadı

source: The name <i>%1</i> might refer to:<br>
ar: قد يشير الاسم <i>%1</i> إلى:<br>
ru: Имя <i>%1</i> может относиться к:<br>
tr: <i>%1</i> adı şu anlama gelebilir:<br>

source: Attach
ar: أرفق
ru: Прикрепить
tr: İliştir

source: Position
ar: الموضع
ru: Позиция
tr: Konum

source: Left Sidebar
ar: الشّريط الجانبيّ الأيمن
ru: Левая боковая панель
tr: Sol Kenar Çubuğu

source: Right Sidebar
ar: الشّريط الجانبيّ الأيسر
ru: Правая боковая панель
tr: Sağ Kenar Çubuğu

source: Top Sidebar
ar: الشّريط الجانبيّ العلويّ
ru: Верхняя боковая панель
tr: Üst Kenar Çubuğu

source: Bottom Sidebar
ar: الشّريط الجانبيّ السفليّ
ru: Нижняя боковая панель
tr: Alt Kenar Çubuğu

source: Not shown in sidebar
ar: لا يعرض في الشريط الجانبي
ru: Не показывать на боковой панели
tr: Kenar çubuğunda gösterilmiyor

source: Help on R
ar: مساعدة حول R
ru: Справка по R
tr: R Üzerine Yardım

source: Search R Help
ar: ابحث في مساعدة R
ru: Поиск в справке R
tr: R Yardımında Ara

source: RKWard Dashboard and Help
ar: لوحة تحكم أر كي وارد والمساعدة
ru: Обзор параметров и справка RKWard
tr: RKWard Gösterge Tablosu ve Yardımı

source: Shows the R help index
ar: يعرض فهرس مساعدة R
ru: Показывает индекс справки R
tr: R yardım indeksini gösterir
