Repository: KDE/rkward
Catalog: po/*/rkward__embedded.po
Languages: ar, eo, ru, tr

source: This is the <i>nx</i> argument, when 'Specify below' is selected in the above option list.
ar: هذا هو الوسيط <i>nx</i>، عندما يُختار 'حدد أدناه' في قائمة الخيارات أعلاه.
eo: Ĉi tiu estas la argumento <i>nx</i>, kiam 'Specifi sube' estas elektita en la supra elektolisto.
ru: Это аргумент <i>nx</i>, когда в расположенном выше списке вариантов выбрано «Указать ниже».
tr: Bu, yukarıdaki seçenek listesinde ‘Aşağıda belirt’ seçildiğindeki <i>nx</i> argümanıdır.

source: This is the <i>ny</i> argument. Similar to <i>nx</i>. See the explanation on number of x cells above.
ar: هذا هو الوسيط <i>ny</i>. مشابه لـ <i>nx</i>. انظر الشرح حول عدد خلايا x أعلاه.
eo: Jen la <i>ny</i> argumento. Simile al <i>nx</i>. Vidu la klarigon pri nombro da x-ĉeloj supre.
ru: Это аргумент <i>ny</i>. Аналогичен <i>nx</i>. Пояснения о количестве ячеек по x приводятся выше.
tr: Bu, <i>ny</i> argümanıdır. <i>nx</i>’e benzer. Yukarıdaki x hücre sayısıyla ilgili açıklamaya bakın.

source: This is the <i>ny</i> argument when a specified (by the user) number of y cells are to be used. Similar to x cells.
ar: هذا هو الوسيط <i>ny</i> عندما يُراد استخدام عدد محدد (من قبل المستخدم) من خلايا y. مشابه لخلايا x.
eo: Ĉi tiu estas la argumento <i>ny</i> kiam specifita (de la uzanto) nombro da y ĉeloj estas uzota. Simila al x-ĉeloj.
ru: Это аргумент <i>ny</i>, когда будет использоваться указанное (пользователем) количество ячеек по y. Аналогичен аргументу количества ячеек по x.
tr: Bu, belirtilen sayıda (kullanıcı tarafından) y hücresinin kullanılacağı durumlarda <i>ny</i> argümanıdır. X hücrelerine benzer.

source: Check this option to use a custom line width. In which case, provide the width below.
ar: ضع علامة على هذا الخيار لاستخدام عرض خط مخصص. وفي هذه الحالة، وفر العرض أدناه.
eo: Marku ĉi tiun elekteblon por uzi propran liniolarĝon. En tiu kazo, donu la larĝon sube.
ru: Установите этот флажок, чтобы использовать нестандартную ширину линии (укажите её ниже).
tr: Özel bir çizgi genişliği kullanmak için bu seçeneği işaretleyin. Bu durumda genişliği aşağıda belirtin.

source: This is the <i>lwd</i> argument. Check the above option to use this.
ar: هذا هو الوسيط <i>lwd</i>. ضع علامة على الخيار أعلاه لاستخدام هذا.
eo: Jen la argumento <i>lwd</i>. Marku la supran opcion por uzi ĉi tion.
ru: Это аргумент <i>lwd</i>. Установите расположенный выше флажок для использования этого параметра.
tr: Bu, <i>lwd</i> argümanıdır. Bunu kullanmak için yukarıdaki seçeneği işaretleyin.

source: This is the <i>lty</i> argument. Choosing Default will not add any arguments to the grid function call, hence the default line type will be used.
ar: هذا هو الوسيط <i>lty</i>. اختيار 'مبدئي' لن يضيف أي وسائط إلى استدعاء دالة الشبكة، وبالتالي يُستخدم نوع الخط مبدئي.
eo: Jen la <i>lty</i> argumento. Elektante Defaŭltan ne aldonos argumentojn al la krada funkciovoko, tial la defaŭlta linio-tipo estos uzata.
ru: Это аргумент <i>lty</i>. При выборе значения «По умолчанию» в вызов функции построения сетки не будет добавлено никаких аргументов, поэтому будет использоваться тип линии по умолчанию.
tr: Bu, <i>lty</i> argümanıdır. Öntanımlı’nın seçilmesi ızgara işlevi çağrısına herhangi bir argüman eklemeyeceğinden, öntanımlı satır türü kullanılacaktır.

source: This is the <i>col</i> argument. The Default option is similar to that of Line type (see above).
ar: هذا هو الوسيط <i>col</i>. خيار 'مبدئي' مشابه لخيار 'نوع الخط' (انظر أعلاه).
eo: Jen la argumento <i>kol</i>. La Defaŭlta elekteblo estas simila al tiu de Linio-tipo (vidu supre).
ru: Это аргумент <i>col</i>. Вариант «По умолчанию» аналогичен такому же варианту для «Типа линии» (смотрите выше).
tr: Bu <i>col</i> argümanıdır. Öntanımlı seçeneği çizgi türününkine benzer (yukarıya bakın).

source: This is the <i>equilogs</i> argument. Uncheck this option to set <i>equilogs=FALSE</i>.
ar: هذا هو الوسيط <i>equilogs</i>. أزل علامة من هذا الخيار لضبط <i>equilogs=FALSE</i>.
eo: Ĉi tio estas la argumento <i>equilogs</i>. Malmarku ĉi tiun elekteblon por agordi <i>equilogs=FALSE</i>.
ru: Это аргумент <i>equilogs</i>. Снимите этот флажок, чтобы установить <i>equilogs=FALSE</i>.
tr: Bu, <i>equilogs</i> argümanıdır. <i>equilogs=FALSE</i> değerini ayarlamak için bu seçeneğin işaretini kaldırın.

source: Grid options
ar: خيارات الشبكة
eo: Kradaj opcioj
ru: Параметры сетки
tr: Izgara seçenekleri

source: Number of X cells
ar: عدد خلايا س
eo: Nombro de X-ĉeloj
ru: Количество ячеек по X
tr: X hücrelerinin sayısı

source: At the ticks
ar: عند علامات التدريج
eo: Ĉe la tiktakoj
ru: На делениях
tr: Tiklerde

source: None
ar: لا شيء
eo: Neniu
ru: Нет
tr: Yok

source: Specify below
ar: حدد أدناه
eo: Indiku sube
ru: Указать ниже
tr: Aşağıda belirt

source: X Cells
ar: خلايا س
eo: X Ĉeloj
ru: Ячейки по X
tr: X Hücreleri

source: Number of Y cells
ar: عدد خلايا ص
eo: Nombro de Y-ĉeloj
ru: Количество ячеек по Y
tr: Y hücrelerinin sayısı

source: Y Cells
ar: خلايا ص
eo: Y Ĉeloj
ru: Ячейки по Y
tr: Y Hücreleri

source: Custom Line width
ar: عرض خط مخصص
eo: Propra Liniolarĝo
ru: Нестандартная ширина линии
tr: Özel çizgi genişliği

source: Equilogs
ar: لوغاريتمات متساوية
ru: Эквилогарифмические

source: Line width
ar: عرض الخط
eo: Liniolarĝo
ru: Ширина линии
tr: Çizgi genişliği

source: Line type
ar: نوع الخط
eo: Liniotipo
ru: Тип линии
tr: Çizgi türü

source: Note: Not applicable for Trellis type devices!
ar: ملاحظة: لا ينطبق على أجهزة نوع التعريشة!
eo: Noto: Ne aplikebla por Trellis-tipo aparatoj!
ru: Примечание: неприменимо для устройств типа Trellis!
tr: Not: Trellis tipi aygıtlar için geçerli değildir!

source: FALSE
ar: خطأ
eo: MALSO
tr: YANLIŞ

source: TRUE
ar: صحيح
tr: DOĞRU

# (function name) of (object name)
source: %1 of %2
ar: %1 من %2
eo: %1 el %2
