Repository: KDE/rkward
Catalog: po/*/rkward__graphics_device.po
Languages: ar, eo, tr

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Oliver Kellogg
tr: Emir SARI

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: olivermkellogg@gmail.com
tr: emir_sari@icloud.com

# Author name
source: RKWard Team
ar: فريق أر كي وارد
eo: RKWard Teamo
tr: RKWard Takımı

source: Graphics Device add-ons
ar: إضافات جهاز الرسوميات
eo: Aldonaĵoj pri Grafika Aparato
tr: Grafik Aygıtı Eklentileri

source: Plugins for use in graphics device (e.g. X11()) windows. Part of the official RKWard distribution
ar: إضافات للاستخدام في نوافذ جهاز الرسوميات (مثل X11()). جزء من توزيع أر كي وارد الرسمي
eo: Kromaĵoj por uzo en grafika aparato (ekz. X11()) fenestroj. Parto de la oficiala RKWard-distribuo
tr: Grafik aygıtlarda kullanmak üzere (örneğin, X11()) eklentiler. Resmi RKWard dağıtımının bir parçası

source: Export...
ar: صدّر...
eo: Eksporti...
tr: Dışa Aktar…

source: Device
ar: الجهاز
eo: Aparato
tr: Aygıt

source: Edit
ar: حرّر
eo: Redakti
tr: Düzen

# R code comment
source: The "cairo" library, providing SVG-support, is not compiled in by default on some systems.
ar: مكتبة "cairo"، التي توفّر دعم SVG، ليست مجمّعة بشكل مبدئي في بعض الأنظمة.
eo: La biblioteko "kairo", provizanta SVG-subtenon, ne estas kompilita defaŭlte en iuj sistemoj.
tr: SVG desteği sağlayan ‘cairo’ kitaplığı, bazı sistemlerde öntanımlı kurulu olarak gelmez.

source: Export the current contents of a graphics device to a postscript/pdf/png/jpeg file either using the native functions or using ghostscript.
ar: صدّر المحتويات الحالية لجهاز رسوميات إلى ملف postscript/pdf/png/jpeg باستخدام الدوال الأصلية أو باستخدام ghostscript.
eo: Eksportu la aktualan enhavon de grafika aparato al postscript/pdf/png/jpeg-dosiero aŭ uzante la denaskajn funkciojn aŭ uzante fantomskripton.
tr: Bir grafik aygıtının geçerli içeriğini, yerel işlevleri kullanarak veya ghostscript kullanarak bir postscript/pdf/png/jpeg dosyasına dışa aktarın.

source: Choose an exporting function and a filename to save to. Additional options for size and resolution etc. are also available (see below). Exporting is done using <b>dev.print</b>. For exporting using ghostscript, <b>dev2bitmap</b> is used, which needs Ghostscript. Most of the exporting parameters are directly sent to the exporting function (<b>postscript</b>, <b>pdf</b>, <b>svg</b>, <b>png</b>, or <b>jpeg</b>) by dev.print. Note that there are no 'color' options (like background or foreground color) in this plugin. This is because dev.print simply prints the current graphics (mostly on X11) to the specified file in the chosen format. To set background (or foreground) colors, these will need to be provided when calling the plotting function, mostly using <b>par</b>(). Note that all the parameters to postscript are also valid parameters to dev2bitmap.
ar: اختر دالة تصدير واسم ملف للحفظ فيه. خيارات إضافية للحجم والدقة وغيرها متوفرة (انظر أدناه). التصدير يستعمل <b>dev.print</b>. للتصدير باستخدام ghostscript، يستعمل <b>dev2bitmap</b>، الذي يتطلب Ghostscript. معظم معاملات التصدير ترسل مباشرة إلى دالة التصدير (<b>postscript</b>، <b>pdf</b>، <b>svg</b>، <b>png</b>، أو <b>jpeg</b>) بواسطة dev.print. لاحظ أنه لا توجد خيارات 'ألوان' (مثل لون الخلفية أو المقدمة) في هذا الملحق. هذا لأن dev.print يطبع ببساطة الرسوميات الحالية (في الغالب على X11) إلى الملف المحدد بالشكل المختار. لضبط ألوان الخلفية (أو المقدمة)، ينبغي توفيرها عند استدعاء دالة الرسم، في الغالب باستخدام <b>par</b>(). لاحظ أن جميع معاملات postscript هي أيضًا معاملات صالحة لـ dev2bitmap.
eo: Elektu eksportantan funkcion kaj dosiernomon por konservi. Pliaj elektebloj por grandeco kaj distingivo ktp ankaŭ estas disponeblaj (vidu sube). Eksporto estas farita per <b>dev.print</b>. Por eksporti uzante ghostscript, estas uzata <b>dev2bitmap</b>, kiu bezonas Ghostscript. La plej multaj el la eksportantaj parametroj estas rekte senditaj al la eksporta funkcio (<b>postscript</b>, <b>pdf</b>, <b>svg</b>, <b>png</b> aŭ <b>jpeg</b>) per dev.print. Rimarku, ke ne ekzistas "koloraj" opcioj (kiel fono aŭ malfono) en ĉi tiu kromaĵo. Ĉi tio estas ĉar dev.print simple presas la nunajn grafikaĵojn (plejparte sur X11) al la specifita dosiero en la elektita formato. Por agordi fonajn (aŭ antaŭajn) kolorojn, ĉi tiuj devos esti provizitaj kiam oni vokas la grafikan funkcion, plejparte uzante <b>par</b>(). Notu, ke ĉiuj parametroj al postskribaĵo ankaŭ estas validaj parametroj al dev2bitmap.
tr: Bir dışa aktarma işlevi ve kaydedilecek dosya adını seçin. Boyut ve çözünürlük vb. için ek seçenekler de kullanılabilir (aşağıya bakın). Dışa aktarma, <b>dev.print</b> kullanılarak yapılır. ghostscript kullanarak dışa aktarmak için ghostscript’e gereksinim duyan <b>dev2bitmap</b> kullanılır. Dışa aktarma parametrelerinin çoğu dev.print tarafından doğrudan dışa aktarma işlevine gönderilir (<b>postscript</b>, <b>PDF</b>, <b>SVG</b>, <b>PNG</b> veya <b>JPEG</b>). Bu eklentide ‘renk’ seçeneğinin (arka plan veya ön plan rengi gibi) bulunmadığını unutmayın. Bunun nedeni dev.print’in geçerli grafikleri (çoğunlukla X11’de) seçili biçimde belirtilen dosyaya yazdırmasıdır. Arka plan (veya ön plan) renklerini ayarlamak için çizim işlevi çağrılırken çoğunlukla <b>par</b>() kullanılarak bunların sağlanması gerekir. Postscript’in tüm parametrelerinin aynı zamanda dev2bitmap için de geçerli parametreler olduğunu unutmayın.

source: This plugin is only available in the context of a graphics device.
ar: هذا الملحق متوفر فقط في سياق جهاز رسوميات.
eo: Ĉi tiu kromaĵo disponeblas nur en la kunteksto de grafika aparato.
tr: Bu eklenti, yalnızca grafik aygıt bağlamında kullanılabilir.

source: The filename to save to. By default the file will be saved in the directory from where RkWard was started, which is the user's home directory when started from K-menu. After checking for a proper file extension, this is the <i>file</i> parameter to dev.print. For exporting via ghostscript provide a suitable extension.
ar: اسم الملف للحفظ فيه. بشكل مبدئي، يحفظ الملف في المجلد الذي بدأ منه RkWard، وهو مجلد المستخدم الرئيسي عند البدء من قائمة K. بعد التحقق من امتداد ملف مناسب، هذا هو المعامل <i>file</i> لـ dev.print. للتصدير عبر ghostscript، وفّر امتدادًا مناسبًا.
eo: La dosiernomo al kiu konservi. Defaŭlte la dosiero estos konservita en la dosierujo de kie RkWard estis komencita, kiu estas la hejma dosierujo de la uzanto kiam komencite de K-menuo. Post kontrolo de taŭga dosier-etendado, ĉi tio estas la parametro <i>dosiero</i> al dev.print. Por eksporti per ghostscript havigu taŭgan etendon.
tr: Kaydedilecek dosya adı. Öntanımlı olarak dosya, K menüsünden başlatıldığında kullanıcının ana dizini olan RkWard’ın başlatıldığı dizine kaydedilecektir. Uygun bir dosya uzantısını denetledikten sonra bu, dev.print’in <i>file</i> parametresidir. Ghostscript aracılığıyla dışa aktarmak için uygun bir uzantı sağlayın.

source: Check this box to let RKWard detect the file extension automatically. If the filename specified in the 'File name' box already has a relevant extension, then nothing is done, that is, the specified filename is used. Otherwise a relevant extension is appended to the filename above to construct the full filename. This option is disabled for exporting via ghostscript.
ar: علّم هذا المربع لـتَدَع أر كي وارد يكشف امتداد الملف آليًا. إن كان اسم الملف المحدد في مربع 'اسم الملف' يملك بالفعل امتدادًا ذا صلة، فلا يُفعل شيء، أي يستخدم اسم الملف المحدد. وإلا يلحق امتداد ذو صلة باسم الملف أعلاه لإنشاء اسم الملف الكامل. يُعطّل هذا الخيار للتصدير عبر ghostscript.
eo: Marku ĉi tiun skatolon por lasi RKWard detekti la dosier-etendon aŭtomate. Se la dosiernomo specifita en la skatolo 'Dosiernomo' jam havas koncernan etendon, tiam nenio estas farita, tio estas, la specifita dosiernomo estas uzata. Alie koncerna etendo estas almetita al la dosiernomo supre por konstrui la plenan dosiernomon. Ĉi tiu opcio estas malŝaltita por eksportado per ghostscript.
tr: RKWard’ın dosya uzantısını kendiliğinden algılamasına izin vermek için bu kutuyu işaretleyin. ‘Dosya adı’ kutusunda belirtilen dosya adı zaten ilgili bir uzantıya sahipse hiçbir şey yapılmaz, yani belirtilen dosya adı kullanılır. Aksi takdirde, tam dosya adını oluşturmak için yukarıdaki dosya adına ilgili bir uzantı eklenir. Bu seçenek, ghostscript yoluyla dışa aktarma için devre dışıdır.

source: Choose whether to use postscript, pdf, svg, png or jpeg for exporting the file. This is the <i>device</i> parameter to dev.print. If 'via Ghostscript' is chosen then the output format of the ghostscript device will need to be provided (see below under 'Ghostscript specific options').
ar: اختر سواء لـتستخدم postscript أو pdf أو svg أو png أو jpeg لتصدير الملف. هذا هو المعامل <i>device</i> لـ dev.print. إن اُختير 'عبر Ghostscript' ، ينبغي توفير شكل الخرج لجهاز ghostscript (انظر أدناه تحت 'خيارات Ghostscript الخاصة').
eo: Elektu ĉu uzi postskribo, pdf, svg, png aŭ jpeg por eksporti la dosieron. Ĉi tiu estas la parametro <i>aparato</i> al dev.print. Se 'per Ghostscript' estas elektita tiam la eligformato de la ghostscript-aparato devos esti provizita (vidu sube sub 'Ghostscript specifaj opcioj').
tr: Dosyayı dışa aktarmak için postscript, PDF, SVG, PNG veya JPEG kullanılıp kullanılmayacağını seçin. Bu, dev.print’in <i>device</i> parametresidir. ‘Ghostscript aracılığıyla’ seçilirse ghostscript aygıtının çıktı biçiminin sağlanması gerekecektir (aşağıdaki “Ghostscript’e özgü seçenekler” bölümüne bakın).

source: When exporting in postscript format, this allows you to select, whether an EPSF (.eps-file) header should be generated. This seems to generate more portable files, so is recommended in most cases. Papersize and orientation can not be set in this case. This sets the <i>onefile</i> parameter to postscript to FALSE.
ar: عند التصدير بصيغة postscript، هذا يسمح لـك لـتختار ما إذا ينبغي إنشاء ترويسة EPSF (ملف .eps). يبدو أن هذا يولّد ملفات أكثر قابلية للنقل، لذا ينصح به في معظم الحالات. لا يمكن ضبط حجم الورقة والتوجه في هذه الحالة. هذا يضبط المعامل <i>onefile</i> لـ postscript على FALSE.
eo: Kiam vi eksportas en postskribformato, tio ebligas al vi elekti ĉu EPSF (.eps-file) kaplinio estu generita. Ĉi tio ŝajnas generi pli porteblajn dosierojn, do rekomendas en la plej multaj kazoj. Papergrandeco kaj orientiĝo ne povas esti agordita en ĉi tiu kazo. Ĉi tio agordas la parametron <i>onefile</i> al postskribo al FALSO.
tr: Postscript biçiminde dışa aktarırken bu, bir EPSF (.eps dosyası) üstbilgisinin oluşturulup oluşturulmayacağına karar vermenizi sağlar. Bu, daha fazla taşınabilir dosya oluşturduğundan çoğu durumda tavsiye edilir. Bu durumda kağıt boyutu ve yönü ayarlanamaz. Bu, <i>onefile</i> parametresini postscript’e FALSE olarak ayarlar.

source: Check this box to let the export function determine the width automatically.
ar: علّم هذا المربع لـتَدَع دالة التصدير تحدد العرض آليًا.
eo: Marku ĉi tiun skatolon por ke la eksporta funkcio aŭtomate determini la larĝon.
tr: Dışa aktarma işlevinin genişliği kendiliğinden belirlemesine izin vermek için bu kutuyu işaretleyin.

source: This is similar to 'Automatic Width', but for height.
ar: هذا مشابه لـ 'العرض الآلي'، ولكن للارتفاع.
eo: Ĉi tio similas al 'Aŭtomata Larĝo', sed por alteco.
tr: Bu ‘Otomatik Genişlik’e benzerdir; ancak yükseklik içindir.

source: This is the <i>width</i> parameter to the exporting function. This is specified in inches. For JPEG/PNG exports (which require width in pixels), the actual width is evaluated by multiplying the width value provided in inches with the resolution (in dpi, 'dots per inch'). So, width_pixels = width_inches * resolution_dpi. If resolution is set to 'Default Resolution', then a value of 96 is used as the default resolution for exporting to jpeg or png and a value of 72 is used for exporting via ghostscript. Otherwise the provided resolution value is used. None of these matter for exporting to Postscript/PDF where the width parameter is provided in inches.
ar: هذا هو المعامل <i>width</i> لدالة التصدير. يحدد هذا بالبوصة. لعمليات التصدير JPEG/PNG (التي تتطلب العرض بالبكسل)، يقيم العرض الفعلي بضرب قيمة العرض المقدمة بالبوصة في الدقة (بـ dpi، 'نقطة في البوصة'). لذا، width_pixels = width_inches * resolution_dpi. إن ضُبطت الدقة على 'الدقة المبدئية'، فـيستخدم القيمة 96 كدقة مبدئية للتصدير إلى jpeg أو png وتستخدم القيمة 72 للتصدير عبر ghostscript. وإلا تستخدم قيمة الدقة المقدمة. لا يهم أي من هذه للتصدير إلى Postscript/PDF حيث يقدم معامل العرض بالبوصة.
eo: Ĉi tio estas la parametro <i>larĝo</i> al la eksportanta funkcio. Ĉi tio estas specifita en coloj. Por JPEG/PNG-eksportoj (kiuj postulas larĝon en rastrumeroj), la fakta larĝo estas taksita multobligante la larĝvaloron provizitan en coloj kun la distingivo (en dpi, 'punktoj per colo'). Do, width_pixels = width_inches * resolution_dpi. Se distingivo estas agordita al 'Defaŭlta Distingivo', tiam valoro de 96 estas uzata kiel la defaŭlta distingivo por eksporti al jpeg aŭ png kaj valoro de 72 estas uzata por eksporti per fantoma skribo. Alie la provizita distingiva valoro estas uzata. Neniu el ĉi tiuj gravas por eksporti al Postscript/PDF kie la larĝparametro estas provizita en coloj.
tr: Bu, dışa aktarma işlevinin <i>width</i> parametresidir. Bu inç türünden belirtilir. JPEG/PNG dışa aktarmaları için (piksel türünden genişlik gerektirir), gerçek genişlik, inç türünden sağlanan genişlik değerinin çözünürlükle (dpi cinsinden, ‘inç başına nokta sayısı’) çarpılmasıyla değerlendirilir. Yani; width_pixels = width_inches * resolution_dpi. Çözünürlük, ‘Öntanımlı Çözünürlük’ olarak ayarlanırsa JPEG veya PNG olarak dışa aktarma için öntanımlı çözünürlük olarak 96 değeri kullanılır ve ghostscript yoluyla dışa aktarma için 72 değeri kullanılır. Aksi takdirde sağlanan çözünürlük değeri kullanılır. Genişlik parametresinin inç olarak sağlandığı Postscript/PDF’ye dışa aktarım için bunların hiçbiri önemli değildir.

source: <b>jpeg</b> or <b>png</b> functions need at least one of width/height to be provided. We override this restriction by reading in the width (in inches) from <b>par("din")[1]</b> and then setting 'par("din")[1] * resolution' as the width (in pixels) parameter value. Again, none of these are required for exporting to Postscript/PDF.
ar: دوال <b>jpeg</b> أو <b>png</b> تحتاج لـتوفير واحد على الأقل من العرض/الارتفاع. نـتجاوز هذا القيد بـقراءة العرض (بالبوصة) من <b>par("din")[1]</b> ومن ثم نـضبط 'par("din")[1] * resolution' كقيمة لمعامل العرض (بالبكسل). مرة أخرى، لا يلزم أي من هذه للتصدير إلى Postscript/PDF.
eo: <b>jpeg</b> aŭ <b>png</b> funkcioj bezonas almenaŭ unu el larĝo/alteco por esti provizita. Ni superregas ĉi tiun limigon legante en la larĝo (en coloj) de <b>par("din")[1]</b> kaj poste fiksante 'par("din")[1] * distingivo' kiel la larĝo (en rastrumeroj) parametrovaloro. Denove, neniu el ĉi tiuj estas bezonataj por eksporti al Postscript/PDF.
tr: <b>JPEG</b> veya <b>PNG</b> işlevlerinin en az bir genişlik/yükseklik sağlaması gerekir. Bu kısıtlamayı, genişliği (inç) <b>par("din")[1]</b>’den okuyarak ve genişlik parametre değerini (piksel) ‘par("din")[1] * çözünürlük’ olarak ayarlayarak yaparız. Bunların hiçbiri Postscript/PDF dışa aktarımı için zorunlu değildir.

source: This is the <i>height</i> parameter to the exporting function. Similar to 'Width'.
ar: هذا هو المعامل <i>height</i> لدالة التصدير. مشابه لـ 'العرض'.
eo: Ĉi tio estas la parametro <i>alteco</i> al la eksporta funkcio. Simila al 'Larĝo'.
tr: Bu, dışa aktarma işlevinin <i>height</i> parametresidir. ‘width’e benzerdir.

source: This is the <i>pointsize</i> parameter to dev.print.
ar: هذا هو المعامل <i>pointsize</i> لـ dev.print.
eo: Ĉi tiu estas la parametro <i>pointsize</i> al dev.print.
tr: Bu, dev.print’in <i>pointsize</i> parametresidir.

source: Available only for PNG/JPEG/Ghostscript, this is the <i>res</i> parameter to dev.print or dev2bitmap. This value is used in converting from width/height in pixels to inches as described above (under 'Width'). The default resolution (when 'Default Resolution' is checked) is 96 for PNG/JPEG exports and it is 72 for Ghostscript exports.
ar: متوفر فقط لـ PNG/JPEG/Ghostscript، هذا هو المعامل <i>res</i> لـ dev.print أو dev2bitmap. تستخدم هذه القيمة في التحويل من العرض/الارتفاع بالبكسل إلى البوصة كما وصف أعلاه (تحت 'العرض'). الدقة المبدئية (عندما يُعلّم 'الدقة المبدئية') هي 96 لعمليات التصدير PNG/JPEG وهي 72 لعمليات التصدير Ghostscript.
eo: Havebla nur por PNG/JPEG/Ghostscript, ĉi tiu estas la parametro <i>res</i> al dev.print aŭ dev2bitmap. Ĉi tiu valoro estas uzata en konvertado de larĝo/alteco en rastrumeroj al coloj kiel priskribite supre (sub 'Larĝo'). La defaŭlta distingivo (kiam 'Defaŭlta Distingivo' estas markita) estas 96 por PNG/JPEG-eksportoj kaj ĝi estas 72 por Ghostscript-eksportoj.
tr: Yalnızca PNG/JPEG/Ghostscript için kullanılabilir; bu, dev.print veya dev2bitmap’in <i>res</i> parametresidir. Bu değer, yukarıda açıklandığı gibi (‘width’ altında) piksel türünden genişlik/yükseklik değerini inç değerine dönüştürmek için kullanılır. Öntanımlı çözünürlük (‘Öntanımlı çözünürlük’ işaretlendiğinde) PNG/JPEG dışa aktarmaları için 96’dır ve Ghostscript dışa aktarmaları için 72’dir.

source: Available only for JPEG, this is the <i>quality</i> parameter to <b>jpeg</b>. Sets the quality for JPEG exporting. The default quality is 75.
ar: متوفر فقط لـ JPEG، هذا هو المعامل <i>quality</i> لـ <b>jpeg</b>. يضبط الجودة لتصدير JPEG. الجودة المبدئية هي 75.
eo: Disponebla nur por JPEG, ĉi tiu estas la parametro <i>kvalito</i> al <b>jpeg</b>. Agordas la kvaliton por JPEG-eksportado. La defaŭlta kvalito estas 75.
tr: Yalnızca JPEG için kullanılabilir; bu, <b>jpeg</b>’in <i>kalite</i> parametresidir. JPEG dışa aktarımının kalitesini ayarlar. Öntanımlı kalite 75’tir.

source: Use this to set the papersize for export. Choose 'Default' to not specify any paper option. Other options are explained in R reference for <b>postscript</b>. This is available only for Postscript/PDF exports. This is the <i>paper</i> option to the exporting function.
ar: استخدم هذا لتضبط حجم الورقة للتصدير. اختر 'المبدئيّ' حتى لا تحدد أي خيار للورقة. الخيارات الأخرى مشروحة في مرجع R لـ <b>postscript</b>. هذا متوفر فقط لعمليات التصدير Postscript/PDF. هذا هو خيار <i>paper</i> لدالة التصدير.
eo: Uzu ĉi tion por agordi la papergrandecon por eksporto. Elektu 'Defaŭltan' por ne specifi ajnan paperan opcion. Aliaj opcioj estas klarigitaj en R-referenco por <b>postskribo</b>. Ĉi tio disponeblas nur por eksportaĵoj Postscript/PDF. Ĉi tio estas la opcio <i>papera</i> al la eksporta funkcio.
tr: Dışa aktarılacak kağıt boyutunu ayarlamak için bunu kullanın. Herhangi bir kağıt seçeneği belirtmemek için ‘Öntanımlı’yı seçin. Diğer seçenekler <b>postscript</b> için R başvurusunda açıklanmıştır. Bu yalnızca Postscript/PDF dışa aktarmaları için kullanılabilir. Bu, dışa aktarma işlevinin <i>paper</i> seçeneğidir.

source: Uncheck this for NOT centering the image on the page. This is the <i>pagecentre</i> parameter.
ar: ألغِ تعليم هذا حتى لا توسط الصورة على الصفحة. هذا هو المعامل <i>pagecentre</i>.
eo: Malmarku ĉi tion por NE centri la bildon sur la paĝo. Ĉi tio estas la parametro <i>pagecentre</i>.
tr: Görseli sayfada ortalamamak için bu seçeneğin işaretini kaldırın. Bu, <i>pagecentre</i> parametresidir.

source: Available only for Postscript/Ghostscript exporting, this is the <i>horizontal</i> parameter.
ar: متوفر فقط لتصدير Postscript/Ghostscript، هذا هو المعامل <i>horizontal</i>.
eo: Havebla nur por eksportado de Postscript/Ghostscript, ĉi tiu estas la <i>horizontala</i> parametro.
tr: Yalnızca Postscript/Ghostscript dışa aktarımı için kullanılabilir, bu <i>horizontal</i> parametresidir.

source: This is the <i>family</i> parameter to <b>postscript</b>. Be sure to choose a family that is available on the machine. The 'URW' class of font families require ghostscript. When in doubt leave this as 'Default', the default family (Helvectica) will be used. See the R reference on postscript for more details.
ar: هذا هو المعامل <i>family</i> لـ <b>postscript</b>. تأكّد لـتختار عائلة متوفرة على الحاسوب. تتطلب فئة عائلات الخطوط 'URW' ghostscript. عند الشك، اترك هذا كـ 'المبدئيّ'، ستستخدم العائلة المبدئية (Helvectica). انظر مرجع R حول postscript لمزيد من التفاصيل.
eo: Ĉi tio estas la <i>familio</i> parametro al <b>postskribo</b>. Nepre elektu familion disponeblan en la maŝino. La 'URW' klaso de tiparfamilioj postulas fantoman skribaĵon. Se vi dubas lasu ĉi tion kiel 'Defaŭlta', la defaŭlta familio (Helvectica) estos uzata. Vidu la R-referencon en postskribo por pliaj detaloj.
tr: Bu, <b>postscript</b>’in <i>family</i> parametresidir. Makinede kullanılabilir olan bir aileyi seçtiğinizden emin olun. Yazıtipi ailelerinin ‘URW’ sınıfı ghostscript gerektirir. Kuşkuya düştüğünüzde bunu ‘Öntanımlı’ olarak bırakın, öntanımlı aile (Helvetica) kullanılacaktır. Daha fazla ayrıntı için postscript’teki R başvurusuna bakın.

source: This is the <i>encoding</i> parameter to <b>postscript</b>. Be sure to choose an encoding compatible with the chosen font family. When in doubt leave this as 'Default', the default encoding (ISOLatin1) will be used. See the R reference on postscript for more details.
ar: هذا هو المعامل <i>encoding</i> لـ <b>postscript</b>. تأكّد لـتختار ترميزًا متوافقًا مع عائلة الخط المختارة. عند الشك، اترك هذا كـ 'المبدئيّ'، سيستخدم الترميز المبدئي (ISOLatin1). انظر مرجع R حول postscript لمزيد من التفاصيل.
eo: Ĉi tio estas la <i>kodigo</i> parametro al <b>postscript</b>. Nepre elektu kodigon kongruan kun la elektita tiparfamilio. Se vi dubas lasu ĉi tion kiel 'Defaŭlta', la defaŭlta kodado (ISOLatin1) estos uzata. Vidu la R-referencon en postskribo por pliaj detaloj.
tr: Bu, <b>postscript</b>’in <i>encoding</i> parametresidir. Seçili yazıtipi ailesiyle uyumlu bir kodlama seçtiğinizden emin olun. Kuşkuya düştüğünüzde bunu ‘Öntanımlı’ olarak bırakın, öntanımlı kodlama (ISOLatin1) kullanılacaktır. Daha fazla ayrıntı için postscript’teki R başvurusuna bakın.

source: Uncheck this box, to specify a custom title to the graphics file. Note that this is not displayed on the plot, but rather it is embedded inside the graphics file. This is the <i>title</i> parameter to <b>postscript</b>.
ar: ألغِ تعليم هذا المربع، لـتحدد عنوانًا مخصصًا لملف الرسوميات. لاحظ أن هذا لا يعرض على الرسم، بل هو مضمن داخل ملف الرسوميات. هذا هو المعامل <i>title</i> لـ <b>postscript</b>.
eo: Malmarku ĉi tiun skatolon, por specifi propran titolon al la grafika dosiero. Notu, ke ĉi tio ne estas montrata en la grafiko, sed prefere ĝi estas enigita en la grafika dosiero. Ĉi tio estas la parametro <i>titolo</i> al <b>postskribo</b>.
tr: Grafik dosyasına özel bir başlık belirtmek için bu kutunun işaretini kaldırın. Bunun çizimde görüntülenmediğini, bunun yerine grafik dosyasının içine gömüldüğünü unutmayın. Bu, <b>postscript</b>’in <i>title</i> parametresidir.

source: File format to use. Only the most common ones are listed, but many more are supported by ghostscript. Select "Other" and see the option below to use these formats.
ar: صيغة الملف للاستخدام. فقط الأكثر شيوعًا مسرودة، ولكن ghostscript يدعم الكثير غيرها. اختر "أخرى" وانظر الخيار أدناه لتستخدم هذه الصيغ.
eo: Dosiera formato por uzi. Nur la plej oftaj estas listigitaj, sed multaj pli estas subtenataj de ghostscript. Elektu "Aliaj" kaj vidu la opcion sube por uzi ĉi tiujn formatojn.
tr: Kullanılacak dosya biçimi. Yalnızca en yaygın olanları listelenmiştir; ancak çok daha fazlası ghostscript tarafından desteklenmektedir. ‘Diğer’i seçin ve bu biçimleri kullanmak için aşağıdaki seçeneğe bakın.
