Repository: KDE/rkward
Catalog: po/*/rkward.po
Languages: ar, ru, tr

source: <p>The preview feature <b>tries</b> to avoid making any lasting changes to your workspace (technically, by making use of a <i>local()</i> evaluation environment). <b>However, there are cases where using the preview feature may cause unexpected side-effects</b>.</p><p>In particular, this is the case for scripts that contain explicit assignments to <i>globalenv()</i>, or to scripts that alter files on your filesystem. Further, attaching/detaching packages or package namespaces will affect the entire running R session.</p><p>Please keep this in mind when using the preview feature, and especially when using the feature on scripts originating from untrusted sources.</p>
ru: <p>Функция предварительного просмотра <b>пытается</b> предотвратить внесение каких-либо постоянных изменений в рабочую область (технически это делается следующим образом: используется вычислительное окружение <i>local()</i>). <b>Тем не менее, в некоторых случаях использование функции предварительного просмотра может привести к неожиданным побочным эффектам</b>.</p><p>В частности, так происходит при работе со сценариями, которые содержат явные привязки к <i>globalenv()</i> или к сценариям, которые изменяют файлы в файловой системе. Более того, присоединение или отсоединение пакетов или пространств имён пакетов повлияет на весь запущенный сеанс R.</p><p>Учитывайте это при использовании функции предварительного просмотра (особенно тогда, когда применяете её для сценариев из недоверенных источников).</p>
tr: <p>Önizleme özelliği, çalışma alanınızda kalıcı değişiklikler yapmaktan kaçınmayı <b>dener</b> (teknik olarak, <i>local()</i> değerlendirme ortamını kullanarak). <b>Ancak önizleme özelliğini kullanmanın beklenmeyen yan etkilere neden olabileceği durumlar da vardır</b>.</p><p>Bu durum özellikle <i>globalenv()</i>’ye açık atamalar içeren betikler veya dosya sisteminizdeki dosyaları değiştiren betikler için geçerlidir. Ayrıca paketleri veya paket ad alanlarını eklemek/çıkarmak, çalışan R oturumunun tümünü etkileyecektir.</p><p>Önizleme özelliğini kullanırken ve özellikle de bu özelliği güvenilmeyen kaynaklardan gelen betiklerde kullanırken lütfen bunu aklınızda bulundurun.</p>

# Caption: Some software is missing.
source: Missing software
ru: Отсутствует программное обеспечение
tr: Yazılımlar eksik

source: The software <tt>pandoc</tt>, required to rendering R markdown files, is not installed, or not in the system path of the running R session. You will need to install pandoc from <a href="https://pandoc.org/">https://pandoc.org/</a>.</br>If it is installed, but cannot be found, try adding it to the system path of the running R session at <a href="rkward://settings/rbackend">Settings->Configure RKward->R-backend</a>.
ru: Программное обеспечение <tt>pandoc</tt>, необходимое для обработки файлов разметки R, не установлено или не находится по системному пути запущенного сеанса R. Необходимо установить pandoc с веб-сайта <a href="https://pandoc.org/">https://pandoc.org/</a>.</br>Если программное обеспечение установлено, но его не удаётся найти, попробуйте добавить каталог с ним к системному пути запущенного сеанса R: <a href="rkward://settings/rbackend">«Настройка -> Настроить RKward-> Серверное приложение R»</a>.
tr: R Markdown dosyalarını oluşturmak için gereken <tt>pandoc</tt> yazılımı kurulu değil veya çalışan R oturumunun sistem yolunda değil. <a href="https://pandoc.org/">https://pandoc.org/</a> adresinden pandoc’u kurmanız gerekir.</br>Kurulurysa; ancak bulunamıyorsa, <a href="rkward://settings/rbackend">Ayarlar → RKward Uygulamasını Yapılandır → R Arka Ucu</a> konumuna gidip çalışan R oturumunun sistem yoluna eklemeyi deneyin.

source: Preview the script as rendered from RMarkdown format (.Rmd) to HTML.
ru: Предварительный просмотр сценария (преобразование из RMarkdown (.Rmd) в HTML).
tr: Betiği, RMarkdown biçiminden (.Rmd) HTML’ye önizleyin.

source: R Markdown (auto)
ru: R Markdown (автоматически)
tr: R Markdown (Kendiliğinden)

source: Preview the script as rendered from RMarkdown format (.Rmd) to the format specified in the document header.
ru: Предварительный просмотр сценария (преобразование из RMarkdown (.Rmd) в формат, указанный в заголовке документа).
tr: Betiği RMarkdown Biçiminden (.rmd) belge üstbilgisinde belirtilen biçime önizleyin.

source: Output %1
ru: Вывод %1
tr: %1 çıktısı
