Repository: KDE/rkward
Catalog: po/*/rkward__embedded.po
Languages: ar, eo, ru, tr

source: Size of left margin. Size is specified in (approximate) line heights.
ar: حجم الهامش الأيسر. يُحدّد الحجم بارتفاعات الأسطر (التقريبية).
eo: Grandeco de maldekstra rando. Grando estas specifita en (proksimuma) linioaltoj.
ru: Размер левого поля. Размер указывается в (примерных) высотах строки.
tr: Sol kenar boşluğunun boyutu. Boyut (yaklaşık) satır yükseklikleriyle belirtilir.

source: Size of right margin. Size is specified in (approximate) line heights.
ar: حجم الهامش الأيمن. يُحدّد الحجم بارتفاعات الأسطر (التقريبية).
eo: Grandeco de dekstra rando. Grando estas specifita en (proksimuma) linioaltoj.
ru: Размер правого поля. Размер указывается в (примерных) высотах строки.
tr: Sağ kenar boşluğunun boyutu. Boyut (yaklaşık) satır yükseklikleriyle belirtilir.

source: Uncheck this box to avoid drawing the X axis. This is the <i>xaxt</i> argument to par. See R reference on <b>par</b>.
ar: أزل علامة من هذا المربع لتجنب رسم المحور س. هذا هو الوسيط <i>xaxt</i> لـ par. انظر دليل R على <b>par</b>.
eo: Malmarku ĉi tiun skatolon por eviti desegni la X-akson. Jen la <i>xaxt</i> argumento al par. Vidu R-referencon sur <b>par</b>.
ru: Снимите этот флажок, чтобы не рисовать ось X. Это аргумент <i>xaxt</i> par. Смотрите справку R по <b>par</b>.
tr: X eksenini çizmekten kaçınmak için bu kutunun işaretini kaldırın. Bu par’ın <i>xaxt</i> argümanıdır. <b>par</b> üzerine olan R başvurusuna bakın.

source: Uncheck this box to avoid drawing the Y axis. This is the <i>yaxt</i> argument to par. See R reference on <b>par</b>.
ar: أزل علامة من هذا المربع لتجنب رسم المحور ص. هذا هو الوسيط <i>yaxt</i> لـ par. انظر دليل R على <b>par</b>.
eo: Malmarku ĉi tiun skatolon por eviti desegni la Y-akson. Jen la <i>yaxt</i> argumento al par. Vidu R-referencon sur <b>par</b>.
ru: Снимите этот флажок, чтобы не рисовать ось Y . Это аргумент <i>yaxt</i> par. Смотрите справку R по <b>par</b>.
tr: Y eksenini çizmekten kaçınmak için bu kutunun işaretini kaldırın. Bu par’ın <i>yaxt</i> argümanıdır. <b>par</b> üzerine olan R başvurusuna bakın.

source: This specifies the <i>log</i> argument to plot.default. Check this box to set <i>log="x"</i>. See R reference on <b>plot.default</b>.
ar: هذا يحدد الوسيط <i>log</i> لـ plot.default. ضع علامة على هذا المربع لضبط <i>log="x"</i>. انظر دليل R على <b>plot.default</b>.
eo: Ĉi tio specifas la argumenton <i>log</i> al plot.default. Marku ĉi tiun skatolon por agordi <i>log="x"</i>. Vidu R-referencon sur <b>plot.default</b>.
ru: Указывает аргумент <i>log</i> функции plot.default. Установите этот флажок, чтобы задать значение <i>log="x"</i>. Смотрите справку R по <b>plot.default</b>.
tr: Bu, plot.default’a <i>log</i> argümanını belirtir. <i>log="x"</i>’i ayarlamak için bu kutuyu işaretleyin. <b>plot.default</b> üzerine olan R başvurusuna bakın.

source: This specifies the <i>log</i> argument to plot.default. Check this box to set <i>log="y"</i>. Check both the boxes to set <i>log="xy"</i>. See R reference on <b>plot.default</b>.
ar: هذا يحدد الوسيط <i>log</i> لـ plot.default. ضع علامة على هذا المربع لضبط <i>log="y"</i>. ضع علامة على كلا المربعين لضبط <i>log="xy"</i>. انظر دليل R على <b>plot.default</b>.
eo: Ĉi tio specifas la argumenton <i>log</i> al plot.default. Marku ĉi tiun skatolon por agordi <i>log="y"</i>. Marku ambaŭ la skatolojn por agordi <i>log="xy"</i>. Vidu R-referencon sur <b>plot.default</b>.
ru: Указывает аргумент <i>log</i> функции plot.default. Установите этот флажок, чтобы задать значение <i>log="y"</i>. Установите оба флажка, чтобы задать значение <i>log="xy"</i>. Смотрите справку R по <b>plot.default</b>.
tr: Bu, plot.default’a <i>log</i>argümanını belirtir. <i>log="y"</i>’yi ayarlamak için bu kutuyu işaretleyin. <i>log="xy"</i>’yi ayarlamak için her iki kutuyu da işaretleyin. <b>plot.default</b> üzerine olan R başvurusuna bakın.

source: The X and Y axis labels. These are the <i>xlab</i> and <i>ylab</i> arguments to <b>plot.default</b>, respectively. The checkboxes enable or disable the labels being evaluated as literal (quoted) strings. To achieve a line-break (in a quoted string), enter '\n'.
ar: لصائق المحور س و ص. هذه هي الوسائط <i>xlab</i> و <i>ylab</i> لـ <b>plot.default</b>، على التوالي. تُمكّن مربعات الاختيار أو تعطّل لصائق يُقيّم أنها سلاسل نصية حرفية (مقتبسة). لتحقيق فاصل أسطر (في سلسلة نصية مقتبسة)، أدخل '\n'.
eo: La X kaj Y-akso-etikedoj. Ĉi tiuj estas la <i>xlab</i> kaj <i>ylab</i> argumentoj al <b>plot.default</b> respektive. La markobutonoj ebligas aŭ malŝaltas la etikedojn taksitajn kiel laŭvortajn (cititajn) ĉenojn. Por atingi linio-rompon (en citita ĉeno), enigu '\n'.
ru: Подписи осей X и Y. Это, соответственно, аргументы <i>xlab</i> и <i>ylab</i> функции <b>plot.default</b>. Флажки включают или отключают обработку подписей как текстовых (закавыченных) строк. Чтобы добавить разрыв строки (в закавыченной строке), введите «\n».
tr: X ve Y ekseni etiketleri. Bunlar sırasıyla <b>plot.default</b>’un <i>xlab</i> ve <i>ylab</i> argümanlarıdır. Onay kutuları, düz (tırnak içinde) diziler olarak değerlendirilen etiketleri etkinleştirir veya devre dışı bırakır. Satır sonu elde etmek için (tırnak içine alınmış bir dizide) ‘\n’ girin.

source: The X and Y axis limits. These are the <i>xlim</i> and <i>ylim</i> arguments to <b>plot.default</b> respectively. For automatic evaluation of the limits, leave these blank.
ar: حدود المحور س و ص. هذه هي الوسائط <i>xlim</i> و <i>ylim</i> لـ <b>plot.default</b> على التوالي. لتقييم آلي للحدود، اتركها فارغة.
eo: La X kaj Y-akso limoj. Ĉi tiuj estas la <i>xlim</i> kaj <i>ylim</i> argumentoj al <b>plot.default</b> respektive. Por aŭtomata taksado de la limoj, lasu ĉi tiujn malplenajn.
ru: Ограничения для осей X и Y. Это, соответственно, аргументы <i>xlim</i> и <i>ylim</i> функции <b>plot.default</b>. Для автоматической установки ограничений оставьте эти поля пустыми.
tr: X ve Y ekseni sınırları. Bunlar sırasıyla <b>plot.default</b>’un <i>xlim</i> ve <i>ylim</i> argümanlarıdır. Sınırların kendiliğinden değerlendirilmesi için bunları boş bırakın.

source: Choose one of the listed point/line types for the plot. To let the calling function use its default plotting type, choose the 'default' option. This is the <i>type</i> argument to <b>plot.default</b>.
ar: اختر واحدًا من أنواع النقط/الخطوط المدرجة للرسم. للسماح للدالة المستدعِي باستخدام نوع الرسم مبدئي الخاص بها، اختر الخيار 'مبدئي'. هذا هو الوسيط <i>type</i> لـ <b>plot.default</b>.
eo: Elektu unu el la listigitaj punkto/liniotipoj por la grafiko. Por lasi la alvokan funkcion uzi sian defaŭltan grafikan tipon, elektu la opcion 'defaŭlta'. Ĉi tiu estas la argumento <i>tipo</i> al <b>plot.default</b>.
ru: Выберите в списке один из типов точек или линий графика. Чтобы вызывающая функция использовала стандартный тип, выберите вариант «по умолчанию». Это аргумент <i>type</i> функции <b>plot.default</b>.
tr: Grafik için listelenen nokta/çizgi türlerinden birini seçin. Çağıran işlevin öntanımlı çizim türünü kullanmasına izin vermek için ‘öntanımlı’ seçeneğini seçin. Bu, <b>plot.default</b>’un <i>type</i> argümanıdır.

source: Choose one of the listed point/line colors for the plot. To let the calling function use its default plotting color, choose the 'default' option. This is the <i>col</i> argument to <b>plot.default</b>.
ar: اختر واحدًا من ألوان النقط/الخطوط المدرجة للرسم. للسماح للدالة المستدعِي باستخدام لون الرسم مبدئي الخاص بها، اختر الخيار 'مبدئي'. هذا هو الوسيط <i>col</i> لـ <b>plot.default</b>.
eo: Elektu unu el la listigitaj punkto/liniaj koloroj por la grafiko. Por lasi la alvokan funkcion uzi sian defaŭltan grafikan koloron, elektu la opcion 'defaŭlta'. Ĉi tiu estas la argumento <i>col</i> al <b>plot.default</b>.
ru: Выберите в списке один из цветов точек или линий графика. Чтобы вызывающая функция использовала стандартный цвет, выберите вариант «по умолчанию». Это аргумент <i>col</i> функции <b>plot.default</b>.
tr: Çizim için listelenen nokta/çizgi renklerinden birini seçin. Çağıran işlevin öntanımlı çizim rengini kullanmasına izin vermek için ‘öntanımlı’ seçeneğini seçin. Bu, <b>plot.default</b>’un <i>col</i> argümanıdır.

source: This is the <i>asp</i> argument to <b>plot.default</b>.
ar: هذا هو الوسيط <i>asp</i> لـ <b>plot.default</b>.
eo: Ĉi tiu estas la <i>asp</i> argumento al <b>plot.default</b>.
ru: Это аргумент <i>asp</i> функции <b>plot.default</b>.
tr: Bu, <b>plot.default</b>’un <i>asp</i> argümanıdır.

source: Check this box to add a grid to the current plot. For various grid options see <link href="rkward://component/x11grid"/>. Note that these options are not for <b>plot.default</b> but rather for the function <b>grid</b>. For this to be functional the embedding plugin should implement it internally.
ar: ضع علامة على هذا المربع لإضافة شبكة إلى الرسم الحالي. لخيارات الشبكة المتنوعة، انظر <link href="rkward://component/x11grid"/>. لاحظ أن هذه الخيارات ليست لـ <b>plot.default</b> بل هي للدالة <b>grid</b>. لكي تكون هذه وظيفية، يجب أن يطبقها الملحق المضمِّن داخليًا.
eo: Marku ĉi tiun skatolon por aldoni kradon al la nuna grafiko. Por diversaj kradaj elektoj vidu <link href="rkward://component/x11grid"/>. Notu, ke ĉi tiuj elektebloj ne estas por <b>plot.default</b> sed prefere por la funkcio <b>krado</b>. Por ke ĉi tio estu funkcia, la eniga kromaĵo devus efektivigi ĝin interne.
ru: Установите этот флажок, чтобы добавить к текущему графику сетку. Описание различных параметров сетки приводится здесь: <link href="rkward://component/x11grid"/>. Обратите внимание, что эти параметры предназначены не для <b>plot.default</b>, а для функции <b>grid</b>. Чтобы эта возможность работала, она должна быть реализована модулем встраивания.
tr: Geçerli grafiğe ızgara eklemek için bu kutuyu işaretleyin. Çeşitli ızgara seçenekleri için <link href="rkward://component/x11grid"/> bölümüne bakın. Bu seçeneklerin <b>plot.default</b> için değil, <b>grid</b> işlevi için olduğunu unutmayın. Bunun işlevsel olabilmesi için yerleştirme eklentisinin bunu içsel olarak uygulaması gerekir.

source: <i>xvar</i>: The variable to be used for the x-coordinates.
ar: <i>xvar</i>: المتغير الذي يجب استخدامه لإحداثيات س.
eo: <i>xvar</i>: La variablo uzota por la x-koordinatoj.
ru: <i>xvar</i>: переменная для x-координат.
tr: <i>xvar</i>: X koordinatları için kullanılacak değişken.

source: <i>yvar</i>: The variable to be used for the y-coordinates.
ar: <i>yvar</i>: المتغير الذي يجب استخدامه لإحداثيات ص.
eo: <i>yvar</i>: La variablo uzota por la y-koordinatoj.
ru: <i>yvar</i>: переменная для y-координат.
tr: <i>yvar</i>: Y koordinatları için kullanılacak değişken.

source: <i>default_pointtype</i>: A string that provides the default point type when the user chooses 'Default' for '<label id="pointtype"/>'. The possibilities are p,l,b,o,h,s and S; the options for the <i>type</i> argument.
ar: <i>default_pointtype</i>: سلسلة نصية توفر نوع النقطة مبدئي عندما يختار المستخدم 'مبدئي' لـ '<label id="pointtype"/>'. الاحتمالات هي p و l و b و o و h و s و S؛ خيارات الوسيط <i>type</i>.
eo: <i>default_pointtype</i>: Ĉeno kiu provizas la defaŭltan punktotipo kiam la uzanto elektas 'Defaŭlta' por '<label id="pointtype"/>'. La eblecoj estas p,l,b,o,h,s kaj S; la elektebloj por la argumento <i>tipo</i>.
ru: <i>default_pointtype</i>: строка, предоставляющая стандартный тип точек, когда пользователь выбирает значение «По умолчанию» для параметра «<label id="pointtype"/>». Возможные варианты: p,l,b,o,h,s и S; параметры для аргумента <i>type</i>.
tr: <i>default_pointtype</i>: Kullanıcı ‘<label id="pointtype"/>’ için ‘Öntanımlı’yı seçtiğinde öntanımlı nokta türünü sağlayan bir dizi. Olasılıklar p,l,b,o,h,s ve S’dir; bu, <i>type</i> argümanına ilişkin seçeneklerdir.

source: <i>default_pointcolor</i>: A string that provides the default point color when the user chooses 'Default' for '<label id="pointcolor"/>'. For various possibilities see the code color_chooser.xml; the options for the <i>col</i> argument.
ar: <i>default_pointcolor</i>: سلسلة نصية توفر لون النقطة مبدئي عندما يختار المستخدم 'مبدئي' لـ '<label id="pointcolor"/>'. للاحتمالات المختلفة، انظر الرمز color_chooser.xml؛ خيارات الوسيط <i>col</i>.
eo: <i>default_pointcolor</i>: Ĉeno kiu provizas la defaŭltan punktokoloron kiam la uzanto elektas 'Defaŭltan' por '<label id="pointcolor"/>'. Por diversaj eblecoj vidu la kodon color_chooser.xml; la opcioj por la argumento <i>kol</i>.
ru: <i>default_pointcolor</i>: строка, предоставляющая стандартный цвет точек, когда пользователь выбирает значение «По умолчанию» для параметра «<label id="pointcolor"/>». С перечнем возможных вариантов можно ознакомиться с помощью кода color_chooser.xml; параметры для аргумента <i>col</i>.
tr: <i>default_pointcolor</i>: Kullanıcı ‘<label id="pointcolor"/>’ için ‘Öntanımlı’yı seçtiğinde öntanımlı nokta rengini sağlayan bir dizi. Çeşitli olasılıklar için color_chooser.xml koduna bakın; bu, <i>col</i> argümanının seçenekleridir.

source: <i>default_main</i>: A string specifying the <i>main</i> argument to <b>plot.default</b>. By default this is "" which means that the main title generated by the plotting function is used. Note: The default is always used unquoted. If you want to specify a literal string add quotes, explicitly, as "&amp;<i>quote;</i>".
ar: <i>default_main</i>: سلسلة نصية تحدد الوسيط <i>main</i> لـ <b>plot.default</b>. مبدئيا هذا هو "" مما يعني استخدام العنوان الرئيسي المولّد بواسطة دالة الرسم. ملاحظة: مبدئيًا، يُستعمل دائمًا غير مقتبس. إذا أردت تحديد سلسلة نصية حرفية، أضف اقتباسات، بشكل صريح، كـ "&amp;<i>quote;</i>".
eo: <i>default_main</i>: Ĉeno specifanta la argumenton <i>ĉefa</i> al <b>plot.default</b>. Defaŭlte tio estas "" kio signifas, ke la ĉefa titolo generita de la grafika funkcio estas uzata. Noto: La defaŭlto ĉiam estas uzata necitita. Se vi volas specifi laŭvortan ĉenon aldonu citilojn, eksplicite, kiel "&amp;<i>citaĵo;</i>".
ru: <i>default_main</i>: строка, указывающая аргумент <i>main</i> функции <b>plot.default</b>. Значение по умолчанию, "", означает, что основной заголовок будет создан функцией построения графика. Примечание: значение по умолчанию всегда используется без кавычек. Чтобы указать текстовую строку, необходимо добавить кавычки, вот так: "&amp;<i>quote;</i>".
tr: <i>default_main</i>: <b>plot.default</b> için <i>main</i> argümanını belirten bir dizi. Öntanımlı olarak bu "" şeklindedir; bu, çizim işlevi tarafından oluşturulan ana başlığın kullanıldığı anlamına gelir. Not: Öntanımlı her zaman tırnak içine alınmadan kullanılır. Bir düz dizi belirtmek istiyorsanız açıkça "&amp;<i>quote;</i>" şeklinde tırnak işaretleri ekleyin.

source: <i>default_sub</i>: Similar to <i>main</i> above but for the subtitle argument <i>sub</i>.
ar: <i>default_sub</i>: مشابه لـ <i>main</i> أعلاه ولكن لوسيط العنوان الفرعي <i>sub</i>.
eo: <i>default_sub</i>: Simile al <i>ĉefa</i> supre sed por la subtitola argumento <i>sub</i>.
ru: <i>default_sub</i>: аналогично <i>main</i> выше, но используется для аргумента подзаголовка <i>sub</i>.
tr: <i>default_sub</i>: Yukarıdaki <i>main</i>’e benzer ancak alt başlık argümanı <i>sub</i> içindir.

source: <i>default_xlab</i>: Similar to <i>main</i> above but for the X-label argument <i>xlab</i>.
ar: <i>default_xlab</i>: مشابه لـ <i>main</i> أعلاه ولكن لوسيط لصيقة س <i>xlab</i>.
eo: <i>default_xlab</i>: Simile al <i>ĉefa</i> supre sed por la X-etikedo argumento <i>xlab</i>.
ru: <i>default_xlab</i>: аналогично <i>main</i> выше, но используется для аргумента подписи X <i>xlab</i>.
tr: <i>default_xlab</i>: Yukarıdaki <i>main</i>’e benzer; ancak X etiketi argümanı <i>xlab</i> içindir.

source: <i>default_ylab</i>: Similar to <i>main</i> above but for the Y-label argument <i>ylab</i>.
ar: <i>default_ylab</i>: مشابه لـ <i>main</i> أعلاه ولكن لوسيط لصيقة ص <i>ylab</i>.
eo: <i>default_ylab</i>: Simile al <i>ĉefa</i> supre sed por la Y-etikedo argumento <i>ylab</i>.
ru: <i>default_ylab</i>: аналогично <i>main</i> выше, но используется для аргумента подписи Y <i>ylab</i>.
tr: <i>default_xlab</i>: Yukarıdaki <i>main</i>’e benzer; ancak Y etiketi argümanı <i>ylab</i> içindir.

source: <i>allow_log</i>: Setting this to "true" ("false") enables (disables) the display of '<label id="xlog"/>' and '<label id="ylog"/>' check boxes.
ar: <i>allow_log</i>: ضبط هذا على "true" ("false") يمكّن (يعطّل) عرض مربعات الاختيار '<label id="xlog"/>' و '<label id="ylog"/>'.
eo: <i>allow_log</i>: Agordi ĉi tion al "vera" ("falsa") ebligas (malŝaltas) la montradon de '<label id="xlog"/>' kaj '<label id= "ylog"/>' markobutonoj.
ru: <i>allow_log</i>: установка в значение «true» («false») включает (отключает) отображение флажков «<label id="xlog"/>» и «<label id="ylog"/>».
tr: <i>allow_log</i>: Bunu "true" ("false") olarak ayarlamak, ‘<label id="xlog"/>’ ve ‘<label id="ylog"/>’ onay kutularının görüntülenmesini etkinleştirir (devre dışı bırakır).

source: <i>allow_xlim</i>: Setting this to "true" ("false") enables (disables) the display of '<label id="xminvalue"/>' and '<label id="xmaxvalue"/>' input boxes.
ar: <i>allow_xlim</i>: ضبط هذا على "true" ("false") يمكّن (يعطّل) عرض مربعات الإدخال '<label id="xminvalue"/>' و '<label id="xmaxvalue"/>'.
eo: <i>allow_xlim</i>: Agordi ĉi tion al "true" ("false") ebligas (malŝaltas) la montradon de '<label id="xminvalue"/>' kaj '<label id= "xmaxvalue"/>' enigoskatoloj.
ru: <i>allow_xlim</i>: установка в значение «true» («false») включает (отключает) отображение полей ввода «<label id="xminvalue"/>» и «<label id="xmaxvalue"/>».
tr: <i>allow_xlim</i>: Bunu "true" ("false") olarak ayarlamak, ‘<label id="xminvalue"/>’ ve ‘<label id="xmaxvalue"/>’ girdi kutularının görüntülenmesini etkinleştirir (devre dışı bırakır).

source: <i>allow_ylim</i>: Setting this to "true" ("false") enables (disables) the display of '<label id="yminvalue"/>' and '<label id="ymaxvalue"/>' input boxes.
ar: <i>allow_ylim</i>: ضبط هذا على "true" ("false") يمكّن (يعطّل) عرض مربعات الإدخال '<label id="yminvalue"/>' و '<label id="ymaxvalue"/>'.
eo: <i>allow_ylim</i>: Agordi ĉi tion al "true" ("false") ebligas (malŝaltas) la montradon de '<label id="yminvalue"/>' kaj '<label id= "ymaxvalue"/>' enigoskatoloj.
ru: <i>allow_ylim</i>: установка в значение «true» («false») включает (отключает) отображение полей ввода «<label id="yminvalue"/>» и «<label id="ymaxvalue"/>».
tr: <i>allow_ylim</i>: Bunu "true" ("false") olarak ayarlamak, ‘<label id="yminvalue"/>’ ve ‘<label id="ymaxvalue"/>’ girdi kutularının görüntülenmesini etkinleştirir (devre dışı bırakır).

source: <i>allow_type</i>: Setting this to "true" ("false") enables (disables) the display of the '<label id="pointtypepage"/>' tab.
ar: <i>allow_type</i>: ضبط هذا على "true" ("false") يمكّن (يعطّل) عرض لسان '<label id="pointtypepage"/>'.
eo: <i>allow_type</i>: Agordi ĉi tion al "vera" ("falsa") ebligas (malŝaltas) la montradon de la langeto '<label id="pointtypepage"/>'.
ru: <i>allow_type</i>: установка в значение «true» («false») включает (отключает) отображение вкладки «<label id="pointtypepage"/>».
tr: <i>allow_type</i>: Bunu "true" ("false") olarak ayarlamak, ‘<label id="pointtypepage"/>’ sekmesinin görüntülenmesini etkinleştirir (devre dışı bırakır).

source: <i>allow_aspect</i>: Setting this to "true" ("false") enables (disables) the display of the '<label id="aspectratio"/>' tab.
ar: <i>allow_aspect</i>: ضبط هذا على "true" ("false") يمكّن (يعطّل) عرض لسان '<label id="aspectratio"/>'.
eo: <i>allow_aspect</i>: Agordi ĉi tion al "vera" ("falsa") ebligas (malŝaltas) la montradon de la langeto '<label id="aspectratio"/>'.
ru: <i>allow_aspect</i>: установка в значение «true» («false») включает (отключает) отображение вкладки «<label id="aspectratio"/>».
tr: <i>allow_aspect</i>: Bunu "true" ("false") olarak ayarlamak, ‘<label id="aspectratio"/>’ sekmesinin görüntülenmesini etkinleştirir (devre dışı bırakır).

source: <i>allow_grid</i>: Setting this to "true" ("false") enables (disables) the display of the '<label id="tab_grid"/>' tab. If "true", the actual code for grid options can be extracted from code.calculate (see below) which in turn extracts it from grid_options.code.printout. Specifically, if the plot options plugin is embedded using an <i>id="plot_options"</i> then the following call:<br> printIndented ("\t", getRK_val ("plot_options.code.calculate"));</br><br> after the plotting function should do the job.</br>
ar: <i>allow_grid</i>: ضبط هذا على "true" ("false") يمكّن (يعطّل) عرض لسان '<label id="tab_grid"/>'. إذا "true"، يمكن استخراج الرمز الفعلي لخيارات الشبكة من code.calculate (انظر أدناه) والذي يستخرجه بدوره من grid_options.code.printout. على وجه التحديد، إذا ضُمّن ملحق خيارات الرسم باستخدام <i>id="plot_options"</i> فعندئذ الاستدعاء التالي:<br> printIndented ("\t", getRK_val ("plot_options.code.calculate"));</br><br> بعد دالة الرسم يجب أن يقضي الحاجة.</br>
eo: <i>allow_grid</i>: Agordi ĉi tion al "true" ("false") ebligas (malŝaltas) la montradon de la langeto '<label id="tab_grid"/>'. Se "vera", la fakta kodo por kradaj elektoj povas esti eltirita el code.calculate (vidu malsupre) kiu siavice ĉerpas ĝin el grid_options.code.printout. Specife, se la aldonaĵo de grafik-elektebloj estas enigitaj uzante <i>id="plot_options"</i> tiam la sekva alvoko:<br> printIndented ("\t", getRK_val ("plot_options.code.calculate"));</br><br> post kiam la grafika funkcio devus fari la laboron.</br>
ru: <i>allow_grid</i>: установка в значение «true» («false») включает (отключает) отображение вкладки «<label id="tab_grid"/>». Если установлено значение «true», из функции code.calculate (смотрите ниже) можно извлечь код параметров сетки (эта функция, в свою очередь, извлекает его из grid_options.code.printout). В частности, если модуль параметров графика встроен с помощью <i>id="plot_options"</i>, то вызов<br> printIndented ("\t", getRK_val ("plot_options.code.calculate"));</br><br> после функции построения графика должен справиться с этой задачей.</br>
tr: <i>allow_grid</i>: Bunu "true" ("false") olarak ayarlamak ‘<label id="tab_grid"/>’ sekmesinin görüntülenmesini etkinleştirir (devre dışı bırakır). "true" ise ızgara seçenekleri için olan kod, onu grid_options.code.printout’tan alan (aşağı bakın) code.calculate’den çıkarılabilir. Tam olarak, grafik seçenekleri eklentisi bir <i>id="plot_options"</i> kullanarak gömülmüşse çizme işlevinden sonra yapılacak bir:<br> printIndented (‘\t’, getRK_val ("plot_options.code.calculate"));</br><br> çağrısı işi tamamlar.</br>

source: In order to allow flexible use, the generated options are separated into different sections:
ar: للسماح بالاستخدام المرن، تُفصل الخيارات المولدة إلى أقسام مختلفة:
eo: Por permesi flekseblan uzon, la generitaj elektebloj estas apartigitaj en malsamajn sekciojn:
ru: Чтобы обеспечить гибкость использования, сгенерированные параметры выделяются в следующие разделы:
tr: Esnek kullanıma olanak sağlamak amacıyla oluşturulan seçenekler farklı bölümlere ayrılmıştır:

source: <i>code.preprocess</i>: Nothing yet, but will hopefully include some <b>par</b> options.
ar: <i>code.preprocess</i>: لا شيء بعد، لكن نأمل أن يضم بعض خيارات <b>par</b>.
eo: <i>code.preprocess</i>: Ankoraŭ nenio, sed espereble inkludos kelkajn elekteblojn de <b>par</b>.
ru: <i>code.preprocess</i>: пока здесь ничего нет, но в будущем тут должны появиться некоторые параметры <b>par</b>.
tr: <i>code.preprocess</i>: Henüz bir şey yok; ancak bazı <b>par</b> seçenekleri içereceğini umuyoruz.

source: <i>code.calculate</i>: Currently this contains only the <b>grid</b>-options.
ar: <i>code.calculate</i>: حاليًا هذا يحتوي فقط على خيارات <b>grid</b>.
eo: <i>code.calculate</i>: Nuntempe ĉi tio enhavas nur la <b>krado</b>-opciojn.
ru: <i>code.calculate</i>: в текущей версии программы здесь содержатся только параметры <b>grid</b>.
tr: <i>code.calculate</i>: Şu anda bu yalnızca <b>grid</b> seçeneklerini içerir.

source: Default plot options
ar: خيارات الرسم مبدئي
eo: Defaŭltaj grafiko-opcioj
ru: Параметры графика по умолчанию
tr: Öntanımlı çizim seçenekleri
