Repository: KDE/rkward
Catalog: po/*/rkward__embedded.po
Languages: ar, eo, ru, tr

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Oliver Kellogg
ru: Олеся Герасименко
tr: Emir SARI

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: olivermkellogg@gmail.com
ru: translation-team@basealt.ru
tr: emir_sari@icloud.com

source: Level selector
ar: محدد المستوى
eo: Nivela elektilo
ru: Выбор уровня
tr: Düzey seçicisi

source: Note: Some values were cut off.
ar: ملاحظة: بعض القيم اقتُطِعَت.
eo: Noto: Iuj valoroj estis fortranĉitaj.
ru: Примечание: некоторые значения были обрезаны.
tr: Not: Bazı değerler kesildi.

source: Generic plugin to limit a single numeric vector to the n largest / smallest values. This plugin is designed to be embedded into other plugins.
ar: إضافة عامة لتقييد متجه رقمي واحد إلى أكبر / أصغر n من القيم. صُمِّمَت هذه الإضافة للتضمين في إضافات أخرى.
eo: Ĝenerala kromaĵo por limigi ununuran nombran vektoron al la n plej grandaj / plej malgrandaj valoroj. Ĉi tiu kromaĵo estas desegnita por esti enigita en aliajn kromaĵojn.
ru: Универсальный модуль для ограничения одного числового вектора n самых больших / самых маленьких значений. Этот модуль разработан для встраивания в другие модули.
tr: Tek bir sayısal vektörü n en büyük/en küçük değerle sınırlamak için genel eklenti. Bu eklenti diğer eklentilere gömülecek şekilde tasarlanmıştır.

source: Specify the desired length cutoff and sorting. Note that the result is always sorted, with the sum of remainder values appended at the end.
ar: حدِّد الحد الأقصى للطول المطلوب والفرز. لاحظ أن النتيجة مرتبة دائمًا، مع إلحاق مجموع القيم المتبقية في النهاية.
eo: Indiku la deziratan longotranĉon kaj ordigon. Notu ke la rezulto estas ĉiam ordigita, kun la sumo de restvaloroj almetitaj ĉe la fino.
ru: Укажите нужные обрезку длины и сортировку. Обратите внимание, что результат всегда сортируется, а сумма остаточных значений добавляется в конце.
tr: İstenilen uzunlukta kesme ve sıralamayı belirtin. Sonucun her zaman sonuna kalan değerlerin toplamı eklenerek sıralandığını unutmayın.

source: Maximum number of regular groups to display. One additional group "others" will be displayed, if appropriate.
ar: العدد الأقصى للمجموعات العادية للعرض. تُعرَض مجموعة إضافية واحدة "أخرى"، إذا كان ذلك مناسبًا.
eo: Maksimuma nombro de regulaj grupoj por montri. Unu plia grupo "aliaj" estos montrata, se konvene.
ru: Максимальное количество регулярных групп для отображения. При необходимости будет показана одна дополнительная группа «прочие».
tr: Görüntülenecek en çok düzenli grup sayısı. Uygun olması halinde ek bir ‘diğerleri’ grubu görüntülenecektir.

source: Should the largest or the lowest values be kept? For most purposes, you will want to keep the largest values.
ar: هل يجب الاحتفاظ بالقيم الأكبر أم الأصغر؟ لأغراض كثيرة، سترغب في الاحتفاظ بالقيم الأكبر.
eo: Ĉu la plej grandaj aŭ la plej malaltaj valoroj estu konservitaj? Por plej multaj celoj, vi volos konservi la plej grandajn valorojn.
ru: Следует ли оставлять наибольшие или наименьшие значения? В большинстве случаев нужно оставлять наибольшие значения.
tr: En büyük değerler mi yoksa en düşük değerler mi tutulmalı? Çoğu amaç için en büyük değerleri korumak isteyeceksiniz.

source: Should a category be added for the remaining value (those which have been cut off)? Note: This will always be appended to the end of the vector.
ar: هل يجب إضافة فئة للقيم المتبقية (تلك التي اقتُطِعَت)؟ ملاحظة: هذه دائمًا تُلحَق في نهاية المتجه.
eo: Ĉu oni devas aldoni kategorion por la restanta valoro (tiuj kiuj estis fortranĉitaj)? Noto: Ĉi tio ĉiam estos almetita al la fino de la vektoro.
ru: Следует ли добавить категорию для остаточных значений (тех, которые были обрезаны)? Примечание: всегда будет выполняться добавление к концу вектора.
tr: Kalan değere (kesilenler) kategori eklenmeli mi? Not: Bu her zaman vektörün sonuna eklenecektir.

source: Statistic to use for summarizing the cut off values.
ar: الإحصائية التي يجب استعمالها لتلخيص القيم المقتطعة.
eo: Statistiko por uzi por resumi la fortranĉajn valorojn.
ru: Статистическая характеристика, которая будет использоваться для суммирования обрезанных значений.
tr: Kesim değerlerini özetlemek için kullanılacak istatistik.

source: If you chose to use a custom statistic for summarizing the cut off values, specify it, here, as a function of <em>x</em>.
ar: إذا اخترت استعمال إحصائية مخصصة لتلخيص القيم المقتطعة، حدِّدها هنا كدالة في <em>x</em>.
eo: Se vi elektis uzi propran statistpiktogram por resumi la fortranĉvalorojn, specifu ĝin ĉi tie kiel funkcio de <em>x</em>.
ru: Если для суммирования обрезанных значений выбрана нестандартная статистическая характеристика, укажите её здесь как функцию <em>x</em>.
tr: Kesme değerlerini özetlemek için özel bir istatistik kullanmayı seçtiyseniz bunu burada <em>x</em>’in bir işlevi olarak belirtin.

source: Label to use for the "others" category. Note: If your data is not labeled, emptying this field will sometimes be preferable.
ar: اللصيقة التي يجب استعمالها لفئة "أخرى". ملاحظة: إذا كانت بياناتك غير ملصقة، فتفضَّل بترك هذا الحقل فارغًا أحيانًا.
eo: Etikedo por uzi por la kategorio "aliaj". Noto: Se viaj datumoj ne estas etikeditaj, malplenigi ĉi tiun kampon foje estos preferinda.
ru: Подпись для категории «прочие». Примечание: если данные не имеют подписей, иногда лучше оставить это поле пустым.
tr: ‘Diğerleri’ kategorisi için kullanılacak etiket. Not: Verileriniz etiketlenmemişse bazen bu alanın boşaltılması tercih edilebilir.

source: General users may skip this section of help, this is primarily for developers.
ar: يمكن للمستخدمين العامين تخطّي قسم المساعدة هذا، فهو مخصص في المقام الأول للمطورين.
eo: Ĝeneralaj uzantoj povas preterlasi ĉi tiun sekcion de helpo, ĉi tio estas ĉefe por programistoj.
ru: Обычные пользователи могут пропустить этот раздел справки, он предназначается в основном для разработчиков.
tr: Genel kullanıcılar yardımın bu bölümünü atlayabilir; bu öncelikle geliştiriciler içindir.

source: The generated code is available from <i>code.calculate</i>.
ar: الشيفرة المولدة متاحة من <i>code.calculate</i>.
eo: La generita kodo haveblas ĉe <i>code.calculate</i>.
ru: Сгенерированный код доступен с помощью <i>code.calculate</i>.
tr: Üretilen koda <i>code.calculate</i> adresinden ulaşılabilir.

source: The following external properties are provided for use in the embedding plugin.
ar: الخصائص الخارجية التالية متوفرة للاستعمال في إضافة التضمين.
eo: La jenaj eksteraj propraĵoj estas provizitaj por uzo en la enkonstrua kromaĵo.
ru: Для использования в модуле встраивания предоставляются следующие внешние свойства.
tr: Aşağıdaki dış özellikler gömme eklentisinde kullanılmak üzere sağlanmıştır.

source: <i>invar</i>: Symbol name of the input variable to be limited. Defaults to 'x'.
ar: <i>invar</i>: اسم رمز المتغير المُدخَل لتقييده. القيمة المبدئية هي 'x'.
eo: <i>invar</i>: Simbolonomo de la eniga variablo limigota. Defaŭlte al 'x'.
ru: <i>invar</i>: обозначение входной переменной, которая будет ограничена. По умолчанию: «x».
tr: <i>invar</i>: Sınırlanacak girdi değişkeninin sembol adı. Öntanımlı olarak ‘x’tir.

source: <i>outvar</i>: Symbol name to use for the output variable (the limited vector). May be identical to <i>invar</i>. Defaults to 'x'.
ar: <i>outvar</i>: اسم الرمز الذي يجب استعماله للمتغير المُخرَج (المتجه المُقيَّد). قد يكون مطابقًا لـ <i>invar</i>. القيمة المبدئية هي 'x'.
eo: <i>outvar</i>: Simbolonomo por uzi por la eliga variablo (la limigita vektoro). Povas esti identa al <i>invar</i>. Defaŭlte al 'x'.
ru: <i>outvar</i>: обозначение, которое будет использоваться для выходной переменной (ограниченный вектор). Может совпадать с <i>invar</i>. По умолчанию: «x».
tr: <i>outvar</i>: Çıktı değişkeni (sınırlı vektör) için kullanılacak sembol adı. <i>invar</i> ile aynı olabilir. Öntanımlı olarak ‘x’tir.

source: <i>parameters</i>: This property will be set to a string describing the limitation options, suitable for pasting into the <i>parameters</i> argument of <b>rk.header()</b>.
ar: <i>parameters</i>: ستُضبَط هذه الخاصية على سلسلة نصية تصف خيارات التقييد، مناسبة للّصق في وسيط <i>parameters</i> الخاص بـ <b>rk.header()</b>.
eo: <i>parametroj</i>: Ĉi tiu propreco estos agordita al ĉeno priskribanta la limigajn elektojn, taŭga por alglui en la argumenton <i>parametroj</i> de <b>rk.header()</b>.
ru: <i>parameters</i>: значением этого свойства будет строка с описанием параметров ограничения, подходящая для вставки в аргумент <i>parameters</i> функции <b>rk.header()</b>.
tr: <i>parameters</i>: Bu özellik, <b>rk.header()</b>’ın <i>parameters</i> argümanına yapıştırmaya uygun, sınırlama seçeneklerini açıklayan bir diziye ayarlanacaktır.

source: Limit Vector Length
ar: تقييد طول المتجه
eo: Limiga Vektora Longo
ru: Ограничение длины вектора
tr: Vektör Uzunluğunu Sınırla

source: Limit
ar: الحد
eo: Limo
ru: Ограничение
tr: Sınır

source: Sorting
ar: الفرز
eo: Ordigado
ru: Сортировка
tr: Sıralama

source: Keep smallest values
ar: احتفظ بالقيم الأصغر
eo: Konservu plej malgrandajn valorojn
ru: Оставить наименьшие значения
tr: En düşük değeri tut

source: Keep largest values
ar: احتفظ بالقيم الأكبر
eo: Konservu plej grandajn valorojn
ru: Оставить наибольшие значения
tr: En yüksek değeri tut

source: Add remainder category
ar: أضِف فئة المتبقي
eo: Aldonu restan kategorion
ru: Добавить категорию остатков
tr: Kalan kategorisi ekle

source: Statistic
ar: إحصائية
eo: Statistiko
ru: Статистическая характеристика
tr: İstatistik

source: Sum
ar: المجموع
eo: Sumo
ru: Сумма
tr: Toplam

source: Mean
ar: المتوسط
ru: Среднее
tr: Ortalama

source: Other:
ar: أخرى:
eo: Alia:
ru: Другое:
tr: Diğer

source: Custom statistic (as function of x)
ar: إحصائية مخصصة (كدالة في x)
eo: Propra statistiko (kiel funkcio de x)
ru: Нестандартная статистическая характеристика (как функция x)
tr: Özel istatistik (x’in işlevi olarak)

source: Remainder category label
ar: لصيقة فئة المتبقي
eo: Etikedo de cetera kategorio
ru: Подпись категории остатков
tr: Kalan kategorisi düzeyi

source: Generic tabulation plugin (single outcome vector). This plugin is designed to be embedded into other plugins.
ar: إضافة جدولة عامة (متجه نتيجة واحد). صُمِّمَت هذه الإضافة للتضمين في إضافات أخرى.
eo: Ĝenerala tabulado kromaĵo (ununura rezulta vektoro). Ĉi tiu kromaĵo estas desegnita por esti enigita en aliajn kromaĵojn.
ru: Универсальный модуль табулирования (единственный выходной вектор). Этот модуль разработан для встраивания в другие модули.
tr: Genel tablolandırma eklentisi (tek sonuç vektörü). Bu eklenti diğer eklentilere gömülecek biçimde tasarlanmıştır.

source: Allows to tabulate frequencies, or aggregate a single variable, by the levels of one or more grouping variables.
ar: يسمح بجدولة الترددات، أو تجميع متغير واحد، حسب مستويات متغيرات تجميع واحدة أو أكثر.
eo: Permesas tabeligi frekvencojn, aŭ aldoni ununuran variablon, laŭ la niveloj de unu aŭ pluraj grupaj variabloj.
ru: Позволяет табулировать частоты или агрегировать единственную переменную по уровням одной или нескольких переменных группировки.
tr: Bir veya daha fazla gruplama değişkeninin düzeylerine göre sıklıkları tablolaştırmaya veya tek bir değişkeni toplamaya olanak tanır.

source: Select the grouping variables. Often, these will be factors. The levels of each grouping variable will be crossed.
ar: اختر متغيرات التجميع. غالبًا، هذه تكون عوامل. مستويات كل متغير تجميع تُتقاطَع.
eo: Elektu la grupajn variablojn. Ofte, ĉi tiuj estos faktoroj. La niveloj de ĉiu grupiga variablo estos krucitaj.
ru: Выберите переменные группировки. Часто такими переменными являются факторы. Уровни каждой переменной группировки будут пересечены.
tr: Gruplandırma değişkenlerini seçin. Çoğu zaman bunlar çarpanlar olacaktır. Her gruplama değişkeninin düzeyleri çaprazlanır.

source: Type of tabulation / statistic to compute. This can be frequency of occurrence, or a function of a separate vector.
ar: نوع الجدولة / الإحصائية المراد حسابها. يمكن أن تكون تردد الحدوث، أو دالة في متجه منفصل.
eo: Tipo de tabeligo/statistiko por komputi. Tio povas esti ofteco de okazo, aŭ funkcio de aparta vektoro.
ru: Тип табулирования или статистической характеристики для вычисления. Это может быть частота появления или функция отдельного вектора.
tr: Hesaplanacak tablo/istatistik türü. Bu, meydana gelme sıklığı veya ayrı bir vektörün işlevi olabilir.

source: When computing a statistic other than frequency, specify the vector containing the underlying data, here.
ar: عند حساب إحصائية بخلاف التردد، حدِّد المتجه الذي يحتوي على البيانات الأساسية، هنا.
eo: Dum komputado de statistiko krom frekvenco, specifu la vektoron enhavantan la subestajn datumojn, ĉi tie.
ru: При вычислении статистической характеристики, отличной от частоты, укажите здесь вектор с лежащими в основе данными.
tr: Sıklık dışında bir istatistik hesaplarken, temel verileri içeren vektörü burada belirtin.

source: When the statistic is set to "Other:", this allows you to specify an arbitrary function to compute the statistic. The function may take a vector (a sub-group of the variable selected above) as parameter "x", and must return a single numeric value. Typical examples are "mean(x)" or "sd(x)".
ar: عندما تُضبَط الإحصائية على "أخرى:"، يسمح لك هذا بتحديد دالة عشوائية لحساب الإحصائية. قد تأخذ الدالة متجهًا (مجموعة فرعية من المتغير المختار أعلاه) كوسيط "x"، ويجب أن ترجع قيمة رقمية واحدة. الأمثلة النموذجية هي "mean(x)" أو "sd(x)".
eo: Kiam la statistiko estas agordita al "Alia:", tio ebligas al vi specifi arbitran funkcion por komputi la statistpiktogram. La funkcio povas preni vektoron (subgrupo de la variablo elektita supre) kiel parametro "x", kaj devas redoni ununuran nombra valoro. Tipaj ekzemploj estas "mean(x)" aŭ "sd(x)".
ru: Когда для статистической характеристики установлено значение «Другое», можно указать произвольную функцию для её вычисления. Эта функция может обрабатывать вектор (подгруппу переменной, которая выбрана выше) как параметр «x» и должна возвращать единственное числовое значение. Типичные примеры: «mean(x)» или «sd(x)».
tr: İstatistik ‘Diğer:’ olarak ayarlandığında bu, istatistiği hesaplamak için isteğe bağlı bir işlev belirtmenize olanak tanır. İşlev, ‘x’ parametresi olarak bir vektörü (yukarıda seçilen değişkenin bir alt grubu) alabilir ve tek bir sayısal değer döndürmelidir. Tipik örnekler ‘mean(x)’ veya ‘sd(x)’tir.

source: <link href="rkward://component/crosstab"/> and
ar: <link href="rkward://component/crosstab"/> و
eo: <link href="rkward://component/crosstab"/> kaj
ru: <link href="rkward://component/crosstab"/> и
tr: <link href="rkward://component/crosstab"/> ve

source: <link href="rkward://component/crosstab_multi"/> for tabulation of frequencies across many variables.
ar: <link href="rkward://component/crosstab_multi"/> لجدولة الترددات عبر العديد من المتغيرات.
eo: <link href="rkward://component/crosstab_multi"/> por tabeligado de frekvencoj tra multaj variabloj.
ru: <link href="rkward://component/crosstab_multi"/> для табулирования частот для многих переменных.
tr: birçok değişkene göre sıklıkların tablolaştırılması için <link href="rkward://component/crosstab_multi"/>

source: The following external properties are provided for use in the embedding plugin:
ar: الخصائص الخارجية التالية متوفرة للاستعمال في إضافة التضمين:
eo: La sekvaj eksteraj propraĵoj estas provizitaj por uzo en la enkonstrua kromaĵo:
ru: Для использования в модуле встраивания предоставляются следующие внешние свойства:
tr: Gömme eklentisinde kullanılmak üzere aşağıdaki dış özellikler sağlanmıştır:

source: <i>varsource</i>: The tabulation plugin does not show its own varselector by default. Connect your own to this one (<i>client="embedded_id.varsource.selected" governor="myvarselector_id.selected"</i>).
ar: <i>varsource</i>: لا تعرض إضافة الجدولة محدد متغيراتها الخاص بها مبدئيًّا. وصِّل محدد متغيراتك الخاص بها بهذا المحدد (<i>client="embedded_id.varsource.selected" governor="myvarselector_id.selected"</i>).
eo: <i>varsource</i>: La tabulacia kromaĵo ne montras sian propran varselektilon defaŭlte. Konektu vian propran al ĉi tiu (<i>client="embedded_id.varsource.selected" governor="myvarselector_id.selected"</i>).
ru: <i>varsource</i>: по умолчанию модуль табулирования не показывает своё собственное средство выбора переменных (varselector). Подключите используемое средство к модулю (<i>client="embedded_id.varsource.selected" governor="myvarselector_id.selected"</i>).
tr: <i>varsource</i>: Tablolama eklentisi öntanımlı olarak kendi varselector’ını göstermez. Kendinizinkini buna bağlayın (<i>client="embedded_id.varsource.selected" governor="myvarselector_id.selected"</i>).

source: <i>outvar</i>: By default, the plugin produces a table in a variable called "x". You can set it to use a different name, here.
ar: <i>outvar</i>: مُبدئيًّا، تُنتِج الإضافة جدولًا في متغير يُسمّى "x". يمكنك ضبطه لاستعمال اسم مختلف، هنا.
eo: <i>outvar</i>: Defaŭlte, la kromprogramo produktas tabelon en variablo nomata "x". Vi povas agordi ĝin por uzi alian nomon, ĉi tie.
ru: <i>outvar</i>: по умолчанию модуль создаёт таблицу в переменной с именем «x». Здесь можно задать использование другого имени.
tr: <i>outvar</i>: Öntanımlı olarak eklenti, ‘x’ adlı bir değişkende bir tablo üretir. Burada farklı bir ad kullanacak biçimde ayarlayabilirsiniz.

source: <i>titlevar</i>: If you want the plugin to save a description of the grouping variables in an R variable, set this to an object name to use. Else set this to "" to disable. Defaults to "title"
ar: <i>titlevar</i>: إذا أردت للإضافة أن تحفظ وصفًا لمتغيرات التجميع في متغير R، فاضبِط هذا إلى اسم كائن لاستعماله. وإلا فاضبِط هذا إلى "" لتعطيله. القيمة المبدئية هي "title"
eo: <i>titlevar</i>: Se vi volas, ke la kromaĵo konservu priskribon de la grupaj variabloj en R-variablo, agordu ĉi tion al objektonomo por uzi. Alie agordu ĉi tion al "" por malŝalti. Defaŭlte al "titolo"
ru: <i>titlevar</i>: если модуль должен сохранять описание переменных группировки в переменной R, укажите имя объекта для использования. В ином случае укажите "" для отключения свойства. Значение по умолчанию: "title"
tr: <i>titlevar</i>: Eklentinin gruplandırma değişkenlerinin açıklamasını bir R değişkenine kaydetmesini istiyorsanız bunu kullanılacak bir nesne adı olarak ayarlayın. Aksi takdirde devre dışı bırakmak için bunu "" olarak ayarlayın. Öntanımlı olarak "title" kullanılır

source: <i>fun_label</i>: This property will be set to a description of the statistic.
ar: <i>fun_label</i>: تُضبَط هذه الخاصية على وصف للإحصائية.
eo: <i>fun_label</i>: Ĉi tiu propreco estos agordita al priskribo de la statistiko.
ru: <i>fun_label</i>: значением этого свойства будет описание статистической характеристики.
tr: <i>fun_label</i>: Bu özellik, istatistiğin açıklamasına ayarlanır.

source: <i>parameters</i>: This property will be set to a string describing the tabulation options, suitable for pasting into the <i>parameters</i> argument of <b>rk.header()</b>.
ar: <i>parameters</i>: تُضبَط هذه الخاصية على سلسلة نصية تصف خيارات الجدولة، مناسبة للّصق في وسيط <i>parameters</i> الخاص بـ <b>rk.header()</b>.
eo: <i>parametroj</i>: Ĉi tiu propreco estos agordita al ĉeno priskribanta la tabelopciojn, taŭga por alglui en la argumenton <i>parametroj</i> de <b>rk.header()</b>.
ru: <i>parameters</i>: значением этого свойства будет строка с описанием параметров табулирования, подходящая для вставки в аргумент <i>parameters</i> функции <b>rk.header()</b>.
tr: <i>parameters</i>: Bu özellik, <b>rk.header()</b>’ın <i>parameters</i> argümanına yapıştırmaya uygun, tablolama seçeneklerini açıklayan bir diziye ayarlanacaktır.

source: Frequency
ar: التردد
eo: Frekvenco
ru: Частота
tr: Sıklık

source: Sum of %1
ar: مجموع %1
eo: Sumo de %1
ru: Сумма %1
tr: %1 toplamı

source: Tabulation groups
ar: مجموعات الجدولة
eo: Tabulaj grupoj
ru: Группы табулирования
tr: Tablolama grupları

# Tabulate X by Y [by Z [...]]
source: by
ar: بواسطة
eo: de
ru: по
tr: tarafından:

source: Tabulation statistic
ar: إحصائية الجدولة
eo: Tabeliga statistiko
ru: Статистическая характеристика табулирования
tr: Tablolama istatistiği

source: Tabulate
ar: جدوِل
eo: Tabeligi
ru: Табулирование
tr: Tablolandır

source: Grouping factors
ar: عوامل التجميع
eo: Grupigaj faktoroj
ru: Факторы группировки
tr: Gruplama çarpanları

source: Values
ar: القيم
eo: Valoroj
ru: Значения
tr: Değerler

source: Custom statistic
ar: إحصائية مخصصة
eo: Propra statistiko
ru: Нестандартная статистическая характеристика
tr: Özel istatistik

source: Embedded plugins
ar: الإضافات المضمَّنة
eo: Enigita kromaĵojn
ru: Встроенные модули
tr: Gömülü eklentiler

source: Not for direct use: Utility plugins that can be included by other plugins. Part of the official RKWard distribution
ar: ليس للاستعمال المباشر: إضافات مساعدة يمكن تضمينها بواسطة إضافات أخرى. جزء من توزيع أر كي وارد الرسمي
eo: Ne por rekta uzo: Utilaj aldonaĵoj, kiuj povas esti inkluzivitaj de aliaj aldonaĵoj. Parto de la oficiala RKWard-distribuo
ru: Не для непосредственного использования: вспомогательные модули, которые могут включать в себя другие модули. Часть официального дистрибутива RKWard
tr: Doğrudan kullanım için değildir: Diğer eklentilerin içerebileceği izlence eklentileri. Resmi RKWard dağıtımının bir parçası

source: Plot Options
ar: خيارات الرسم البياني
eo: Grafikaj Opcioj
ru: Параметры графика
tr: Grafik Seçenekleri

source: Color Chooser
ar: مُختار اللون
eo: Kolora elektilo
ru: Выбор цвета
tr: Renk Seçicisi

source: Step Function plot options
ar: خيارات رسم دالة الخُطوة
eo: Paŝo Funkcio grafiko opcioj
ru: Параметры графика ступенчатой функции
tr: Adım İşlevi Grafiği Seçenekleri

source: Histogram Options
ar: خيارات المدرج التكراري
eo: Histogramaj Opcioj
ru: Параметры гистограммы
tr: Histogram Seçenekleri

source: Barplot Options
ar: خيارات الرسم البياني الشريطي
eo: Barplot Opcioj
ru: Параметры столбчатого графика
tr: Bar Grafiği Seçenekleri

source: Draw Grid
ar: ارسم شبكة
eo: Desegni Kradon
ru: Рисование сетки
tr: Çizme Izgarası

source: Select by value
ar: اختر حسب القيمة
eo: Elektu laŭ valoro
ru: Выбор по значению
tr: Değere göre seç

source: Multi Input
ar: إدخال متعدد
eo: Multi Enigo
ru: Несколько источников данных
tr: Çoklu Giriş

source: Run Code
ar: شغِّل الشيفرة
eo: Kuru Kodon
ru: Запуск кода
tr: Kodu Çalıştır

source: Install from git
eo: Instali de git
ru: Установка из git
tr: Git’ten kur

source: Install from git results
eo: Instalu el git-rezultoj
ru: Установка из результатов git
tr: Git sonuçlarından kur

source: Set the location where the package resides that you want to install.
eo: Agordu la lokon kie loĝas la pakaĵo, kiun vi volas instali.
ru: Укажите расположение пакета, который требуется установите.
tr: Kurmak istediğiniz paketin nerede bulunduğunu seçin.

source: Specify the user name (GitHub, GitLab and Bitbucket only).
eo: Indiku la uzantnomon (nur GitHub, GitLab kaj Bitbucket).
ru: Укажите имя пользователя (только GitHub, GitLab и Bitbucket).
tr: Kullanıcı adını belirtin (Yalnızca Github, Gitlab ve BitBucket)

source: Give the repository name (GitHub, GitLab and Bitbucket only).
eo: Donu la deponejon nomon (nur GitHub, GitLab kaj Bitbucket).
ru: Укажите имя репозитория (только GitHub, GitLab и Bitbucket).
tr: Depo adını belirtin (Yalnızca Github, Gitlab ve BitBucket)

source: Give the full URL to the repository (generic git and svn only).
eo: Donu la plenan URL al la deponejo (nur ĝeneralaj git kaj svn).
ru: Укажите полный URL-адрес репозитория (только типовые git и svn).
tr: Deponun tam URL’sini belirtin (Yalnızca Git ve SVN)

source: If you want a certain commit, tag or branch for installation, define that here.
eo: Se vi volas certan kommit, etikedon aŭ branĉon por instalo, difinu tion ĉi tie.
ru: Если для установки требуется определённая фиксация, метка или ветвь, укажите это здесь.
tr: Kurulum için belirli bir işleme, etiket veya dal istiyorsanız bunu burada tanımlayın.
