Repository: KDE/rkward
Catalog: po/*/rkward__analysis.po
Languages: eo

source: Chi-squared test for outlier
eo: Chi-kvadrata testo por eksterordinara

source: This test performs a chisquared test for detection of one outlier.
eo: Tiu ĉi testo elfaris ĉi-kvadratan teston por detekto de unu eksteraĵo.

source: Choose the data set to find one outlier, based on chisquared distribution of squared differences between data and sample mean. You can choose multiple data. Please consider that this test is no longer recommended. See <link href="rkward://rhelp/chisq.out.test"/>.
eo: Elektu la datuman aron por trovi unu eksteraĵon, surbaze de kvadrata distribuo de kvadrataj diferencoj inter datumoj kaj specimena meznombro. Vi povas elekti plurajn datumojn. Bonvolu konsideri, ke ĉi tiu testo ne plu estas rekomendita. Vidu <link href="rkward://rhelp/chisq.out.test"/>.

source: Select the data to be computed. The vectors need to be numeric, and can be of different length. For the calculation missing values are removed from the data.
eo: Elektu la datumojn por esti komputitaj. La vektoroj devas esti nombraj, kaj povas esti de malsama longo. Por la kalkulo mankantaj valoroj estas forigitaj de la datumoj.

source: Check if you want not the value with largest difference from the mean, but opposite (lowest, if most suspicious is highest etc.).
eo: Kontrolu ĉu vi volas ne la valoron kun plej granda diferenco de la meznombro, sed kontraŭa (plej malsupra, se plej suspektinda estas plej alta ktp.).

source: Print additional descriptive statistics (mean, sd, median, min, max) to help with interpretation of the test result (purely informational, does not affect the test). Missing values will be ignored.
eo: Presu pliajn priskribajn statistikojn (mezumo, sd, mediano, min, maksimumo) por helpi pri interpretado de la testrezulto (nure informa, ne influas la teston). Mankantaj valoroj estos ignoritaj.

source: test specific settings
eo: testi specifajn agordojn

source: Opposite
eo: Kontraŭe

source: Show additional descriptives
eo: Montri pliajn priskribojn

source: Dixon Q-statistic
eo: Dixon Q-statistiko

source: Dixon test for outlier
eo: Dixon-testo por eksterordinara

source: This test performs the Dixon test for outlier.
eo: Ĉi tiu testo elfaras la Dixon-teston por eksteraĵo.

source: Choose the data to perform the Dixon test for outlier. You can choose multiple vectors. See <link href="rkward://rhelp/dixon.test"/>.
eo: Elektu la datumojn por plenumi la Dixon-teston pri eksteraĵo. Vi povas elekti plurajn vektorojn. Vidu <link href="rkward://rhelp/dixon.test"/>.

source: Select the data to be computed. The vectors need to be numeric, and can be of different length but there is a limit.
eo: Elektu la datumojn por esti komputitaj. La vektoroj devas esti nombraj, kaj povas esti de malsama longo sed ekzistas limo.

source: Specifies the variant of test to be performed. See <link href="rkward://rhelp/dixon.test"/> for details. The default value (0) means that a suitable variant is selected automatically, according to the size of the sample.
eo: Specifas la varianton de provo farota. Vidu <link href="rkward://rhelp/dixon.test"/> por detaloj. La defaŭlta valoro (0) signifas, ke taŭga varianto estas elektita aŭtomate, laŭ la grandeco de la specimeno.

source: Should the test be treated as two-sided (default)?
eo: Ĉu la testo estu traktata kiel duflanka (defaŭlte)?

source: Here you can define if you want to check not the value with largest difference from the mean, but opposite.
eo: Ĉi tie vi povas difini ĉu vi volas kontroli ne la valoron kun plej granda diferenco de la meznombro, sed kontraŭa.

source: Dixon tests for outlier
eo: Dixon testas por eksteraĵo

source: Variant of test
eo: Variaĵo de testo

source: 0 (Automatic)
eo: 0 (aŭtomata)

source: 10 (sample size 3-7)
eo: 10 (specimeno 3-7)

source: 11 (sample size 8-10)
eo: 11 (specimeno 8-10)

source: 20 (sample size 11-13)
eo: 20 (specimeno 11-13)

source: 21 (sample size 14 and more)
eo: 21 (specimeno 14 kaj pli)

source: two-sided
eo: duflanka

source: Grubbs tests for one or two outliers in data sample
eo: Grubbs testas por unu aŭ du outliers en datuma specimeno

source: This test performs the Grubbs tests for one or two outliers in data sample.
eo: Ĉi tiu testo elfaras la Grubbs-testojn por unu aŭ du outliers en datuma specimeno.

source: Choose the data to perform the Grubbs tests for one or two outliers in data sample. You can choose multiple data. See <link href="rkward://rhelp/grubbs.test"/>.
eo: Elektu la datumojn por fari la Grubbs-testojn por unu aŭ du eksterordinaroj en datuma specimeno. Vi povas elekti plurajn datumojn. Vidu <link href="rkward://rhelp/grubbs.test"/>.

source: Select the data to be computed. The vectors need to be numeric, and may be of different length.
eo: Elektu la datumojn por esti komputitaj. La vektoroj devas esti nombraj, kaj povas esti de malsama longo.

source: Variant of test to be performed. One or two outliers can be detected, on the same, or on opposite tails.
eo: Variaĵo de provo farota. Unu aŭ du eksteruloj povas esti detektitaj, sur la sama, aŭ sur kontraŭaj vostoj.

source: Should the test be treated as two-sided?
eo: Ĉu la testo estu traktata kiel duflanka?

source: 10 (test for one outlier)
eo: 10 (testo por unu eksterordinara)

source: 11 (test for two outliers on opposite tails)
eo: 11 (testo pri du eksteraĵoj sur kontraŭaj vostoj)

source: 20 (test for two outliers on one tail)
eo: 20 (testo pri du eksteruloj sur unu vosto)

source: Find potential outlier
eo: Trovu eblan eksteraĵon

source: Shows the value with largest difference from sample mean (potential outlier).
eo: Montras la valoron kun plej granda diferenco de specimena meznombro (ebla eksterordinara).

source: Choose the data to find the value with the largest difference from the sample mean. You can select multiple vectors. See <link href="rkward://rhelp/outlier"/>.
eo: Elektu la datumojn por trovi la valoron kun la plej granda diferenco de la specimena meznombro. Vi povas elekti plurajn vektorojn. Vidu <link href="rkward://rhelp/outlier"/>.

source: Select the data to be computed. The vectors need to be numeric. Any missing values are ignored in the calculation.
eo: Elektu la datumojn por esti komputitaj. La vektoroj devas esti nombraj. Ĉiuj mankantaj valoroj estas ignoritaj en la kalkulo.

source: Select this option to give the opposite value. If the largest value has maximum difference from the mean, it gives smallest and vice versa.
eo: Elektu ĉi tiun opcion por doni la kontraŭan valoron. Se la plej granda valoro havas maksimuman diferencon de la meznombro, ĝi donas plej malgrandan kaj inverse.

source: Find value with largest difference from the mean
eo: Trovu valoron kun plej granda diferenco de la meznombro

# R code comment
source: calculate f from eta squared
eo: kalkulu f el eta kvadrato

# R code comment
source: Catch errors due to unsuitable data
eo: Kaptu erarojn pro netaŭgaj datumoj

source: Power analysis not possible with the data you provided
eo: Potenca analizo ne eblas kun la datumoj, kiujn vi provizis

# R code comment
source: Prepare printout
eo: Preparu printaĵon

source: alternative
eo: alternativo

source: Parameters
eo: Parametroj

source: <strong>Note:</strong>
eo: <strong>Noto:</strong>

# Argument is name of statistic, e.g. 'r'
source: Interpretation of effect size <strong>%1</strong> (according to Cohen):
eo: Interpreto de efikgrandeco <strong>%1</strong> (laŭ Cohen):

# effect size
source: small
eo: malgranda

# effect size
source: medium
eo: meza

# effect size
source: large
eo: granda

source: Power analysis
eo: Analizo de potenco

source: Perform power analysis for a variety of statistical methods.
eo: Faru povan analizon por diversaj statistikaj metodoj.

source: Given three of the parameters 'power of test', 'sample size', 'effect size', and 'significance level', this plugin will estimate the fourth, i.e. for example the test power of a t.test at a given sample size, effect size, and level of significance. On the left hand, specify the statistical method, on the right hand side, enter the values of the given parameters. In the control in the middle, select which of the parameters to estimate. Note that in some cases it will not be possible to estimate a (finite) parameter at the given specifications. In general, this means that you have to increase sample size(s) or effect size, or decrease effect power or parameter count.
eo: Konsiderante tri el la parametroj 'potenco de testo', 'specimena grandeco', 'efekta grandeco' kaj 'signifnivelo', ĉi tiu kromaĵo taksos la kvaran, t.e. ekzemple la testan potencon de t.test je difinita specimena grandeco. , efikgrandeco, kaj nivelo de signifo. Maldekstre, specifu la statistikan metodon, dekstre, enigu la valorojn de la donitaj parametroj. En la regilo en la mezo, elektu kiun el la parametroj taksi. Notu ke en kelkaj kazoj ne estos eble taksi (finian) parametron ĉe la donitaj specifoj. Ĝenerale, tio signifas, ke vi devas pliigi specimenan grandecon(j) aŭ efikgrandecon, aŭ malpliigi efikpotencon aŭ parametron.

source: Specify the statistical method to perform power estimation for
eo: Specifi la statistikan metodon por elfari potencotakson por

source: Number of groups. For ANOVA, only.
eo: Nombro de grupoj. Por ANOVA, nur.

source: Only enabled where applicable. Specify the nature of samples used in the test. For samples of different sizes, only one sample size can be estimated.
eo: Nur ebligita kie aplikebla. Indiku la naturon de specimenoj uzataj en la testo. Por specimenoj de malsamaj grandecoj, nur unu specimengrandeco povas esti taksita.

source: Specify the hypothesis to use. Note that for the one-sided hypothesis "first is greater", a positive effect size is expected. For "second is greater", a negative effect size is expected.
eo: Indiku la hipotezon por uzi. Notu, ke por la unuflanka hipotezo "unue estas pli granda", oni atendas pozitivan efpiktogram. Por "sekundo estas pli granda", oni atendas negativan efpiktogram.

source: Only shown where applicable. Allows you to select, whether to specify the effect size as Cohen's f, or as Eta squared.
eo: Nur montrata kie aplikebla. Permesas al vi elekti ĉu specifi la efikgrandecon kiel f de Cohen aŭ kiel Eta kvadrato.

source: Parameter to estimate, given the others.
eo: Parametro por taksi, donitaj la aliaj.

source: Targeted power of test (1 minus Type II error probability)
eo: Celita potenco de testo (1 minus Tipo II-erarprobablo)

source: Only shown for chi-square statistics: Targeted degrees of freedom. As a reminder, this is (rows &minus; 1)&times;(columns &minus; 1) for a test of independence, and (cells &minus; 1) for a test of goodness of fit.
eo: Nur montrata por ĥi-kvadrata statistiko: Celitaj gradoj de libereco. Kiel rememorigilo, ĉi tio estas (vicoj − 1)×(kolumnoj − 1) por testo de sendependeco, kaj (ĉeloj − 1) por testo de boneco de taŭgeco.

source: Only shown for general linear model: Targeted numerator degrees of freedom. As a reminder, this is the number of parameters to estimate, or number of groups/samples minus 1.
eo: Nur montrata por ĝenerala lineara modelo: Celitaj numeratorgradoj da libereco. Kiel memorigilo, ĉi tio estas la nombro da parametroj por taksi, aŭ nombro da grupoj/specimenoj minus 1.

source: Only shown for general linear model: Available denominator degrees of freedom / degrees of freedom of the error term. As a reminder, this is the total number of observations minus numerator degrees of freedom minus 1, or total number of observations minus number of groups/samples.
eo: Nur montrata por ĝenerala lineara modelo: Disponeblaj denominatoraj gradoj da libereco / gradoj da libereco de la erara termino. Kiel rememorigilo, ĉi tio estas la tutsumo de observaĵoj minus numeratorgradoj da libereco minus 1, aŭ tutsumo de observaĵoj minus nombro de grupoj/specimenoj.

source: Sample size. Note that depending on the selected method, this can mean observations per sample, per group, or in total. Make sure to read the note shown below the control.
eo: Specimena grandeco. Notu, ke depende de la elektita metodo, ĉi tio povas signifi observaĵojn por specimeno, por grupo aŭ entute. Nepre legi la noton montritan sub la regilo.

source: Minimum detectable effect size. Note that effect size specifications differ between the available methods. Be sure to read the note shown below the control. As a reminder, for mapping between cohen's f and Eta&sup2; use f&sup2; = Eta&sup2; / (1 &minus; Eta&sup2;)
eo: Minimuma konstatebla efikgrandeco. Notu, ke efikgrandecspecifoj malsamas inter la disponeblaj metodoj. Nepre legu la noton montritan sub la regilo. Kiel memorigilo, por mapado inter f de cohen kaj Eta² uzu f² = Eta² / (1 − Eta²)

source: Targeted level of significance
eo: Celita signifonivelo

source: <link href="rkward://rhelp/pwr"> Description of the R package "pwr", used to perform the power calculations. </link>
eo: <link href="rkward://rhelp/pwr"> Priskribo de la R-pakaĵo "pwr", uzata por fari la potencokalkulojn. </link>

source: RKWard GUI to perform power analysis and sample size estimation.
eo: RKWard GUI por fari potencan analizon kaj specimenan grandecon takson.

# Author name
source: Michalke
eo: Miĥalke

# Author name
source: Thomas
eo: Tomaso

# Here 'power' is a common statistical term and should not be translated
source: Power analysis
eo: Analizo de potenco

source: Statistical Method
eo: Statistika Metodo

source: Select a method
eo: Elektu metodon

source: t-Tests of means
eo: t-Provoj de rimedoj

source: Correlation test
eo: Testo de korelacio

source: ANOVA (balanced one-way)
eo: ANOVA (ekvilibra unudirekta)

source: General linear model
eo: Ĝenerala lineara modelo

source: Chi-squared test
eo: Chi-kvadrata testo

source: Proportion tests
eo: Proporciaj provoj

source: Mean of a normal distribution (known variance)
eo: Meznomo de normala distribuo (konata varianco)

source: Number of groups
eo: Nombro de grupoj

source: Samples
eo: Specimenoj

source: Two samples (equal sizes)
eo: Du specimenoj (egalaj grandecoj)

source: Two samples (different sizes)
eo: Du specimenoj (malsamaj grandecoj)

source: Single sample (test against constant)
eo: Ununura specimeno (testo kontraŭ konstanto)

source: Paired samples
eo: Parigitaj specimenoj

source: One sample
eo: Unu specimeno

source: Using test hypothesis
eo: Uzante testhipotezon

source: First is greater
eo: Unue estas pli granda

source: Second is greater
eo: La dua estas pli granda

source: Hypothesis probably expects a negative effect size!
eo: Hipotezo verŝajne atendas negativan efikon!

source: Hypothesis probably expects a positive effect size!
eo: Hipotezo verŝajne atendas pozitivan efikon!

source: Provided effect size
eo: Provizita efikgrandeco

source: Cohen's f
eo: la f. de Cohen

source: Eta squared
eo: Eta kvadrata

source: Target measure
eo: Cela mezuro

source: Parameter to determine
eo: Parametro por determini

# Here 'power' is a common statistical term and should not be translated
source: Power of test
eo: Potenco de testo

source: Sample size
eo: Specimena grandeco

source: Effect size
eo: Efekto grandeco

source: Significance level
eo: Signifnivelo

source: Parameter count
eo: Parametrokalkulo

source: Known measures
eo: Konataj mezuroj

# Here 'power' is a common statistical term and should not be translated
source: Power
eo: Potenco

source: Degrees of freedom
eo: Gradoj de libereco

source: Degrees of freedom for numerator
eo: Gradoj de libereco por numeratoro

source: Degrees of freedom for denominator
eo: Gradoj de libereco por denominatoro

source: First sample size
eo: Unua specimena grandeco

source: Second sample size
eo: Dua specimena grandeco

source: Number of observations
eo: Nombro de observoj

source: Number of observations <b> per sample </b>
eo: Nombro da observoj <b> po specimeno </b>

source: Number of observations <b> per group </b>
eo: Nombro da observoj <b> po grupo </b>

source: Number of observations <b> in total </b>
eo: Nombro da observoj <b> entute </b>

source: Number of <b> pairs </b>
eo: Nombro de <b> paroj </b>

source: Measure for selected method is <b> Cohen's d </b>
eo: Mezuro por elektita metodo estas <b> d de Cohen </b>

source: Measure for selected method is <b> Pearson's r </b>
eo: Mezuro por elektita metodo estas <b> r de Pearson </b>

source: Measure for selected method is <b> Cohen's f </b>
eo: Mezuro por elektita metodo estas <b> f de Cohen </b>

source: Measure for selected method is <b> Eta <sup> 2 </sup> </b>
eo: Rimedo por elektita metodo estas <b> Eta <sup> 2 </sup> </b>

source: Measure for selected method is <b> Cohen's f <sup> 2 </sup> </b>
eo: Rimedo por elektita metodo estas <b> f <sup> 2 </sup> </b> de Cohen

source: Measure for selected method is <b> Cohen's w </b>
eo: Mezuro por elektita metodo estas <b> w de Cohen </b>

source: Measure for selected method is <b> Cohen's h </b>
eo: Mezuro por elektita metodo estas <b> h de Cohen </b>

# Here 'power' is a common statistical term and should not be translated
source: Save results to workspace
eo: Konservu rezultojn al laborspaco

source: Perform a simple linear regression. Currently, this plugin provides only basic functionality. For more options refer to <link href="rkward://rhelp/lm"/>.
eo: Faru simplan linearan regreson. Nuntempe, ĉi tiu kromaĵo provizas nur bazajn funkciojn. Por pliaj elektebloj referu al <link href="rkward://rhelp/lm"/>.

source: Select the variable to be predicted (dependent), and one or more independent variables.
eo: Elektu la antaŭdirotan variablon (dependan), kaj unu aŭ plurajn sendependajn variablojn.

source: The dependent variable. This must be numeric.
eo: La dependa variablo. Ĉi tio devas esti nombra.

source: One or more independent variables, each of the same length as the dependent. Note that factor variables are treated as categorial predictors, while numeric variables are treated as continuous predictors, automatically.
eo: Unu aŭ pluraj sendependaj variabloj, ĉiu de la sama longo kiel la dependa. Notu ke faktoraj variabloj estas traktataj kiel kategoriaj prognoziloj, dum nombraj variabloj estas traktataj kiel kontinuaj prognoziloj, aŭtomate.

source: Should an intercept term be included in the model?
eo: Ĉu interkapta termino estu inkluzivita en la modelon?

source: Print standardized correlation coefficients? This requires the lm.beta package.
eo: Ĉu presi normigitajn korelaciajn koeficientojn? Ĉi tio postulas la pakaĵon lm.beta.

source: Show an analysis of variance table.
eo: Montru analizon de varianza tabelo.

source: Save the full fitted model.
eo: Konservu la plenan ekipitan modelon.

source: Extract and save predicted values from the model.
eo: Eltiru kaj konservu antaŭviditajn valorojn de la modelo.

source: Extract and save residuals from the model.
eo: Eltiru kaj konservu restaĵojn de la modelo.

source: Fitting Linear Models
eo: Fitting Linear Modeloj

source: Model
eo: Modelo

source: dependent variable
eo: dependa variablo

source: independent variables
eo: sendependaj variabloj

source: Include intercept
eo: Inkluzivi interkapton

source: Show standardized coefficients
eo: Montru normigitajn koeficientojn

source: Show ANOVA table
eo: Montru ANOVA-tabelon

source: Save
eo: Konservi

source: Save full fitted model
eo: Konservu plenan ekipitan modelon

source: Save fitted values
eo: Konservu taŭgajn valorojn

source: Save residuals
eo: Konservu restaĵojn

source: Comparing
eo: Komparante

source: constant value: %1
eo: konstanta valoro: %1

source: Equal variances
eo: Egalaj variancoj

source: assumed
eo: supozis

source: not assumed
eo: ne supozita

source: Variable Name
eo: Varia Nomo

source: estimated mean
eo: laŭtaksa meznombro

source: degrees of freedom
eo: gradoj de libereco

source: t-Test (two variable paired or independent samples, or one variable).
eo: t-Testo (du variaj parigitaj aŭ sendependaj specimenoj, aŭ unu variablo).

source: Choose two numeric vectors or one vector and a constant to compare against each other. For two samples, specify whether the variables are paired or independent samples. For details, see below.
eo: Elektu du nombrajn vektorojn aŭ unu vektoron kaj konstanton por kompari unu kontraŭ la alia. Por du specimenoj, specifu ĉu la variabloj estas parigitaj aŭ sendependaj specimenoj. Por detaloj, vidu malsupre.

source: Choose whether you want a two samples test (paired samples or independent samples), or to test a single variable against a constant
eo: Elektu ĉu vi volas du provan teston (paritaj specimenoj aŭ sendependaj specimenoj), aŭ testi ununuran variablon kontraŭ konstanto

source: A numeric vector for the first variable
eo: Nombra vektoro por la unua variablo

source: A numeric vector for the second variable. Available for two samples tests only.
eo: Nombra vektoro por la dua variablo. Havebla nur por du provaj provoj.

source: A numeric constant. Available for tests against constant only.
eo: Nombra konstanto. Havebla nur por provoj kontraŭ konstanto.

source: Whether to assume equal variances for the two samples (for independent samples t-test, only). This option is implied for a paired test.
eo: Ĉu supozi egalajn variancojn por la du specimenoj (por sendependaj provaĵoj t-testo, nur). Ĉi tiu elekteblo estas implicita por parigita testo.

source: Alternative hypothesis (H1) of the test.
eo: Alternativa hipotezo (H1) de la testo.

source: Whether to print the confidence interval of the estimated mean.
eo: Ĉu presi la konfidan intervalon de la laŭtaksa meznombro.

source: Confidence level to print.
eo: Fidonivelo por presi.

source: Test form
eo: Testformularo

source: Independent samples
eo: Sendependaj specimenoj

source: assume equal variances
eo: supozi egalajn variadojn

source: Show Confidence Interval
eo: Montru Konfidan Intervalon

source: Two Variable t-Test
eo: Du Variabla t-Testo

source: As a first step, select the type of test to conduct.
eo: Kiel unua paŝo, elektu la tipon de testo por fari.

source: Select "Independent samples" when comparing data from two different populations (e.g. treatment group vs. control group). For comparing matched pairs or repeated measures on the same subject, select "Paired samples". Finally, you can also test a single sample against a constant value.
eo: Elektu "Sendependaj specimenoj" kiam vi komparas datumojn de du malsamaj populacioj (ekz. traktadogrupo kontraŭ kontrolgrupo). Por kompari kongruajn parojn aŭ ripetajn mezurojn pri la sama temo, elektu "Parigitaj specimenoj". Fine, vi ankaŭ povas testi ununuran specimenon kontraŭ konstanta valoro.

source: Select the parameters of the t-test. If your hypothesis is directed, selecting a directional test hypothesis may increase test power.
eo: Elektu la parametrojn de la t-testo. Se via hipotezo estas direktita, elekti unudirektan testhipotezon povas pliigi testan potencon.

source: Sometimes it's helpful to get an estimate of the confidence interval of the difference in means.
eo: Kelkfoje estas utile akiri takson de la konfida intervalo de la diferenco en mezumoj.

source: Below you can specify whether one should be shown, and which confidence-level should be applied (95% corresponds to a 5% level of significance).
eo: Malsupre vi povas specifi ĉu oni devas montri, kaj kiun konfidan nivelon apliki (95% respondas al 5%-nivelo de signifo).

source: This test performs the Mood Two-Sample Test of Scale.
eo: Ĉi tiu testo elfaras la Mood Two-Sample Test of Scale.

source: Select two data sets to test for a difference in scale parameters by the Mood Two-Sample Test. For this test the samples need to be numeric vectors (see below for details).
eo: Elektu du datumajn arojn por provi diferencon en skalaj parametroj per la Mood Two-Sample Test. Por ĉi tiu testo la provaĵoj devas esti nombraj vektoroj (vidu malsupre por detaloj).

source: First sample. The vectors need to be numeric.
eo: Unua specimeno. La vektoroj devas esti nombraj.
