Repository: KDE/rkward
Catalog: po/*.po
Languages: pl

source: &Run
pl: U&ruchom

source: &Interrupt
pl: Przerw&ij

source: &Print Log
pl: &Drukuj log

source: Export Log
pl: Eksportuj log

source: &Clear Log
pl: Wy&czy¶æ log

source: Watch
pl: Podgl±d

source: &Open new editor window
pl: &Otwórz nowe okno edycji

source: Configure Editor
pl: Konfiguruj edytor

source: Commands
pl: Polecenia

source: Sorry, no help available so far
pl: Przykro mi, plik pomocy nie jest jeszcze dostêpny

source: R Console
pl: R-konsola

source: Issuing command:
pl: Wprowadzane polecenie:

source: Got reply:
pl: Otrzymana odpowied¼:

source: An unspecified error occured while running the command. Probably a syntax error. Those - unfortunately - are not handled very well, yet.
pl: Wyst±pi³ nieznany b³±d w czasie wykonywania polecenia. Prawdopodobnie to b³±d syntaktyczny. Które - niestety - nie s± obs³ugiwane zbyt dobrze, jak na razie.

source: Object Editor
pl: Edytor obiektów

source: R Object Editor
pl: Edytor R-obiektów

source: This is a list of the objects present in the R workspace.
pl: Oto lista obiektów obecnych w roboczej przestrzeni R.

source: Object browser
pl: Przegl±darka obiektów

source: Setting up plugins...
pl: £adowanie wtyczek...

source: Could not find any plugins! RKWard is pretty useless without plugins, so you should use Settings->Plugins to import some.
pl: Nie znaleziono ¿adnych wtyczek! RKWard jest bezu¿yteczny bez wtyczek, tak wiêc powiniene¶ u¿yæ Ustawienia->Wtyczki aby je zaimportowaæ.

source: No plugins found
pl: Nie znaleziono ¿adnych wtyczek

source: Ready.
pl: Gotowe.

source: New Command File
pl: Nowy plik poleceñ

source: Open Command File
pl: Otwórz plik poleceñ

source: Save Command File
pl: Zapisz plik poleceñ

source: Save Command File As
pl: Zapisz jako... plik poleceñ

source: Open Workspace
pl: Otwórz przestrzeñ robocz±

source: Save Workspace
pl: Zapisz przestrzeñ robocz±

source: Save Workspace As
pl: Zapisz jako... przestrzeñ robocz±

source: Load R Libraries
pl: Za³aduj R-biblioteki

source: Close current editor
pl: Zamknij bie¿±cy edytor

source: Close All Editors
pl: Zamknij wszystkie edytory

source: Paste inside Table
pl: Wklej do tabeli

source: Paste inside Selection
pl: Wklej do zaznaczenia

source: Show R Console-Window
pl: Poka¿ okno R-konsoli

source: Show Output-Window
pl: Poka¿ okno wyników

source: Show Object Browser-Window
pl: Poka¿ okno przegl±darki

source: Run All
pl: Uruchom wszystko

source: Run Selection
pl: Uruchom zaznaczone

source: Interrupt running command
pl: Przerwij uruchomione polecenie

source: Configure Settings
pl: Konfiguracja ustawieñ

source: Creates a new empty data.frame and opens it for editing
pl: Tworzy pusty data.frame i otwiera go do edycji

source: Opens an existing document
pl: Otwiera istniej±cy dokument

source: Opens a recently used file
pl: Otwiera ostatnio u¿ywany plik

source: Saves the actual document
pl: Zapisuje bie¿±cy dokument

source: Saves the actual document as...
pl: Zapisuje jako... bie¿±cy dokument

source: Closes the current data editor
pl: Zamyka bie¿±cy edytor danych

source: Closes all open data editors
pl: Zamyka wszystkie otwarte edytory danych

source: Prints out the actual document
pl: Drukuje bie¿±cy dokument

source: Quits the application
pl: Zamyka aplikacjê

source: Cuts the selected section and puts it to the clipboard
pl: Wycina zaznaczone i umieszcza je w schowku

source: Copies the selected section to the clipboard
pl: Kopiuje zaznaczone do schowka

source: Pastes the clipboard contents to actual position
pl: Wkleja zawarto¶æ schowka

source: Pastes the clipboard contents to actual position, but not beyond the table's boundaries
pl: Wkleja zawarto¶æ schowka, ale nie poza tabel±

source: Pastes the clipboard contents to actual position, but not beyond the boundaries of the current selection
pl: Wkleja zawarto¶æ schowka, ale nie poza bie¿±ce zaznaczenie

source: Enables/disables the toolbar
pl: W³±cza lub wy³±cza pasek narzêdziowy

source: Enables/disables the statusbar
pl: W³±cza lub wy³±cza pasek statusu

source: starting R-processor
pl: start R-procesora

source: Do you want to save the workspace?
pl: Czy chcesz zapisaæ obszar roboczy?

source: Save workspace?
pl: Zapisaæ obszar roboczy?

source: Create new data.frame
pl: Utwórz nowy data.frame

source: Enter name for the new object
pl: Podaj nazwê nowego obiektu

source: The name you specified was already in use or not valid. Renamed to %1
pl: Nazwa, któr± poda³e¶ ju¿ istnieje lub jest nieprawid³owa. Zmieniono nazwê na %1

source: Invalid Name
pl: Nieprawid³owa nazwa

source: Opening workspace...
pl: Otwieranie obszaru roboczego

source: *|All files
pl: *|Wszystkie pliki

source: Open File...
pl: Otwórz plik...

source: Do you want to save the current workspace?
pl: Czy chcesz zapisaæ bie¿±cy obszar roboczy?

source: Printing...
pl: Drukowanie...

source: Exiting...
pl: Koñczymy...

source: Cutting selection...
pl: Wklejanie zaznaczenia...

source: Copying selection to clipboard...
pl: Kopiowanie zaznaczenia do schowka...

source: Inserting clipboard contents...
pl: Wklejanie zawarto¶ci schowka...

source: Toggling toolbar...
pl: Prze³±czanie paska narzêdzi...

source: Toggle the statusbar...
pl: Prze³±czanie paska statusu...

source: R-process busy
pl: R-proces zajêty

source: R-process idle
pl: R-proces niezajêty

source: Open file
pl: Otwórz plik

source: Could not save document
pl: Nie mo¿na zapisaæ dokumentu

source: Save file
pl: Zapis pliku

source: The document has been modified. Close anyway?
pl: Dokument zosta³ zmodyfikowany bez zapisu. Mimo to zamkn±æ?

source: File not saved
pl: Pliku nie zapamiêtany

source: file to open
pl: otwierany plik

source: Verbosity of debug messages (0-5)
pl: Obfito¶æ komunikatów debagera (0-5)

source: Mask for components to debug as a binary number (see debug.h)
pl: Maskuj komponemty debagowane jako liczby binarne (patrz debug.h)

source: Output Window
pl: Okno wyników

source: &Print Output
pl: Wy&druk wyników

source: Export Output
pl: Eksport wyników

source: &Clear Output
pl: Wy&czy¶æ wyniki

source: Output
pl: Wyniki

source: Update
pl: Aktualizuj

source: Objects in the R workspace
pl: Obiekty w R obszarze roboczym

source: Rename
pl: Zmiana nazwy

source: Rename object
pl: Zmiana nazwy obiektu

source: Enter the new name
pl: Wprowad¼ now± nazwê

source: Object name:
pl: Nazwa obiektu:

source: Full location:
pl: Pe³na ¶cie¿ka:

source: Classes:
pl: Klasy:

source: Dimensions:
pl: Wymiary:

source: Result of 'print (
pl: Wynik polecenia 'print (

source: Object-Viewer for object
pl: Przegl±darka obiektów dla obiektu

source: - Waiting for results from R...
pl: - Oczekiwanie na wyniki z R...

source: Some error(s) occured:
pl: Wyst±pi³y b³êdy:
